{"/contact":{"title":"Contact monetr","data":{"":"Below are the preferred ways for contacting monetr staff.GitHub: github.com/monetr/monetrEmail: support@monetr.appDiscord: Join Discord ServerPhone: (651) 243-0035Mail:\nmonetr LLC\nPO Box 436\nLindstrom, MN 55045","note#Note":"The easiest way to get in contact with someone for support is via GitHub, Email or Discord. You are welcome to call\nour phone number, but at the moment we will not answer and would call you back at a later time.If your inquiry involves sensitive or personal information, please contact us directly via phone or email. Do not\ndisclose personal or sensitive information in any public channels."}},"/documentation/development":{"title":"Contributing to monetr","data":{"":"We want to make it as easy as possible for monetr users to become contributors. This documentation is still very much a\nwork in progress, but as time goes on it will hopefully become a helpful guide to building out features or fixing\nproblems within monetr."}},"/documentation/development/api":{"title":"REST API","data":{"":"monetr is built with an \"API first\" design. As such all of the functionality that monetr offers is available via the\nREST API.The API and the documentation around it is still changing rapidly, so integrating with monetr's API may be error prone\nas newer versions are released."}},"/documentation/development/api/authentication":{"title":"Authentication","data":{"":"Authentication resources for monetr's REST API.Authentication is primarily broken up into three objects. Logins, users, and accounts. Each of these objects are\ndifferent from each other, but all of them are related. Logins are used to represent a single person's credentials for\naccessing monetr, as well as some of their basic information like their name. Users are a child object of logins, and a\nsingle login can have multiple users. Users are tied to a single account. Accounts are how all data is separated inside\nthe application. When you create a Plaid Link or expenses, or other budgeting items. They are created at an account\nlevel. Your login tells us what users represent you, and those users tell us what accounts you have access to.\nAt the moment logins are limited to a single user. This is a software constraint for now. The design to allow logins\naccess to multiple users was to allow (in the future) people to have shared access to an account. Such as with a\nspouse.","login#Login":"Provide login credentials to authenticate a user. This API will not respond with a token in the body. It stores the\ntoken in an HTTP only cookie to prevent it from being accessible from Javascript code in the browser. If the credentials\nare valid then you will receive a 200 OK status code in the response.","request-body#Request Body":"Attribute\tType\tRequired\tDescription\temail\tstring\tyes\tThe email address associated with the desired login.\tpassword\tstring\tyes\tThe login password. Passwords must be at least 8 characters.\tcaptcha\tstring\tno *\tBy default this field is not required, but if captcha is enabled then this field will be required. It should be the resulting value of a ReCAPTCHA challenge.\ttotp\tstring\tno\tNot yet fully implemented, but will be used to provide TOTP codes for the user during the authentication flow.","response-body#Response Body":"Attribute\tType\tRequired\tDescription\tisActive\tbool\tyes\tUsed as an indicator for whether or not the current user's subscription is active. If billing is disabled this is always true.\tnextUrl\tstring\tno\tIf the API needs to direct a user to a certain path after authenticating, this field will be present. This is intended to be used for on-boarding or for billing flows.\t\n??? noteWhen the request is successful the response body is pretty minimal. User details should be retrieved using a follow\nup request to Get Me","login-examples#Login Examples":"","successful#Successful":"If the credentials provided are valid and there is nothing else to be done, then the response will simply be this.","subscription-is-not-active#Subscription is not active":"If the subscription for the authenticated user is not active (or if there is no subscription at all), then the response\nbody will contain a path indicating to the UI what the next URL should be.","login-errors#Login Errors":"","invalid-credentials#Invalid Credentials":"If the credentials provided are not valid you will receive the following response body:","email-is-not-verified#Email is not verified":"If email verification is required by the server, then it is possible to get a login failure response even with valid\ncredentials. If the credentials provided are valid, but the login's email is not verified yet; then you will receive the\nfollowing response.","mfa-is-required#MFA is required":"That is not the only error that can result in a 428 status code, if the user requires MFA you will receive the same\nstatus code upon providing valid credentials. But the code in the error body will be different and represent what action\nneeds to be taken by the user.","logout#Logout":"Because cookies are HTTP only, there is no way to remove the cookies from our UI code. Instead, we have a logout\nendpoint that removes the cookies.","logout-examples#Logout Examples":"Logout does not return an error if the cookie is not present, it will always return a 200 status code with an empty\nresponse body.","register#Register":"New users can register for monetr using this endpoint. It can be configured to require ReCAPTCHA to reduce the\nlikelihood that the endpoint will be spammed. Even in self-hosted deployments, it will require a valid email address is\nused.  Registering will create a new login, user, and account using the provided details.If billing is enabled on the server, your email address will be used to create a Stripe customer. Stripe is used to\nmanage subscriptions and this way Stripe has a way to contact you or vice versa if needed.","request-body-1#Request Body":"Attribute\tType\tRequired\tDescription\temail\tstring\tyes\tThe email address associated with the desired login.\tpassword\tstring\tyes\tThe login password. Passwords must be at least 8 characters. Leading and trailing spaces are trimmed from the password.\tfirstName\tstring\tyes\tBy default this field is not required, but if captcha is enabled then this field will be required. It should be the resulting value of a ReCAPTCHA challenge.\tlastName\tstring\tyes\tNot yet fully implemented, but will be used to provide TOTP codes for the user during the authentication flow.\ttimezone\tstring\tyes\tThe timezone you want your account to be configured for.\tcaptcha\tstring\tno *\tCan be required if ReCAPTCHA is enabled on the server.\tbetaCode\tstring\tno *\tCan be required if the server requires an access code to create an account.\tagree\tbool\tyes\tUsed to denote that the user has agreed to the terms of use for monetr.","response-body-1#Response Body":"Attribute\tType\tRequired\tDescription\tmessage\tstring\tno\tIf the user needs to verify their email then this will contain a message that can be presented to the user.\trequireVerification\tbool\tyes\tIf the server requires that the login's email is verified, the fields below this will be omitted in the response body and this will be true. If this is false then the user does not need to verify their email.\tnextUrl\tstring\tno\tIf the API requires that the user take some on-boarding action, such as setting up a subscription. There will be a path provided here for the user to be redirected to.\tuser\tUser\tno\tIf email verification is not required by the server then the newly created user object will be present in the response.\tisActive\tbool\tno\tIndicated whether or not the user is active, for servers that require billing this will be false initially.","register-examples#Register Examples":"","successful-1#Successful":"If the registration was successful and email verification is not necessary then you'll see a response body similar to\nthe following.","email-verification-required#Email verification required":"If the registration succeeds, but we need to verify the login's email address.","email-already-exists#Email already exists":"If the provided email is already in use by someone else for monetr then you will receive a bad request response.\nEmail addresses are not used to send people content unprompted. Email addresses provide a reliable way to assure\nuniqueness in users, as well as a way to contact them for things like billing and resetting forgotten passwords.\nFor self-hosted deployments, it is not required that the email address used be one that can actually receive emails.\nHowever, this will limit your ability to easily reset forgotten passwords at this time."}},"/documentation/development/api/funding_schedules":{"title":"Funding Schedules","data":{"":"Funding schedules are used to tell monetr when to allocate funds to spending objects. They represent the frequency that\nyou are paid; or the frequency that you would like to allocate funds to things you are budgeting for. Funding schedules\nare specific to a single bank account and must have a unique name within a bank account.","list-funding-schedules#List Funding Schedules":"This endpoint does not support any pagination, it simply returns all of the funding schedules for the provided bank\naccount Id.","request-path#Request Path":"Attribute\tType\tRequired\tDescription\tbankAccountId\tstring\tyes\tThe ID of the bank account the funding schedules belong to.","response-body#Response Body":"Attribute\tType\tRequired\tDescription\tfundingScheduleId\tstring\tyes\tThe globally unique identifier for a funding schedule.\tbankAccountId\tstring\tyes\tThe bank account that this funding schedule belongs to, this will be the same as the bankAccountId provided in the URL path.\tname\tstring\tyes\tThe name of the funding schedule; this is unique per bank account.\tdescription\tstring\tno\tIf the funding schedule was created by the UI, then this will be a summary of the rule field in english.\trule\tstring\tyes\tThe RRule provided when the funding schedule was created; representing how frequently this funding schedule will occur.\texcludeWeekends\tbool\tyes\t:fontawesome-solid-flask: If this is true, then the nextOccurrence will never fall on a weekend. If the rule would have it fall on a weekend, then the date is adjusted to be the previous Friday.\testimatedDeposit\tnumber\tno\t:fontawesome-solid-flask: Estimated Deposit is going to be used to help calculate a free-to-use ahead of when someone would actually get paid.\tnextRecurrence\tdatetime\tyes\tThe next time this funding schedule will allocate funds to it's spending objects.","list-funding-schedules-examples#List Funding Schedules Examples":"","successful#Successful":"","create-funding-schedule#Create Funding Schedule":"Create a funding schedule by providing some basic information about when the funding schedule will occur next as well as\nhow frequently it occurs.","request-path-1#Request Path":"Attribute\tType\tRequired\tDescription\tbankAccountId\tstring\tyes\tThe ID of the bank account this new funding schedule should belong to.","request-body#Request Body":"Attribute\tType\tRequired\tDescription\tname\tstring\tyes\tThe name of the new funding schedule. For a given bankAccountId this value must be unique.\trule\tstring\tyes\tThe RRule representing how the funding schedule should occur. See RFC5545. Examples:  - The 15th and last day of every month: FREQ=MONTHLY;INTERVAL=1;BYMONTHDAY=15,-1  - Every other friday: FREQ=WEEKLY;INTERVAL=2;BYDAY=FR  - Every friday: FREQ=WEEKLY;INTERVAL=1;BYDAY=FR\tdescription\tstring\tno\tThe description of the funding schedule, this can be anything you want; but in the UI this is auto filled to be a string of the RRule. For example; The 15th and Last day of every month\texcludeWeekends\tbool\tno\t:fontawesome-solid-flask: Exclude weekends will adjust the occurrence dates if they were to fall on a weekend. It will set the date to be the closest previous business day. This will not impact the frequency of the funding schedule.\testimatedDeposit\tnumber\tno\t:fontawesome-solid-flask: Estimated Deposit is going to be used to help calculate a free-to-use ahead of when someone would actually get paid.\tnextRecurrence\tdatetime\tno\tYou can provide the next occurrence date in the create request, this date will be used on subsequence recurrences to determine the following contribution dates. For rules that have static dates defined like the 15th and last day of the month, this will not affect subsequent recurrences. But for rules that can be more loose, like every other friday; this will determine which \"every other\" friday it is.","response-body-1#Response Body":"Attribute\tType\tRequired\tDescription\tfundingScheduleId\tstring\tyes\tThe unique identifier for the funding schedule you created. This is globally unique within monetr.\tbankAccountId\tstring\tyes\tThis will be the value of the bankAccountId parameter you provided in the API path, and is included on GET requests as well.\tname\tstring\tyes\tThe name of the funding schedule provided by you, if there were leading or trailing spaces they will have been trimmed.\tdescription\tstring\tno\tIf a description was provided then it will be present here.\trule\tstring\tyes\tThe RRule provided when the funding schedule was created.\texcludeWeekends\tbool\tyes\tIf a value was provided in the create request, it will be present here; otherwise this will be false.\testimatedDeposit\tnumber\tno\t:fontawesome-solid-flask: Estimated Deposit is going to be used to help calculate a safe-to-spend ahead of when someone would actually get paid.\tnextRecurrence\tdatetime\tyes\tIf you provided a date time and it was in the future, that will be used for the next occurrence. If one was not provided, then this value will be calculated using the rule field and the current timestamp.","create-funding-schedule-examples#Create Funding Schedule Examples":"","successful-1#Successful":"If the funding schedule was created successfully, then you'll receive the created object back.","update-funding-schedule#Update Funding Schedule":"A funding schedule can be updated after it has been created, this will allow people to change when they get paid or when\nthey want to allocate funds to budgets. When updating a funding schedule it is recommended that you provide the entire\nfunding schedule object. Some fields can be omitted but may result in those fields being unset. To avoid this it is best\nto retrieve the entire funding schedule via an API call, and then update the fields needed and send the updated object\nback using this API endpoint.","request-path-2#Request Path":"Attribute\tType\tRequired\tDescription\tbankAccountId\tstring\tyes\tThe ID of the bank account this funding schedule you are updating belongs to.\tfundingScheduleId\tstring\tyes\tThe ID of the funding schedule that you are updating.","request-body-1#Request Body":"Attribute\tType\tRequired\tDescription\tname\tstring\tyes\tThe name of the new funding schedule. For a given bankAccountId this value must be unique.\trule\tstring\tyes\tThe RRule representing how the funding schedule should occur. See RFC5545. Examples:  - The 15th and last day of every month: FREQ=MONTHLY;INTERVAL=1;BYMONTHDAY=15,-1  - Every other friday: FREQ=WEEKLY;INTERVAL=2;BYDAY=FR  - Every friday: FREQ=WEEKLY;INTERVAL=1;BYDAY=FR\tdescription\tstring\tyes\tThe description of the funding schedule, this can be anything you want; but in the UI this is auto filled to be a string of the RRule. For example; The 15th and Last day of every month\texcludeWeekends\tbool\tyes\t:fontawesome-solid-flask: Exclude weekends will adjust the occurrence dates if they were to fall on a weekend. It will set the date to be the closest previous business day. This will not impact the frequency of the funding schedule.\testimatedDeposit\tnumber\tno\t:fontawesome-solid-flask: Estimated Deposit is going to be used to help calculate a free-to-use ahead of when someone would actually get paid.\tnextRecurrence\tdatetime\tyes\tYou can override the next time this funding schedule will be processed, if you do then the funding schedule will recur relative to this date going forward. This can be useful for adjusting a bi-weekly funding schedule to recur based on an alternate day of each week.","response-body-2#Response Body":"Attribute\tType\tRequired\tDescription\tfundingScheduleId\tstring\tyes\tThe unique identifier for the funding schedule you updated. This is globally unique within monetr.\tbankAccountId\tstring\tyes\tThis will be the value of the bankAccountId parameter you provided in the API path, and is included on GET requests as well.\tname\tstring\tyes\tThe name of the funding schedule provided by you, if there were leading or trailing spaces they will have been trimmed.\tdescription\tstring\tno\tIf a description was provided then it will be present here.\trule\tstring\tyes\tThe RRule used to calculate recurrences.\texcludeWeekends\tbool\tyes\tWhether or not this funding schedule will exclude weekends from its recurrence.\testimatedDeposit\tnumber\tno\t:fontawesome-solid-flask: Estimated Deposit is going to be used to help calculate a free-to-use ahead of when someone would actually get paid.\tnextRecurrence\tdatetime\tyes\tThe next time this funding schedule will be processed.","update-funding-schedule-examples#Update Funding Schedule Examples":"","successful-2#Successful":"If the funding schedule was updated successfully, then you'll receive the updated object back. Even if you only provided\na few fields in the request you will receive the entire object in the response.","delete-funding-schedule#Delete Funding Schedule":"Delete a funding schedule for a given bank account. This can only be done if there are no spending objects associated\nwith the funding schedule you want to remove. This will simply return a 200 Ok status code if it succeeds, there is\nno response body.","request-path-3#Request Path":"Attribute\tType\tRequired\tDescription\tbankAccountId\tstring\tyes\tThe ID of the bank account the funding schedule belongs to.\tfundingScheduleId\tstring\tyes\tThe ID of the funding schedule you want to remove.","delete-funding-schedule-example#Delete Funding Schedule Example":"","funding-schedule-does-not-exist#Funding Schedule Does Not Exist":"If you try to delete a funding schedule that does not exist, then you will receive the following error."}},"/documentation/development/api/links":{"title":"Links","data":{"":"Links are used to represent a connection between monetr and Plaid (or potentially some other source of data for bank\ntransactions and balances). But links can also be used to represent a manual budgeting \"area\". Links are either created\nautomatically by following the Plaid workflow; or can be created manually using these API endpoints to do manual\nbudgeting.","list-links#List Links":"This endpoint does not support any pagination, it simply returns all of the links associated with the currently\nauthenticated account.","response-body#Response Body":"Attribute\tType\tRequired\tDescription\tlinkId\tnumber\tyes\tThe unique identifier for a given link within monetr. This is unique.\tlinkType\tenum\tyes\tWhat type of link this is. - 0 Unknown (likely an error state) - 1 Plaid Link (managed) - 2 Manual Link\tplaidInstitutionId\tstring\tno\tIf the link is a Plaid link, then this will include Plaid's unique identifier for the institution it is assocaited with. This is used to retrieve basic institution information. It is null for manual links\tlinkStatus\tenum\tyes\tThe status of the link, for manual links this will always be 2. - 0 Unknown (likely an error state) - 1 Pending (the link is currently being setup by the user, or waiting on Plaid data) - 2 Setup (the link is healthy and functioning normally) - 3 Error (something is wrong with the link that might require user interaction to resolve) - 4 Pending Expiration (the credentials for the link are going to expire and it needs to be reauthenticated)  - 5 Revoked (the user has revoked access to the bank via Plaid)\terrorCode\tstring\tno\tIf the link is an error state this will have an error code from Plaid, this is used to help decide what action needs to be taken to fix the link.\texpirationDate\tdatetime\tno\tIf the Plaid link can expire, then its expiration date will be stored here. After this date the link will need to be reauthenticated.\tinstitutionName\tstring\tyes\tThe name of the instituion or link. If this is a Plaid link then this will be the name of the bank assocaited with the link in Plaid. If this is a manual link then this will be the name given to the link at creation.\tcustomInstitutionName\tstring\tno\tPlaid links cannot have their institutionName updated, but if the user wants a custom name for a Plaid link then this field will be used.\tcreatedAt\tdatetime\tyes\tWhen this link was created. This will be in UTC.\tcreatedByUserId\tnumber\tyes\tThe ID of the user who created the link. Links are \"owned\" by the user who creates them. Even if multiple people have access to the same account, a link is \"owned\" by the one who creates it.\tupdatedAt\tdatetime\tyes\tWhen this link was last updated. Note: This field might not be well maintained and should not be relied on, it may be deprecated in the future.\tlastManualSync\tdatetime\tno\tThe last time this link was \"manually\" triggered to sync.\tlastSuccessfulUpdate\tdatetime\tno\tThe last time this link successfully received new data from Plaid.","create-manual-link#Create (Manual) Link":"Manual links can be created witha a post request. But allow only a subset of the fields to be provided and managed by\nthe client.","request-body#Request Body":"Attribute\tType\tRequired\tDescription\tinstitutionName\tstring\tyes\tThe name of the instituion or link.\tcustomInstitutionName\tstring\tno\tCustom institution name for a link, this field may be subject to changes in behavior for manual links","response-body-1#Response Body":"Attribute\tType\tRequired\tDescription\tlinkId\tnumber\tyes\tThe unique identifier for a given link within monetr. This is unique.\tlinkType\tenum\tyes\tWill always be 2 for manual links.\tlinkStatus\tenum\tyes\tThe status of the link, for manual links this will always be 2.\tinstitutionName\tstring\tyes\tThe name of the instituion or link. If this is a Plaid link then this will be the name of the bank assocaited with the link in Plaid. If this is a manual link then this will be the name given to the link at creation.\tcustomInstitutionName\tstring\tno\tPlaid links cannot have their institutionName updated, but if the user wants a custom name for a Plaid link then this field will be used.\tcreatedAt\tdatetime\tyes\tWhen this link was created. This will be in UTC.\tcreatedByUserId\tnumber\tyes\tThe ID of the user who created the link. Links are \"owned\" by the user who creates them. Even if multiple people have access to the same account, a link is \"owned\" by the one who creates it.\tupdatedAt\tdatetime\tyes\tWhen this link was last updated. Note: This field might not be well maintained and should not be relied on, it may be deprecated in the future.","create-manual-link-example#Create Manual Link Example":""}},"/documentation/development/api/plaid_links":{"title":"Plaid Links","data":{"":"Plaid Links are supporting resources behind the normal Link resource. They provide a way to retrieve real\ntransaction and balance data from a person's bank account using Plaid's API. These endpoints expose some basic\nfunctionality for interacting with Plaid Links through monetr's API rather than with Plaid directly.","new-plaid-link-token#New Plaid Link Token":"In order to connect a user's account with Plaid and thus their bank account, you need to create a link token. This token\nis then used by the Plaid SDK in the UI in order to provide an authentication flow for that user and their bank.Under the hood, monetr is making a call to Create Link Token.","request-query-parameters#Request Query Parameters":"Attribute\tType\tRequired\tDescription\tuse_cache\tbool\tfalse\tIf true then the endpoint will not try to create another link token if one has already been created for the current user and has not been completed. This is used to reduce the number of API calls made to Plaid. It is recommended to use true for this. The endpoint will never return a Link token that has already been used.","response-body#Response Body":"Attribute\tType\tRequired\tDescription\tlinkToken\tstring\tyes\tThe link token created from Plaid, this can be used with the Plaid SDK to authenticate a user's bank account.","new-link-token-examples#New Link Token Examples":"","successful#Successful":"If the user has not reached their limit for links  then they will receive a link token in the response and nothing\nelse.","new-link-errors#New Link Errors":"","link-limit-reached#Link Limit Reached":"","plaid-api-failure-or-other-failure#Plaid API failure or other failure":"","plaid-token-callback#Plaid Token Callback":"Once the user has completed authenticating their bank account using the Plaid SDK, you will be given a public_token.\nThis new token must be exchanged with Plaid's API in order to allow monetr to access the bank data. The bank account\nshould not be considered linked until this token is successfully exchanged.\nSelf-Hosted\nIf webhooks are not enabled on the monetr server, then a job to retrieve transactions from Plaid will immediately be\nkicked off once the token has successfully been exchanged. This job will only attempt to retrieve the last 7 days of\ntransactions from Plaid.","request-body#Request Body":"Attribute\tType\tRequired\tDescription\tpublicToken\tstring\tyes\tThe public_token you received from the Plaid Link flow via the SDK.\tinstitutionId\tstring\tyes\tThe Plaid institution_id, the API will not return an error if this is not provided (TODO). But it is required in order for the API to function properly.\tinstitutionName\tstring\tyes\tThe name of the institution as provided by the Plaid SDK. This is used as the initial name for the link until the user decides to rename it.\taccountIds\t[]string\tyes\tAn array of Plaid bank account IDs, this should be the list of IDs that the user selected when they were going through the link process.","response-body-1#Response Body":"Attribute\tType\tRequired\tDescription\tlinkId\tinteger\tyes\tThe ID of the newly created link for the Plaid connection.\t\nThere is an additional field in the response body called success. This field is not present if the request fails\nand is only present if it succeeds. The status of the request is already indicated properly using the status code of\nthe response. This field should not be used, it will be removed in the future.","plaid-token-callback-examples#Plaid Token Callback Examples":"","successful-1#Successful":"If monetr is able to exchange the public token successfully, then you will receive a successful response with the newly\ncreated Link ID.\nThe Link ID is not a unique identifier for Plaid, it is monetr's internal unique identifier.","plaid-token-callback-errors#Plaid Token Callback Errors":"","no-public-token-provided#No public token provided":"You must provide a public token to create a Plaid link, there is no other way to authenticate a bank account through\nPlaid.","no-accounts-provided#No accounts provided":"If you do not provide any Plaid bank account IDs then the API will not attempt to exchange the provided public token.","plaid-api-failure-or-other-failure-1#Plaid API failure or other failure":"","update-plaid-link#Update Plaid Link":"Plaid links can be updated after they have been established. This can be used as a method of re-authenticating a link if\nit ends up in an error state (though sometimes a link can end up in an error state without indicating ). This can\nalso be used as a way to add additional accounts to a link if those accounts were not originally granted access when the\nlink was created.","request-path-parameters#Request Path Parameters":"Attribute\tType\tRequired\tDescription\tlinkId\tnumber\tyes\tA link ID must be provided in order to put that link into update mode. The link must also be a Plaid link, a manual link will result in a bad request.","request-query-parameters-1#Request Query Parameters":"Attribute\tType\tRequired\tDescription\tupdate_account_selection\tboolean\tno\tThis parameter is used to specify whether you want to put this link into an update mode that will allow you to add/remove accounts that are visible to monetr. This will change the Plaid Link dialog behavior slightly when it is presented to the client.","update-link-examples#Update Link Examples":"","successful-2#Successful":"If the link is able to be put into update mode, then a Link Token is returned to the client. This can then be used with\nthe Plaid Link library to allow the user to update their account selection or re-authenticate their link with their\nbank.","update-link-errors#Update Link Errors":"","manual-link-update-requested#Manual Link Update Requested":"","manually-resync-plaid-link#Manually Resync Plaid Link":"Sometimes you might need to manually trigger a resync with Plaid; this can happen if there were issues where a webhook\nwas not properly received. By triggering a manual resync, transactions for the last 14 days and balances for all\nbank accounts within the specified link will be checked.Links can be manually synced once every 30 minutes, an error will be returned if you try to resync a link too quickly.\nThis will not send a \"sync\" request to Plaid. This will only retrieve data already available via Plaid's API\nand update monetr's data accordingly.","request-body-1#Request Body":"Attribute\tType\tRequired\tDescription\tlinkId\tnumber\tyes\tThe link ID that you want to manually resync. This must be a Plaid link that is in a status of Setup or Error. Other link statuses will result in a bad request.","manually-resync-examples#Manually Resync Examples":"","successful-3#Successful":"If the manual sync is kicked off successfully, you will recieve a 202 Accepted status code with no response body.","errors#Errors":"If the request fails then you will receive a JSON response body.","provided-link-does-not-exist#Provided Link does not exist":"","link-is-not-a-plaid-link#Link is not a Plaid link":"","link-is-not-in-a-valid-status#Link is not in a valid status":"","previous-manual-sync-was-too-recent#Previous manual sync was too recent":"","failed-to-enqueue-sync-job#Failed to enqueue sync job":"monetr can be configured to limit the number of links an account can have. This is for those using development\ncredentials. If you intend to self-host monetr and let friends and/or family use it, it is recommended that you\nlimit how many links someone can have to prevent someone from adding many links to their account and using up your\nlimited number of development links.If you fully authenticate a bank account, but you never exchange the public_token for that authenticated bank\naccount. It should not affect the number of accounts linked for development credentials.While working on monetr I had a link fail to receive any updates from Plaid/the bank. It still showed that it was in\na healthy state though. It didn't require re-authentication but at the time putting the link through \"link update\"\nwas ultimately what resolved it."}},"/documentation/development/api/spending":{"title":"Spending","data":{"":"Spending objects are used to represent how the user wants to spend their money and how frequently they want to or need\nto spend it. Spending objects create an \"earmark\" against the\navailable balance of the bank account they are associated with. This is then used to allow monetr to calculate an amount\nthat is safe for the user to spend at any given time; while making sure they still have funds for their defined\nfinancial obligations.","list-spending#List Spending":"This endpoint does not support any pagination, it simply returns all of the spending objects for the provided bank\naccount ID.","request-path#Request Path":"Attribute\tType\tRequired\tDescription\tbankAccountId\tnumber\tyes\tThe ID of the bank account the spending objects belong to.","response-body#Response Body":"Attribute\tType\tRequired\tDescription\tspendingId\tnumber\tyes\tThe unique identifier for a spending object within monetr.\tbankAccountId\tnumber\tyes\tThe bank account that the spending object belongs to. This will match the path parameter for this API endpoint.\tfundingScheduleId\tnumber\tyes\tThe ID of the funding schedule that is used to calculate contributions to the spending object.\tname\tstring\tyes\tThe name or title of the spending object, this must be unique within a bank account and spendingType.\tdescription\tstring\tno\tThe description for the spending object.\tspendingType\tenum\tyes\tThe type of spending object this is.  - 0 Expense  - 1 Goal\ttargetAmount\tnumber\tyes\tThe amount of money (in cents) that this spending object needs at or before it's nextRecurrence date.\tcurrentAmount\tnumber\tyes\tThe amount of money (in cents) that is allocated to this spending object.\tusedAmount\tnumber\tno\tThis field is only used for Goals, it is used to keep track of how much has been spent from the goal. When a transaction is spent from a Goal it increments the usedAmount equal the the amount of the transaction or the currentAmount of the spending object, whichever is lesser.\trecurrenceRule\tstring\tno\tThe RRule used to calculate the due dates for a spending object, this is only present for Expenses.\tlastRecurrence\tdatetime\tno\tThe timestamp of the last time this spending object was due. This is not a reflection of the last time the spending object was used.\tnextRecurrence\tdatetime\tyes\tThe timestamp of the next time this spending object is due, for a Goal this is just the day you want to complete the Goal. For an expense this is the next time it will recur before it is recalculated.\tnextContributionAmount\tnumber\tyes\tThe amount of money (in cents) that will be allocated to the currentAmount the next time the funding schedule is processed.\tisBehind\tboolean\tyes\tSpending objects can fall behind if there will not be a funding event before the nextRecurrence and the currentAmount is less than the targetAmount.\tisPaused\tboolean\tno\tSpending objects can be paused, when they are paused they will not be funded or updated automatically.\tdateCreated\tdatetime\tyes\tThe timestamp of when this spending object was created.\tdateStarted\tdatetime\tyes\tThe timestamp of the first instance of the recurrence or the goal date. This is used to recalculate subsequent recurrences of an expense accurately.","create-spending#Create Spending":"To create a spending object (a goal or an expense at the moment) you can perform a POST request to the following\nendpoint.","request-path-1#Request Path":"Attribute\tType\tRequired\tDescription\tbankAccountId\tnumber\tyes\tThe ID of the bank account the spending object should belong to once it is created.","request-body#Request Body":"Attribute\tType\tRequired\tDescription\tfundingScheduleId\tnumber\tyes\tThe ID of the funding schedule that is used to calculate contributions to the spending object.\tname\tstring\tyes\tThe name or title of the spending object, this must be unique within a bank account and spendingType.\tdescription\tstring\tno\tThe description for the spending object.\tspendingType\tenum\tyes\tThe type of spending object this is.  - 0 Expense  - 1 Goal\ttargetAmount\tnumber\tyes\tThe amount of money (in cents) that this spending object needs at or before it's nextRecurrence date.\trecurrenceRule\tstring\tno\tThe RRule used to calculate the due dates for a spending object, this is only present for Expenses.\tnextRecurrence\tdatetime\tyes\tThe timestamp of the next time this spending object is due, for a Goal this is just the day you want to complete the Goal. For an expense this is the next time it will recur before it is recalculated.","response-body-1#Response Body":"Attribute\tType\tRequired\tDescription\tspendingId\tnumber\tyes\tThe unique identifier for a spending object within monetr.\tbankAccountId\tnumber\tyes\tThe bank account that the spending object belongs to. This will match the path parameter for this API endpoint.\tfundingScheduleId\tnumber\tyes\tThe ID of the funding schedule that is used to calculate contributions to the spending object.\tname\tstring\tyes\tThe name or title of the spending object, this must be unique within a bank account and spendingType.\tdescription\tstring\tno\tThe description for the spending object.\tspendingType\tenum\tyes\tThe type of spending object this is.  - 0 Expense  - 1 Goal\ttargetAmount\tnumber\tyes\tThe amount of money (in cents) that this spending object needs at or before it's nextRecurrence date.\tcurrentAmount\tnumber\tyes\tThe amount of money (in cents) that is allocated to this spending object.\tusedAmount\tnumber\tno\tThis field is only used for Goals, it is used to keep track of how much has been spent from the goal. When a transaction is spent from a Goal it increments the usedAmount equal the the amount of the transaction or the currentAmount of the spending object, whichever is lesser.\trecurrenceRule\tstring\tno\tThe RRule used to calculate the due dates for a spending object, this is only present for Expenses.\tlastRecurrence\tdatetime\tno\tThe timestamp of the last time this spending object was due. This is not a reflection of the last time the spending object was used.\tnextRecurrence\tdatetime\tyes\tThe timestamp of the next time this spending object is due, for a Goal this is just the day you want to complete the Goal. For an expense this is the next time it will recur before it is recalculated.\tnextContributionAmount\tnumber\tyes\tThe amount of money (in cents) that will be allocated to the currentAmount the next time the funding schedule is processed.\tisBehind\tboolean\tyes\tSpending objects can fall behind if there will not be a funding event before the nextRecurrence and the currentAmount is less than the targetAmount.\tisPaused\tboolean\tno\tSpending objects can be paused, when they are paused they will not be funded or updated automatically.\tdateCreated\tdatetime\tyes\tThe timestamp of when this spending object was created.\tdateStarted\tdatetime\tyes\tThe timestamp of the first instance of the recurrence or the goal date. This is used to recalculate subsequent recurrences of an expense accurately."}},"/documentation/development/build":{"title":"Build","data":{"":"Building monetr locally using CMake.","general-requirements#General Requirements":"Node >= v18.0.0\nGo >= 1.20.0\nGit\nGNUMake\nmonetr will also create some binaries within the CMake binary directory, these binaries may be created by gem, npm\nor go install. These will not be installed on the host system itself, and are automatically removed when the source\ndirectory is cleaned.","linux#Linux":"If you want to do a release build of monetr on linux, you will also need the following packages:\nruby-full\nlibssl-dev\npkg-config\nThese are required in order for monetr to setup licensed. This tool is setup in\nthe CMake binary directory and is not installed on the host, but is installed via gem. The tool is used to generate\nmonetr's third party notice file that is embedded in it at build time. This file contains a list of all of the licenses\nof all of monetr's Go and JS dependencies.","building-monetr#Building monetr":"To build monetr you can simply run the following make command. This will run the CMake configuration and build steps\nnecessary to produce a binary at $PWD/build/monetr ($PWD/build/monetr.exe on Windows).","release-build#Release Build":"In order to produce a release build of monetr the following flag must be added.\nIn CI/CD, all builds are performed in release mode."}},"/documentation/development/api/user":{"title":"User","data":{"":"User resources for monetr's REST API.","get-me-current-user#Get Me (Current User)":"Retrieve information about the currently authenticated user. In the UI this API endpoint is also used to determine if\nthere is a currently authenticated user. Because authentication is stored in HTTP only cookies there is no way for the\nUI to see if the cookie is present, so upon bootstrapping it makes an API call to this endpoint to determine if there is\nan authenticated user."}},"/documentation/development/code_of_conduct":{"title":"Contributor Covenant Code of Conduct","data":{"our-pledge#Our Pledge":"We as members, contributors, and leaders pledge to make participation in our community a harassment-free experience for\neveryone, regardless of age, body size, visible or invisible disability, ethnicity, sex characteristics, gender identity\nand expression, level of experience, education, socio-economic status, nationality, personal appearance, race, religion,\nor sexual identity and orientation.We pledge to act and interact in ways that contribute to an open, welcoming, diverse, inclusive, and healthy community.","our-standards#Our Standards":"Examples of behavior that contributes to a positive environment for our community include:\nDemonstrating empathy and kindness toward other people\nBeing respectful of differing opinions, viewpoints, and experiences\nGiving and gracefully accepting constructive feedback\nAccepting responsibility and apologizing to those affected by our mistakes, and learning from the experience\nFocusing on what is best not just for us as individuals, but for the overall community\nExamples of unacceptable behavior include:\nThe use of sexualized language or imagery, and sexual attention or advances of any kind\nTrolling, insulting or derogatory comments, and personal or political attacks\nPublic or private harassment\nPublishing others' private information, such as a physical or email address, without their explicit permission\nOther conduct which could reasonably be considered inappropriate in a professional setting","enforcement-responsibilities#Enforcement Responsibilities":"Community leaders are responsible for clarifying and enforcing our standards of acceptable behavior and will take\nappropriate and fair corrective action in response to any behavior that they deem inappropriate, threatening, offensive,\nor harmful.Community leaders have the right and responsibility to remove, edit, or reject comments, commits, code, wiki edits,\nissues, and other contributions that are not aligned to this Code of Conduct, and will communicate reasons for\nmoderation decisions when appropriate.","scope#Scope":"This Code of Conduct applies within all community spaces, and also applies when an individual is officially representing\nthe community in public spaces. Examples of representing our community include using an official e-mail address, posting\nvia an official social media account, or acting as an appointed representative at an online or offline event.","enforcement#Enforcement":"Instances of abusive, harassing, or otherwise unacceptable behavior may be reported to the community leaders responsible\nfor enforcement at conduct@monetr.app. All complaints will be reviewed and investigated promptly and fairly.All community leaders are obligated to respect the privacy and security of the reporter of any incident.","enforcement-guidelines#Enforcement Guidelines":"Community leaders will follow these Community Impact Guidelines in determining the consequences for any action they deem\nin violation of this Code of Conduct:","1-correction#1. Correction":"Community Impact: Use of inappropriate language or other behavior deemed unprofessional or unwelcome in the\ncommunity.Consequence: A private, written warning from community leaders, providing clarity around the nature of the violation\nand an explanation of why the behavior was inappropriate. A public apology may be requested.","2-warning#2. Warning":"Community Impact: A violation through a single incident or series of actions.Consequence: A warning with consequences for continued behavior. No interaction with the people involved, including\nunsolicited interaction with those enforcing the Code of Conduct, for a specified period of time. This includes avoiding\ninteractions in community spaces as well as external channels like social media. Violating these terms may lead to a\ntemporary or permanent ban.","3-temporary-ban#3. Temporary Ban":"Community Impact: A serious violation of community standards, including sustained inappropriate behavior.Consequence: A temporary ban from any sort of interaction or public communication with the community for a specified\nperiod of time. No public or private interaction with the people involved, including unsolicited interaction with those\nenforcing the Code of Conduct, is allowed during this period. Violating these terms may lead to a permanent ban.","4-permanent-ban#4. Permanent Ban":"Community Impact: Demonstrating a pattern of violation of community standards, including sustained inappropriate\nbehavior, harassment of an individual, or aggression toward or disparagement of classes of individuals.Consequence: A permanent ban from any sort of public interaction within the community.","attribution#Attribution":"This Code of Conduct is adapted from the Contributor Covenant, version 2.0, available at\nhttps://www.contributor-covenant.org/version/2/0/code_of_conduct.html.Community Impact Guidelines were inspired\nby Mozilla's code of conduct enforcement ladder.For answers to common questions about this code of conduct, see the FAQ at\nhttps://www.contributor-covenant.org/faq. Translations are available at\nhttps://www.contributor-covenant.org/translations."}},"/documentation/development/credentials":{"title":"3rd Party API credentials for development","data":{"":"To work on all of the features monetr provides locally, you will need access to several sets of API credentials. These\ncredentials are outlines here in order of significance. monetr or people representing monetr will not provide any of\nthese credentials to you. You are responsible for gaining access to these credentials on your own. None of the\ncredentials require that you pay for them for development purposes.","plaid#Plaid":"Plaid credentials are required for local development at this time. Until manual accounts are fully supported, only\nlive bank accounts can be used for budgeting within monetr. It is recommended to use Sandbox credentials from Plaid for\nlocal development. The \"development\" credentials (as Plaid designates them) are for live bank accounts, however they can\nonly be used a limited number of times.\nStart by creating a Plaid account at: Plaid Signup\nFill out the form to the best of your abilities. Please do not use monetr for the company name.\nOnce you have created your Plaid account, you can find your credentials\nhere: Plaid Keys\nFor monetr you will need your client_id as well as your sandbox secret.","oauth#OAuth":"TODO","ngrok#ngrok":"ngrok is used to test code for webhooks. It allows requests to be made to your local development instance from an\nexternal endpoint. You can use ngrok without an API key; however, the tunnels will only last a short amount of time, and\nthe external endpoint will change each time. This might cause difficulty if you plan on working on webhook related\nfeatures. It is recommended to sign up for the free plan of ngrok and use the API key they provide you.You can sign up for ngrok here: ngrok Sign Up","stripe#Stripe":"If you want to work on billing related features, you can also provide Stripe credentials to the local development\nenvironment. It is required to provide ngrok credentials along-side Stripe for local development. You can sign up for a\nStripe account here: Stripe Sign UpYou will need two sets of keys to work with Stripe.\nA test mode Stripe secret key. (Not the public key)\nA webhook secret, configured for your ngrok endpoint and with the proper scopes selected.\nOnce you have made a Stripe account you can follow this guide to retrieve your keys.","secret-key#Secret key":"Navigate to your Stripe API Keys page within the dashboard. Make sure you\nare in\n\"Test mode\".You will need to click Reveal test key in order to retrieve the API key.","webhook-secret#Webhook secret":"On the Stripe Webhooks page click + Add endpoint.Enter your ngrok base URL here with the suffix: /api/stripe/webhookThen you can add events that you need to work with. At a minimum the following events should be added as monetr requires\nthem.\nOnce the webhook endpoint has been created click Reveal under Signing Secret to retrieve the secret for the webhook\nendpoint.","recaptcha#ReCAPTCHA":"TODO","sentry#Sentry":"TODO","smtp#SMTP":"TODO","google-cloud-kms#Google Cloud KMS":"Google Cloud KMS support is currently being added to improve the security of storing encrypted secrets in monetr.\nDocumentation to follow.TODO"}},"/documentation/development/documentation":{"title":"Documentation","data":{"":"This is an overview of ways to contribute to monetr's documentation. To get started:\nYou can find outstanding issues for documentation\nhere: \nIf you don't find an issue that you'd be interested in working on, you can still create a pull request with your\ndesired changes.\nIf you have found a gap in our documentation that you aren't able to, or do not wish to fill yourself; please create\nan issue so that others are aware of this gap, and it can be addressed.","editing-documentation#Editing documentation":"All of our documentation is in the form of Markdown files in the docs directory of the monetr repository. You can\nsimply edit the existing files to make changes to the documentation. The documentation site is automatically generated\nin our GitHub Actions workflows.","building-locally#Building Locally":"You can build our documentation site locally using the following command, it requires Node.js and will create a static\nsite in the $PWD/docs/out directory.","editing-locally#Editing Locally":"If you want to work on the documentation in real time locally you can run the following command:\nThis will start a Next.js server locally serving docs. As you edit files in the docs/ directory you will be able to\nsee those changes automatically refresh in your browser.","style#Style":"We would like our documentation to follow a general guide, this creates some consistency in how our documentation is\nboth written, presented, and maintained over time.","language#Language":"All documentation should be written in \"American\" English as much as possible. The exception to that rule are\nquotations, trademarks or terms that are better known by their own language's equivalent.","reader--author#Reader / Author":"The documentation prefers \"we\" to address the author and \"you\" to address the reader. The gender of the reader shall be\nneutral if possible. Attempt to use \"they\" as a pronoun for the reader.","code-blocks#Code Blocks":"Code blocks should always be accompanied by a preceding text to give context as to what that code block is, or\nrepresents. Adjacent code blocks without a paragraph of text between them should be avoided.","screenshots#Screenshots":"Screenshots, if at all possible, should be no larger than 1280x720. This is not a strict requirement, but if a\nscreenshot can reasonably capture all the necessary details in that resolution or less; that is greatly preferred.","issue-tracking#Issue Tracking":"If documentation is missing and is planned to be added later. Please add a placeholder badge for that documentation\nusing shields.io, with the GitHub issue/pull request detail shield.The \"override label\" should use the following format.\nPlease make the badge link back to the original issue as well.","inclusivity#Inclusivity":"Language that has been identified as hurtful or insensitive should be avoided."}},"/documentation/development/local_development":{"title":"Local Development","data":{"":"This guide walks you through setting up a local development environment for monetr on macOS or Linux. If you are using\nWindows, it is still possible to run the development environment locally. However, it is not documented at this time.","prerequisites#Prerequisites":"At the time of writing this, monetr requires Plaid credentials for development. Among other credentials, documentation\non how to retrieve them can be found here: Developing > Credentials","clone-the-repository#Clone the repository":"To get started, clone the monetr repository from GitHub or from your fork.\nThe rest of the commands in this guide are issued from this directory.","dependencies#Dependencies":"monetr does require a few tools to be installed locally in order to develop or build it. These tools are outlines below:","required#Required":"Node (>= 18.0.0)\nnpm (>= 8.0.0)\ngit (>= 2.0.0)\nGo (>= 1.21.9)\nCMake (>= 3.23.0)\nGNUMake (>= 4.0)\nThe tools above are the minimum tools required in order to build and work on monetr locally. But if you intend to run\nthe complete development environment locally or if you plan on creating release builds of monetr you will also need:","optional#Optional":"Docker (>= 20.0.0): Docker (and Docker Compose) are used to run the local development environment for monetr,\nallowing you to have the entire application and all of it's features with hot-reloading.\nRuby (>= 2.7): Ruby is required to run licensed which is used to generate third-party-notice files, these show all\nof the dependencies of monetr and their licenses. This is embeded at build time for releases.\nKubectl (>= 1.23.0): Kubectl is used to deploy monetr to a Kubernetes cluster. At the moment this is only used in\nCI/CD pipelines for deployying monetr to the Staging and Production clusters.","mac-specific#Mac Specific":"macOS can ship with a version of make that is outdated. It is recommended that you use brew or any other preferred\nmethod to install the most recent version of GNUMake on your Mac. This will not break anything that is already using\nmake, but will make sure that your version is compatible with the monetr Makefiles.For example; you should see something like this for your make version.","configuration--credentials#Configuration & Credentials":"At the moment monetr requires at least Plaid credentials in order to run properly, even for development. You can read\nmore about obtaining these credentials here: CredentialsThe makefile will look for these development credentials and some configuration options in the following path:\nYou can create the file manually like this:\nOnce you've opened this file you'll need to provide the Plaid Client ID as PLAID_CLIENT_ID and Plaid Client Secret as\nPLAID_CLIENT_SECRET here.","cmake#CMake":"monetr uses CMake as the primary build system, it is also used for running the tasks for local development. If you want\nto use a custom CMake configuration you can create a CMakeUserPresets.json file in the project directory (it will be\nignored by Git) and populate it with the configuration variables you want to override. If you want to always use a\nspecific preset when running general make targets you can create a .cmakepreset file in the project directory. Inside\nthat file you can put the name of the preset you want to use by default. Or you can pass CMAKE_PRESET=... when running\na make target.\nCMAKE_PRESET is ignored for some make targets, such as release, test and deploy. As each of those targets have\na specific preset that they are expected to use.","starting-it-up#Starting It Up":"With the above requirements installed. You should be able to spin up the local development environment that runs inside\nof Docker compose.This command will also load any of the environment variables specified in the development env file (mentioned above)\ninto the monetr container where the API is running.\nThis will install node modules in the project's directory, as well as start up the containers needed for monetr to run\nlocally. This command will exit automatically once all the containers are healthy. If you want to follow along while it\nis starting up you can use the make logs command in another terminal inside the project directory.","working#Working":"Congratulations, you should now have monetr running locally on your computer. The develop task will print out some\nbasic information for you. But if you missed it, you can access the development version of monetr at http://monetr.local.If you are working on documentation then that can be accessed at http://monetr.local/documentation.Almost all of monetr's code is setup to hot-reload as you make changes. The documentation, Go code and React UI will all\nautomatically reload as changes are made. Changes to the Go code will not invoke a browser refresh of any sort though,\nso to observe a new behavior in the API you will need to refresh or make the API call again.\nIf you want to disable hot reloading of the Go code, you can include DISABLE_GO_RELOAD=true in your env variables\nwhen you run make develop.","local-services#Local Services":"As part of the local development stack, several services are run to support monetr. These services include:\nminio As an S3 storage backend. The console is accessible via\nhttp://localhost:9001 when the local environment is running.\nlocal-kms An AWS KMS compatible local development API. This is used for\nencrypting secrets in the local development environment.\nMailpit An SMTP server that allows emails to be sent without really sending\nthem. This is used to validate and test communication functionality locally. This service is accessible via\nhttps://monetr.local/mail when the local environment is running.","debugging#Debugging":"The monetr container running the API has delve included. If you prefer to work\nusing a step-debugger you can connect your editor to it. You will need to reconnect your editor each time it reloads,\nbut it is very easy to make your changes and then hit debug and let your breakpoints be hit.Delve is available via port 2345 on localhost. I'm not sure what the configuration will be for every editor to\nconnect to it; but this is a screenshot of IntellJ IDEA's configuration for remote debugging.","running-tests#Running Tests":"monetr requires a PostgreSQL instance to be available for Go tests to be run. At the moment there isn't a shorthand\nscript to provision this instance. But an easy way to do so is this:\nThis will start a PostgreSQL instance in Docker (or remove an existing one) and make it available on locahost:5432 as\nwell as not require authentication. This makes it easy for tests to target it.If tests are run via make then nothing more needs to be done. However, if you want to run tests directly from your\neditor or other tools you will need to run the database migrations.\nWill run all schema migrations on the PostgreSQL database on your localhost container.Tests can be run using the go test CLI, or all tests can be run using:","running-storybook#Running Storybook":"monetr now provides a storybook setup for working on UI components outside of running the entire application locally. To\nstart storybook you can run the following command.\nThis will kick off the storybook server and build process. Once it is ready it will open the storybook in your default\nbrowser. You can then make changes to the components in the stories and see the changes in real time without needing to\nrun the entire application stack locally.NOTE At the moment storybook does not work with the CMake development tooling.","cleaning-up#Cleaning Up":"Once you have finished your work and you want to take the local development environment down you have a few options.","shutting-down-development-environment#Shutting Down Development Environment":"If you want to completely shut everything down then you can run the following command:\nThis will delete all of your local development data, including any Plaid links, expenses, goals, etc...\nThis removes the Plaid links that are active, takes down the Docker compose containers, removes their volumes.","completely-clean-up#Completely Clean up":"If you want to completely start fresh you can run the following make task. This will shut down the local development\nenvironment if it is running, but it will also delete any files created or generated during development. This deletes\nyour node_modules folder, any submodules, and generated UI code.\nThis should leave the project directory in a state similar to when it was initially cloned."}},"/documentation/getting_started":{"title":"Getting Started","data":{"":"monetr's documentation"}},"/documentation":{"title":"monetr","data":{"":"monetr is a budgeting application to help you plan around recurring transactions."}},"/documentation/use":{"title":"Using monetr","data":{}},"/documentation/use/security/user_password":{"title":"User Password","data":{"":"monetr requires users authenticate using an email and a password. A password that is weak or easy to guess makes it\neasier for unauthorized people to sign in to your account.","change-your-password#Change your password":"You can change your password one of two ways. If you have access to your login you can click the Gear icon in the\nsidebar and then navigate to the Security tab within your settings. Or you can access the page here: Security\nSettings.There will be a few cards on this page, clicking Change Password button on the first card will open a dialog\nallowing you to update your password.Once you have updated your password monetr will send a confirmation email to your login's email address. You do not need\nto reply or do anything with this email, it is intended to notify users of unauthorized activity in the event that their\naccount may have been compromised.","forgot-password#Forgot password":"If you do not have access to your login, or have forgotten your password; you can still reset your password as long as\nyou have access to the email address that is associated with your login.Navigate to the Forgot Password page. Here you can provide the email address\nassociated with your login.Once you submit the form we will send you an email with a link that can be used to reset your password. Click the link\nin the email to proceed. If you do not receive the email make sure to check your spam or junk folder, otherwise please\nreach out to support for help.Once you open the link in the email, you will be prompted to provide a new password as well as to repeat it to help\nprevent any typos. Once submitted you will receive a confirmation email that your password was changed, and you should\nnow be able to login to your account with your new credentials.\nOn self-hosted instances of monetr, resetting your password via forgot password requires that the server has SMTP\nconfigured and forgot password enabled. There is an issue to track the feature of allowing passwords to be reset via\nthe monetr CLI for self hosted instances:"}},"/":{"title":"monetr","data":{}},"/policy/privacy":{"title":"Privacy Policy","data":{"":"Protecting your private information is our priority. This Statement of Privacy applies to monetr, and\nmonetr LLC and governs data collection and usage. For the purposes of this Privacy Policy, unless\notherwise noted, all references to monetr LLC include https://monetr.app and monetr. The monetr\napplication is a budgeting and expense planning application. By using the monetr application, you\nconsent to the data practices described in this statement.","collection-of-your-personal-information#Collection of your Personal Information":"In order to better provide you with products and services offered, monetr may collect personally\nidentifiable information, such as your:\nFirst and Last Name\nE-mail Address\nIf you purchase monetr's products and services, we collect billing and credit card information. This\ninformation is used to complete the purchase transaction.We do not collect any personal information about you unless you voluntarily provide it to us.\nHowever, you may be required to provide certain personal information to us when you elect to use\ncertain products or services. These may include: (a) registering for an account; (b) signing up for\nspecial offers from selected third parties; (c) sending us an email message; (d) submitting your\ncredit card or other payment information when ordering and purchasing products and services. To wit,\nwe will use your information for, but not limited to, communicating with you in relation to services\nand/or products you have requested from us. We also may gather additional personal or non-personal\ninformation in the future.","use-of-your-personal-information#Use of your Personal Information":"monetr collects and uses your personal information to operate and deliver the services you have\nrequested.monetr may also use your personally identifiable information to inform you of other products or\nservices available from monetr and its affiliates.","sharing-information-with-third-parties#Sharing Information with Third Parties":"monetr does not sell, rent or lease its customer lists to third parties.monetr may share data with trusted partners to help perform statistical analysis, send you email, or\nprovide customer support. All such third parties are prohibited from using your personal information\nexcept to provide these services to monetr, and they are required to maintain the confidentiality of\nyour information.monetr may disclose your personal information, without notice, if required to do so by law or in the\ngood faith belief that such action is necessary to: (a) conform to the edicts of the law or comply\nwith legal process served on monetr or the site; (b) protect and defend the rights or property of\nmonetr; and/or (c) act under exigent circumstances to protect the personal safety of users of\nmonetr, or the public.","right-to-deletion#Right to Deletion":"Subject to certain exceptions set out below, on receipt of a verifiable request from you, we will:\nDelete your personal information from our records; and\nDirect any service providers to delete your personal information from their records.\nPlease note that we may not be able to comply with requests to delete your personal information if\nit is necessary to:\nComplete the transaction for which the personal information was collected, fulfill the\nterms of a written warranty or product recall conducted in accordance with federal\nlaw, provide a good or service requested by you, or reasonably anticipated within the\ncontext of our ongoing business relationship with you, or otherwise perform a contract\nbetween you and us;\nDetect security incidents, protect against malicious, deceptive, fraudulent, or illegal\nactivity; or prosecute those responsible for that activity;\nDebug to identify and repair errors that impair existing intended functionality;\nExercise free speech, ensure the right of another consumer to exercise his or her right\nof free speech, or exercise another right provided for by law;\nComply with the California Electronic Communications Privacy Act;\nEngage in public or peer-reviewed scientific, historical, or statistical research in the\npublic interest that adheres to all other applicable ethics and privacy laws, when our\ndeletion of the information is likely to render impossible or seriously impair the\nachievement of such research, provided we have obtained your informed consent;\nEnable solely internal uses that are reasonably aligned with your expectations based on\nyour relationship with us;\nComply with an existing legal obligation; or\nOtherwise use your personal information, internally, in a lawful manner that is\ncompatible with the context in which you provided the information.","children-under-thirteen#Children Under Thirteen":"monetr does not knowingly collect personally identifiable information from children under the age\nof thirteen. If you are under the age of thirteen, you must ask your parent or guardian for\npermission to use this application.","disconnecting-your-monetr-account-from-third-party-websites#Disconnecting your monetr Account from Third Party Websites":"You will be able to connect your monetr account to third party accounts. BY CONNECTING\nYOUR MONETR ACCOUNT TO YOUR THIRD PARTY ACCOUNT, YOU\nACKNOWLEDGE AND AGREE THAT YOU ARE CONSENTING TO THE\nCONTINUOUS RELEASE OF INFORMATION ABOUT YOU TO OTHERS (IN\nACCORDANCE WITH YOUR PRIVACY SETTINGS ON THOSE THIRD PARTY SITES).IF YOU DO NOT WANT INFORMATION ABOUT YOU, INCLUDING PERSONALLY\nIDENTIFYING INFORMATION, TO BE SHARED IN THIS MANNER, DO NOT USETHIS FEATURE. You may disconnect your account from a third party account at any time.\nUser's connect monetr to their bank account's via a third party service called Plaid. You can\ndisconnect your bank account from monetr in the \"View Bank Accounts\" menu. Alternatively, you\ncan revoke monetr's access to your bank account information by going to https://my.plaid.com/","e-mail-communications#E-mail Communications":"From time to time, monetr may contact you via email for the purpose of providing announcements,\npromotional offers, alerts, confirmations, surveys, and/or other general communication.If you would like to stop receiving marketing or promotional communications via email from\nmonetr, you may opt out of such communications by clicking the \"unsubscribe\" button in the footer\nor body of the emails. Or by reaching out to support@monetr.app.","external-data-storage-sites#External Data Storage Sites":"We may store your data on servers provided by third party hosting vendors with whom we have\ncontracted.","changes-to-this-statement#Changes to this Statement":"monetr reserves the right to change this Privacy Policy from time to time. We will notify you about\nsignificant changes in the way we treat personal information by sending a notice to the primary\nemail address specified in your account, by placing a prominent notice on our application, and/or\nby updating any privacy information. Your continued use of the application and/or Services\navailable after such modifications will constitute your: (a) acknowledgment of the modified Privacy\nPolicy; and (b) agreement to abide and be bound by that Policy.","contact-information#Contact Information":"monetr welcomes your questions or comments regarding this Statement of Privacy. If you believe\nthat monetr has not adhered to this Statement, please contact monetr at:Email Address:\nsupport@monetr.appTelephone number:\n651 - 243 - 0035Effective as of September 12, 2022"}},"/policy/terms":{"title":"Terms and Conditions","data":{"agreement-between-user-and-monetrapp#Agreement between User and monetr.app":"Welcome to monetr.app. The monetr.app website (the \"Site\") is comprised of various web pages operated by monetr LLC\n(\"monetr\"). monetr.app is offered to you conditioned on your acceptance without modification of the terms, conditions,\nand notices contained herein (the \"Terms\"). Your use of monetr.app constitutes your agreement to all such Terms. Please\nread these terms carefully, and keep a copy of them for your reference.monetr.app is a Financial Planning Software Site.monetr is an open source financial planning application. monetr.app is a hosted version of this application used to help\nmanage and budget for recurring or future expenses.","privacy#Privacy":"Your use of monetr.app is subject to monetr's Privacy Policy. Please review our Privacy Policy, which also governs the\nSite and informs users of our data collection practices.","electronic-communications#Electronic Communications":"Visiting monetr.app or sending emails to monetr constitutes electronic communications. You consent to receive electronic\ncommunications and you agree that all agreements, notices, disclosures and other communications that we provide to you\nelectronically, via email and on the Site, satisfy any legal requirement that such communications be in writing.","your-account#Your Account":"If you use this site, you are responsible for maintaining the confidentiality of your account and password and for\nrestricting access to your computer, and you agree to accept responsibility for all activities that occur under your\naccount or password. You may not assign or otherwise transfer your account to any other person or entity. You\nacknowledge that monetr is not responsible for third party access to your account that results from theft or\nmisappropriation of your account. monetr and its associates reserve the right to refuse or cancel service, terminate\naccounts, or remove or edit content in our sole discretion.","children-under-thirteen#Children Under Thirteen":"monetr does not knowingly collect, either online or offline, personal information from persons under the age of\nthirteen. If you are under 18, you may use monetr.app only with permission of a parent or guardian.","cancellationrefund-policy#Cancellation/Refund Policy":"You may cancel your subscription at any time. Your subscription will remain active until the end of the current billing\nperiod that you had purchased, or until the end of your trial when applicable. If you wish to request a refund you can\ncontact us at support@monetr.com","links-to-third-party-sitesthird-party-services#Links to Third Party Sites/Third Party Services":"monetr.app may contain links to other websites (\"Linked Sites\"). The Linked Sites are not under the control of monetr\nand monetr is not responsible for the contents of any Linked Site, including without limitation any link contained in a\nLinked Site, or any changes or updates to a Linked Site. monetr is providing these links to you only as a convenience,\nand the inclusion of any link does not imply endorsement by monetr of the site or any association with its operators.Certain services made available via monetr.app are delivered by third party sites and organizations. By using any\nproduct, service or functionality originating from the monetr.app domain, you hereby acknowledge and consent that monetr\nmay share such information and data with any third party with whom monetr has a contractual relationship to provide the\nrequested product, service or functionality on behalf of monetr.app users and customers.","no-unlawful-or-prohibited-useintellectual-property#No Unlawful or Prohibited Use/Intellectual Property":"You are granted a non-exclusive, non-transferable, revocable license to access and use monetr.app strictly in accordance\nwith these terms of use. As a condition of your use of the Site, you warrant to monetr that you will not use the Site\nfor any purpose that is unlawful or prohibited by these Terms. You may not use the Site in any manner which could\ndamage, disable, overburden, or impair the Site or interfere with any other party's use and enjoyment of the Site. You\nmay not obtain or attempt to obtain any materials or information through any means not intentionally made available or\nprovided for through the Site.All content included as part of the Service, such as text, graphics, logos, images, as well as the compilation thereof,\nand any software used on the Site, is the property of monetr or its suppliers and protected by copyright and other laws\nthat protect intellectual property and proprietary rights. You agree to observe and abide by all copyright and other\nproprietary notices, legends or other restrictions contained in any such content and will not make any changes thereto.You will not modify, publish, transmit, reverse engineer, participate in the transfer or sale, create derivative works,\nor in any way exploit any of the content, in whole or in part, found on the Site. monetr content is not for resale. Your\nuse of the Site does not entitle you to make any unauthorized use of any protected content, and in particular you will\nnot delete or alter any proprietary rights or attribution notices in any content. You will use protected content solely\nfor your personal use, and will make no other use of the content without the express written permission of monetr and\nthe copyright owner. You agree that you do not acquire any ownership rights in any protected content. We do not grant\nyou any licenses, express or implied, to the intellectual property of monetr or our licensors except as expressly\nauthorized by these Terms.","third-party-accounts#Third Party Accounts":"You will be able to connect your monetr account to third party accounts. By connecting your monetr account to your third\nparty account, you acknowledge and agree that you are consenting to the continuous release of information about you to\nothers (in accordance with your privacy settings on those third party sites). If you do not want information about you\nto be shared in this manner, do not use this feature.","international-users#International Users":"The Service is controlled, operated and administered by monetr from within the USA. If you access the Service from a\nlocation outside the USA, you are responsible for compliance with all local laws. You agree that you will not use the\nmonetr Content accessed through monetr.app in any country or in any manner prohibited by any applicable laws,\nrestrictions or regulations.","indemnification#Indemnification":"You agree to indemnify, defend and hold harmless monetr, its officers, directors, employees, agents and third parties,\nfor any losses, costs, liabilities and expenses (including reasonable attorney's fees) relating to or arising out of\nyour use of or inability to use the Site or services, any user postings made by you, your violation of any terms of this\nAgreement or your violation of any rights of a third party, or your violation of any applicable laws, rules or\nregulations. monetr reserves the right, at its own cost, to assume the exclusive defense and control of any matter\notherwise subject to indemnification by you, in which event you will fully cooperate with monetr in asserting any\navailable defenses.","arbitration#Arbitration":"In the event the parties are not able to resolve any dispute between them arising out of or concerning these Terms and\nConditions, or any provisions hereof, whether in contract, tort, or otherwise at law or in equity for damages or any\nother relief, then such dispute shall be resolved only by final and binding arbitration pursuant to the Federal\nArbitration Act, conducted by a single neutral arbitrator and administered by the American Arbitration Association, or a\nsimilar arbitration service selected by the parties, in a location mutually agreed upon by the parties. The arbitrator's\naward shall be final, and judgment may be entered upon it in any court having jurisdiction. In the event that any legal\nor equitable action, proceeding or arbitration arises out of or concerns these Terms and Conditions, the prevailing\nparty shall be entitled to recover its costs and reasonable attorney's fees. The parties agree to arbitrate all disputes\nand claims in regards to these Terms and Conditions or any disputes arising as a result of these Terms and Conditions,\nwhether directly or indirectly, including Tort claims that are a result of these Terms and Conditions. The parties agree\nthat the Federal Arbitration Act governs the interpretation and enforcement of this provision. The entire dispute,\nincluding the scope and enforceability of this arbitration provision shall be determined by the Arbitrator. This\narbitration provision shall survive the termination of these Terms and Conditions.","class-action-waiver#Class Action Waiver":"Any arbitration under these Terms and Conditions will take place on an individual basis; class arbitrations and\nclass/representative/collective actions are not permitted. THE PARTIES AGREE THAT A PARTY MAY BRING CLAIMS AGAINST THE\nOTHER ONLY IN EACH'S INDIVIDUAL CAPACITY, AND NOT AS A PLAINTIFF OR CLASS MEMBER IN ANY PUTATIVE CLASS, COLLECTIVE AND/\nOR REPRESENTATIVE PROCEEDING, SUCH AS IN THE FORM OF A PRIVATE ATTORNEY GENERAL ACTION AGAINST THE OTHER. Further,\nunless both you and monetr agree otherwise, the arbitrator may not consolidate more than one person's claims, and may\nnot otherwise preside over any form of a representative or class proceeding.","liability-disclaimer#Liability Disclaimer":"THE INFORMATION, SOFTWARE, PRODUCTS, AND SERVICES INCLUDED IN OR AVAILABLE THROUGH THE SITE MAY INCLUDE INACCURACIES\nOR TYPOGRAPHICAL ERRORS. CHANGES ARE PERIODICALLY ADDED TO THE INFORMATION HEREIN. MONETR LLC AND/OR ITS SUPPLIERS MAY\nMAKE IMPROVEMENTS AND/OR CHANGES IN THE SITE AT ANY TIME.MONETR LLC AND/OR ITS SUPPLIERS MAKE NO REPRESENTATIONS ABOUT THE SUITABILITY, RELIABILITY, AVAILABILITY, TIMELINESS,\nAND ACCURACY OF THE INFORMATION, SOFTWARE, PRODUCTS, SERVICES AND RELATED GRAPHICS CONTAINED ON THE SITE FOR ANY\nPURPOSE. TO THE MAXIMUM EXTENT PERMITTED BY APPLICABLE LAW, ALL SUCH INFORMATION, SOFTWARE, PRODUCTS, SERVICES AND\nRELATED GRAPHICS ARE PROVIDED \"AS IS\" WITHOUT WARRANTY OR CONDITION OF ANY KIND. MONETR LLC AND/OR ITS SUPPLIERS HEREBY\nDISCLAIM ALL WARRANTIES AND CONDITIONS WITH REGARD TO THIS INFORMATION, SOFTWARE, PRODUCTS, SERVICES AND RELATED\nGRAPHICS, INCLUDING ALL IMPLIED WARRANTIES OR CONDITIONS OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, TITLE AND\nNON-INFRINGEMENT.TO THE MAXIMUM EXTENT PERMITTED BY APPLICABLE LAW, IN NO EVENT SHALL MONETR LLC AND/OR ITS SUPPLIERS BE LIABLE FOR ANY\nDIRECT, INDIRECT, PUNITIVE, INCIDENTAL, SPECIAL, CONSEQUENTIAL DAMAGES OR ANY DAMAGES WHATSOEVER INCLUDING, WITHOUT\nLIMITATION, DAMAGES FOR LOSS OF USE, DATA OR PROFITS, ARISING OUT OF OR IN ANY WAY CONNECTED WITH THE USE OR PERFORMANCE\nOF THE SITE, WITH THE DELAY OR INABILITY TO USE THE SITE OR RELATED SERVICES, THE PROVISION OF OR FAILURE TO PROVIDE\nSERVICES, OR FOR ANY INFORMATION, SOFTWARE, PRODUCTS, SERVICES AND RELATED GRAPHICS OBTAINED THROUGH THE SITE, OR\nOTHERWISE ARISING OUT OF THE USE OF THE SITE, WHETHER BASED ON CONTRACT, TORT, NEGLIGENCE, STRICT LIABILITY OR\nOTHERWISE, EVEN IF MONETR LLC OR ANY OF ITS SUPPLIERS HAS BEEN ADVISED OF THE POSSIBILITY OF DAMAGES. BECAUSE SOME\nSTATES/JURISDICTIONS DO NOT ALLOW THE EXCLUSION OR LIMITATION OF LIABILITY FOR CONSEQUENTIAL OR INCIDENTAL DAMAGES, THE\nABOVE LIMITATION MAY NOT APPLY TO YOU. IF YOU ARE DISSATISFIED WITH ANY PORTION OF THE SITE, OR WITH ANY OF THESE TERMS\nOF USE, YOUR SOLE AND EXCLUSIVE REMEDY IS TO DISCONTINUE USING THE SITE.","terminationaccess-restriction#Termination/Access Restriction":"monetr reserves the right, in its sole discretion, to terminate your access to the Site and the related services or any\nportion thereof at any time, without notice. To the maximum extent permitted by law, this agreement is governed by the\nlaws of the State of Minnesota and you hereby consent to the exclusive jurisdiction and venue of courts in Minnesota in\nall disputes arising out of or relating to the use of the Site. Use of the Site is unauthorized in any jurisdiction that\ndoes not give effect to all provisions of these Terms, including, without limitation, this section.You agree that no joint venture, partnership, employment, or agency relationship exists between you and monetr as a\nresult of this agreement or use of the Site. monetr's performance of this agreement is subject to existing laws and\nlegal process, and nothing contained in this agreement is in derogation of monetr's right to comply with governmental,\ncourt and law enforcement requests or requirements relating to your use of the Site or information provided to or\ngathered by monetr with respect to such use. If any part of this agreement is determined to be invalid or unenforceable\npursuant to applicable law including, but not limited to, the warranty disclaimers and liability limitations set forth\nabove, then the invalid or unenforceable provision will be deemed superseded by a valid, enforceable provision that most\nclosely matches the intent of the original provision and the remainder of the agreement shall continue in effect.Unless otherwise specified herein, this agreement constitutes the entire agreement between the user and monetr with\nrespect to the Site and it supersedes all prior or contemporaneous communications and proposals, whether electronic,\noral or written, between the user and monetr with respect to the Site. A printed version of this agreement and of any\nnotice given in electronic form shall be admissible in judicial or administrative proceedings based upon or relating to\nthis agreement to the same extent and subject to the same conditions as other business documents and records originally\ngenerated and maintained in printed form. It is the express wish to the parties that this agreement and all related\ndocuments be written in English.","changes-to-terms#Changes to Terms":"monetr reserves the right, in its sole discretion, to change the Terms under which monetr.app is offered. The most\ncurrent version of the Terms will supersede all previous versions. monetr encourages you to periodically review the\nTerms to stay informed of our updates.","contact-us#Contact Us":"monetr welcomes your questions or comments regarding the Terms:Email Address: support@monetr.app\nTelephone number: (651) 243-0035Effective as of September 12, 2022"}}}