{"/blog":{"title":"Blog","data":{}},"/blog/2024-12-30-introduction":{"title":"Introducing monetr","data":{"":"My name is Elliot, and for nearly four years, I've been working on monetr, a\nbudgeting app inspired by Simple. I'm excited to\nannounce that monetr will officially launch to the public on January 3rd, 2025. This blog post is my attempt to\nintroduce monetr, share why I built it, explain a bit of how it works, and outline my vision for its future. As a\nsoftware engineer and not a writer I hope you'll bear with me on my ramblings in this first blog post. I'm excited to\nshare monetr with you.I've never really been able to find a good budgeting app. Most budgeting apps I've tried focus on the past—showing you\nwhat you've spent historically, but not what you have right now. They also tend to roll things up into categories like\n\"automotive\" or \"groceries\". Not easily providing insights into the actual expenses therein.Take \"automotive\" for example. It's not just one expense. There's car insurance (monthly or every 6 months), a car\npayment (likely monthly), unpredictable costs like gas and repairs, or costs that don't fit on a monthly cadence such as\nmaintenance. Most budgeting apps lump all of these different expenses into a single category or, at best,\nsub-categories. But they're still not addressing the biggest issue: when these expenses happen. A budgeting app that\nwould ask you to summarize your \"automotive\" budget for an entire month is just leaving out all of the details of what\nis actually happening. How do you budget or plan for something that isn't monthly or isn't even planned?The better tools I've tried were still rigid about this, maybe they would let me budget more precisely for a specific\nexpense but would still confine that budget to be month to month. Not even providing an option for expenses that are\nmore complicated. But even then, they would still make it difficult to see what was left over today. If I needed to add\nsomething to my budget or make an unexpected purchase today, how much could I actually afford?monetr breaks the problem of budgeting into four different pieces.\nFunding Schedules\nExpenses & Goals\nSpent From\nFree-To-Use\nFunding Schedules are monetr's way of keeping track when you get paid, these can\nbe far more flexible if you want them to be. But for now let's just think of them as a way of keeping track of when\nyou're paid. Each time you get paid you want to contribute some amount to your budgeted expenses, but not the entire\namount of the expense. Like if your rent is $1200 a month, but your paycheck is $1500; you never want to take $1200 out\nof your paycheck for a single expense.This is where Expenses and Goals come in. Expenses and Goals\nare your way of telling monetr what you need, how much you need, and when you need it by. With the only difference being\nthat expenses will repeat on a regular basis (but not just monthly, they can repeat weekly, bi-weekly, monthly, yearly\nor more). Every time you get paid, monetr takes a portion of that single budget aside and allocates it towards that\nbudget. monetr automatically calculates how much it needs to put aside each time so that way you will always have enough\nto cover that expense when it is due. This even works if you have an expense that happens more frequently than you're\ngetting paid, monetr will allocate more than a single expense's amount to cover the multiple times you need that expense\nbetween paychecks.In order to keep track of the spending side of expenses though, you have to tell monetr when you actually use one of\nyour expenses or goals. For this, every debit transaction in monetr allows you to select what the transaction was\n\"spent from\". When you do this monetr will subtract from the selected budget's allocation, instead of from your\nfree-to-use. This way, planned spending does not affect your free-to-use at all.Your Free-To-Use is calculated automatically by monetr, and is how much you have left over after all of your budgets\nhave been accounted for. It is recalculated every time you get paid, and every time you use an expense or a goal. monetr\naims to keep this amount as consistent as possible between your paychecks so that you can easily plan around changing\nexpenses over time and know what the impact will be.If you're familiar with Envelope-Budgeting, monetr is very similar. Except contributions to the envelope's are\nautomated, and a \"left-over\" or \"free-to-use\" envelope is used for anything that isn't budgeted. When a transaction\ncomes through, you just need to tell monetr which \"envelope\" the transaction was for and it will keep track of the rest.\nMost importantly making sure that there will always be enough to cover the transaction when it happens.I have several goals for monetr that I've thought through a ton such that these should not change regardless of how\nsuccessful monetr does or does not become. These are the things I want monetr to be or do forever.","affordable#Affordable":"It is a budgeting app first and foremost, it should not be expensive. It should be affordable to anyone who might be\nstruggling to manage their finances. As such monetr is launching with a $4/month subscription after a 30-day free\ntrial.More than that, monetr will always be free to self-host, and self-hosting will not be treated as an afterthought. It\nis my goal to have self-hosted instances of monetr have feature parity with the hosted version of monetr. An example of\nthis is the Similar Transactions feature, which does not leverage the Plaid enrich API or any other third party\nsystem, it works entirely offline. Recurring transaction detection will also be available entirely offline and does not\nrely on any third party software or API. (This feature itself is code complete, however it is not yet exposed via the\nAPI).","transparent#Transparent":"monetr's source code is freely available to read, audit and modify. The changes I\nmake to monetr are free to be scrutinized by anyone and I'm happy to share as many details about the app and how it\nworks with anyone who is interested.I would also like to share monetr's financials publicly. This is something I'm still working on in terms of how best to\npresent them. Should they be a blog post each month? A GitHub repository that automatically pushes updates on a daily or\nweekly basis? I'm not sure; but I want to be transparent with how much I spend on monetr and what I spend it on. As well\nas what money monetr brings in (if any). But if you're looking for some insights now, all of the screenshots of monetr\nin this blog post are for monetr's actual operating budget as of writing this.","ad-free#Ad Free":"monetr will never have ads. I personally don't even want to purchase ad space to promote monetr. With the exception of\npurchasing directly from an individual or website who respects their end users.","respect-privacy#Respect Privacy":"Your information is your own, monetr will never sell your data to anyone. I've worked hard on making a clear and concise\nprivacy policy that outlines what monetr does with the data it has. But the code is also fully\navailable if you want to see for yourself what monetr is doing. But once again monetr is also free to self-host, if you\nwant to truly keep your data to yourself, you are always welcome to run monetr on your own system.If you've gotten this far I cannot thank you enough. If you are interested in monetr please:\nSign up starting January 3rd, 2025. It is free for the first 30 days and no payment\nmethod is required to try it out.\nOr install monetr on your own system.\nStar monetr on GitHub.\nShare your feedback via GitHub Discussions or via\nDiscord.\nShare monetr with anyone who you think might find the application useful.\nMy wife Leyna, who has been patient and encouraging these past 4 years of late nights and weekends working on\nsomething I love.\nClark Tomlinson & Matt Petersen for being a sounding\nboard for my ideas over the past 4 years.\nSean Sube, without whom I would have never learned the things I needed to manage monetr's\nhosting and infrastructure myself.\nThe entire team who built Simple, you have no\nidea how much it changed my life."}},"/contact":{"title":"Contact monetr","data":{"":"Below are the preferred ways for contacting monetr staff.GitHub: github.com/monetr/monetrEmail: support@monetr.appDiscord: Join Discord ServerPhone: (651) 243-0035","note#Note":"The easiest way to get in contact with someone for support is via GitHub, Email or Discord. You are welcome to call\nour phone number, but at the moment we will not answer and would call you back at a later time.If your inquiry involves sensitive or personal information, please contact us directly via phone or email. Do not\ndisclose personal or sensitive information in any public channels."}},"/documentation/configure":{"title":"Configuration","data":{"":"Configure your monetr installation using the following guides. monetr offers many configuration options, make sure to\nread the documentation of each option thoroughly before customizing monetr.monetr is configured via a YAML file, typically located at /etc/monetr/config.yaml. This file allows many of the\nfeatures that monetr offers to be tweaked and adjusted for your use case, or for development.The root structure of this YAML file is:\nName\tType\tDefault\tDescription\tenvironment\tString\tdevelopment\tEnvironment name, used by the Sentry integration.\tallowSignUp\tBoolean\ttrue\tAre people allowed to create new users on the server?\t\nThe two values that are at the root level of the configuration can also be specified via the following environment\nvariables:\nVariable\tConfig File Field\tMONETR_ENVIRONMENT\tenvironment\tMONETR_ALLOW_SIGN_UP\tallowSignUp","example-config-file#Example Config File":"Below is a complete config file example with default values set or with values commented out.","sub-configurations#Sub-Configurations":"Each of the sub-configurations noted above are documented in more detail in the following guides:"}},"/documentation/configure/cors":{"title":"CORS","data":{"":"monetr generally is hosted on a single domain name and thus does not require CORS, however if your self hosting setup\nrequires that your monetr instance be accessible from another domain name then you must configure CORS.Below is an example of the CORS configuration block:\nName\tType\tDefault\tDescription\tallowedOrigins\tArray\t[]\tOther origins that are allowed to access your monetr server.\tdebug\tBoolean\tfalse\tDebug logging for helping diagnose CORS issues.\t\nThe following environment variables can be used to configure CORS options:\nVariable\tConfig File Field\tMONETR_CORS_ALLOWED_ORIGINS\tcors.allowedOrigins\tMONETR_CORS_DEBUG\tcors.debug"}},"/documentation/configure/email":{"title":"Email/SMTP Configuration","data":{"":"monetr supports sending email notifications (and email verification) if SMTP is configured. Currently emails can be sent\nwhen a user creates a new account, forgets their password, or changes their password.All email features require that enabled is set to true and a valid smtp config is provided. monetr does not\nsupport specific email APIs and has no plans to. Several email providers offer an SMTP relay, this is monetr's preferred\nmethod of sending emails as it is the most flexible.Below is an example of the email/SMTP configuration block:\nName\tType\tDefault\tDescription\tenabled\tBoolean\tfalse\tAre email notifications enabled on this server?\tdomain\tString\t\tEmail domain used to send emails, emails will always be sent from no-reply@{DOMAIN}.","email-verification-configuration#Email Verification Configuration":"If you want to require users to verify their email address when they create a new login on monetr, you can enable email\nverification. This will email users a link that they must click after creating their login, the link's lifetime can be\ncustomized if needed.An example of the email verification config:\nThe token lifetime is parsed using time.ParseDuration(...), any value that\ncan be parsed using that function is a valid configuration value.\nName\tType\tDefault\tDescription\tenabled\tBoolean\tfalse\tIs email verification enabled/required on this server?\ttokenLifetime\tDuration\t10m\tHow long should the link in the verification email be valid?","forgot-password-configuration#Forgot Password Configuration":"If you ever lose your password and need to reset it, the easiest way is by using the forgot password form. This will\nsend an email to the user (if a user with that email exists) that includes a link to reset their password. Similar to\nthe Email Verification Configuration, this also only requires an enabled and\ntokenLifetime value.Example of the forgot password configuration:\nName\tType\tDefault\tDescription\tenabled\tBoolean\tfalse\tAre users allowed to reset their password via forgot password?\ttokenLifetime\tDuration\t10m\tHow long should the password reset link be valid?","smtp-configuration#SMTP Configuration":"monetr only supports PLAIN SMTP authentication at this time. You can\nobtain all of the necessary details from your preferred email provider.\nmonetr's SMTP implementation requires TLS. Your email provider must support TLS on whatever port specified below."}},"/documentation/configure/kms":{"title":"Key Management","data":{"":"monetr supports encrypting secrets before they are stored in PostgreSQL. Other data may support encryption in the future\nbut at the moment only Plaid credentials are encrypted.To that end, monetr supports a few different providers. An outline of the configuration for key management:\nIf you are using the plaintext provider (which is the default), no additional options needs to be provided for the\nkey management configuration.\nIt is possible to migrate to another KMS provider using the monetr CLI, however this workflow is not documented at this\ntime. It is recommended you pick the key management provider you want to stick with initially and not change it.","plaintext#Plaintext":"When plaintext is specified as the provider, monetr will not encrypt any secrets and all items in the secrets table\nwill be stored in plain text. This is fine for self hosted deployments or development environments.","aws-kms-configuration#AWS KMS Configuration":"The AWS KMS will encrypt secrets using AWS's key management API. There is also an option to run a local version of AWS\nKMS for the local development environment for monetr.\nName\tType\tDefault\tDescription\tregion\tString\t\tThe AWS region to use for the client. May be required depending on your configuration.\taccessKey\tString\t\tThe Access Key that monetr should use to access the AWS KMS API.\tsecretKey\tString\t\tThe Secret Key that monetr should use to access the AWS KMS API.\tkeyID\tString\t\tThe actual Key ID in AWS, this must be the ID of the key to use for encryption and decryption and should not be changed. If this ID is changed then values encrypted with another key will not be able to be decrypted with this new key.\tendpoint\tString\tnull\tThe AWS KMS API endpoint, this is intended to be used only for local development environments.","google-cloud-kms-configuration#Google Cloud KMS Configuration":"Google Cloud KMS is also supported for encryption/decryption of secrets in monetr. It will require service account\ncredentials in the form of a JSON file. However if you are running monetr within Google Cloud, you can typically inject\nthe service account credentials directly into the VM or the GKE container. Documentation on obtaining credentials\nmagically via Google Cloud will not be provided here.\nName\tType\tDefault\tDescription\tresourceName\tString\t\tThe name of the actual keyring to use for encryption and decryption. This cannot be changed later as previously encrypted secrets cannot be decrypted with a different keyring.\tcredentialsJSON\tString\tnull\tIf you want to load credentials for your service account via a JSON file, specify the path to that file here. If left blank the Google Cloud SDK will look in default locations on the system for credentials.\t\nMore information on how credentials in Google Cloud can be found here: How Application Default Credentials\nworks","vault-transit-configuration#Vault Transit Configuration":"Hashicorp Vault is a self-hostable option for encryption. Vault keeps track of the\nencryption keys themselves while monetr leverages the\nTransit secrets engine to encrypt and decrypt data.When running inside Kubernetes, monetr can use the kubernetes authentication method to access Vault. When this is\nconfigured, monetr will automatically renew its Vault credentials a few moments before they expire. Other authentication\nmethods may require a non-expiring token such as the root token.\nName\tType\tDefault\tDescription\tkeyID\tString\t\tName of the transit mount to use for KMS.\tauthMethod\tString\t\tValid values are:- token: Use a hardcoded token to authenticate Vault.- kubernetes: Use the container's Kubernetes Service Account Token.- userpass: Provide a username and password.\ttoken\tString\t\tWhen using token authentication, you can provide the raw token here.\ttokenFile\tString\t\tAs an alternative to providing the token directly in the config file, specify a path to a file containing the token itself.\tusername\tString\t\tIf you are using userpass authentication, then this field and the password field must be specified.\tpassword\tString\t\tIf you are using userpass authentication, then this field and the username field must be specified.\trole\tString\t\tRole in Vault that monetr should authenticate for, decides what permissions monetr has.\tendpoint\tString\t\tThe URL that Vault API requests should be made to, should be the complete URL including protocol (https), as well as port if non-standard and path if the API is on a sub-route.\ttlsCertificatePath\tString\t\tPath to the TLS certificate file, used if Vault is being hosted with a self signed certificate.\ttlsKeyPath\tString\t\tPath to the TLS key file, used if Vault is being hosted with a self signed certificate.\ttlsCAPath\tString\t\tPath to the Certificate Authority file, used if Vault is being hosted with a self signed certificate.\tinsecureSkipVerify\tBoolean\tfalse\tWhen true, monetr will not verify the TLS certificate of the Vault server, less secure."}},"/documentation/configure/links":{"title":"Links Configuration","data":{"":"The links configuration is extremely simple, at the moment it only contains a single parameter.\nThe max number of links determines how many Plaid links an account can have configured at any given time. monetr does\nnot currently enforce a maximum number of manual links. If the value is set to 0 then no limit is enforced at all.\nIt is likely that this configuration option will be removed in the future, and will be superceded by a feature flag\nconfiguration instead. Allowing more flexibility with enforcing limits."}},"/documentation/configure/logging":{"title":"Logging Configuration","data":{"":"monetr uses logrus for all of its logging at this time. At the moment it supports\na text and JSON formatter. The text formatter will have colors enabled by default, unless an environment variable CI\nis provided with a non-empty value.\nThe default log level for monetr is info. Lower log levels can create a lot of noise, debug will log each HTTP\nrequest that the server handles, trace will log every SQL query that the application performs (except as part of\nbackground job processing).If you are running your application on Google Cloud, it is recommended to enable StackDriver logging, as it will adjust\nthe way some important fields are formatted (when the format is set to json) to match StackDriver's expected patterns.\nMore information on the StackDriver format is available here: Structured\nLogging."}},"/documentation/configure/plaid":{"title":"Plaid Configuration","data":{"":"This guide shows you how to configure Plaid for your self hosted monetr instance. This will require Plaid credentials\nwhich can be obtained by following the Plaid Credentials Guide.\nName\tType\tDefault\tDescription\tenabled\tBoolean\ttrue\tAre users allowed to create Plaid links on this server? Even if this value is true, it is only considered enabled if the Client ID and Client Secret are also provided.\tclientId\tString\t\tYour Plaid Client ID obtained from your Plaid account.\tclientSecret\tString\t\tYour Plaid Client Secret obtained from your Plaid account.\tenvironment\tString\t\tPlaid environment URL, must match the environment of your Plaid credentials.\twebhooksEnabled\tBoolean\t\tIf you want to allow Plaid to send updates to monetr via webhooks.\twebhooksDomain\tString\t\tRequired if you want to receive webhooks from Plaid, must be an externally accessible domain name. Plaid also requires HTTPS for all webhooks. Only specify the domain name, not a full URL. Sub-routes are not supported here.\toauthDomain\tString\t\tDomain used for OAuth redirect URLs, does not necessarily need to be externally accessible, however must support HTTPS as Plaid will not redirect to a non-HTTPS URL. Only specify the domain name. Sub-routes are not supported.\tcountryCodes\tArray\t[\"US\"]\tArray of uppercase country codes to enable for Plaid links. See Non-US Countries for more information.\t\nThe following environment variables map to the following configuration file fields. Each field is documented below.\nVariable\tConfig File Field\tMONETR_PLAID_CLIENT_ID\tplaid.clientId\tMONETR_PLAID_CLIENT_SECRET\tplaid.clientSecret\tMONETR_PLAID_ENVIRONMENT\tplaid.environment\tMONETR_PLAID_WEBHOOKS_ENABLED\tplaid.webhooksEnabled\tMONETR_PLAID_WEBHOOKS_DOMAIN\tplaid.webhooksDomain\tMONETR_PLAID_OAUTH_DOMAIN\tplaid.oauthDomain","non-us-countries#Non-US Countries":"monetr supports connecting to non-US countries via Plaid. However, Plaid has special requirements for connecting to\ncountries outside the US. For self-hosted environments you will need to contact Plaid support in order to have\nadditional countries enabled for your account. EU based countries as well as the UK has special requirements and it may\nnot be possible to connect to them via Plaid given those requirements.You may also need to customize your link experience inside Plaid to enable additional countries. You can do this on the\ndashboard.plaid.com/link page.You can then click on the Gear icon in at the top of the page on the right side to see what countries are currently\nconfigured for your link."}},"/documentation/configure/postgres":{"title":"PostgreSQL","data":{"":"monetr's primary database is PostgreSQL and is required in order for monetr to run. monetr also uses PostgreSQL as a\nbasic pub-sub system via LISTEN and NOTIFY commands.Officially monetr supports PostgreSQL version 16 and higher.\nName\tType\tDefault\tDescription\taddress\tString\tlocalhost\tThe IP, or DNS resolvable address of your PostgreSQL database server.\tport\tNumber\t5432\tPort that the PostgreSQL server can be reached at.\tusername\tString\tpostgres\tUsername that monetr should use to authenticate the PostgreSQL server.\tpassword\tString\t\tPassword that monetr should use to authenticate the PostgreSQL server.\tdatabase\tString\tpostgres\tDatabase that monetr should use, monetr may attempt to run migrations on startup. The user monetr is using should have permissions to create tables and extensions.\tinsecureSkipVerify\tBoolean\tfalse\tIf you are using TLS with PostgreSQL but are not distributing a certificate authority file, then you may need to skip TLS verification.\tcaCertificatePath\tString\t\tPath to the certificate authority certificate file. If you are verifying your TLS connection then this is required or the server certificate must be among the hosts certificate authorities already.\tkeyPath\tString\t\tPath to the client TLS key that monetr should use to connect to the PostgreSQL server.\tcertificatePath\tString\t\tPath to the client TLS certificate that monetr should use to connect to the PostgreSQL server.\t\nmonetr does watch for certificate changes on the filesystem to facilitate certificate rotation without needing to\nrestart the server. However this functionality does not always work and should not be relied on at this time.\nThe following environment variables map to the following configuration file fields. Each field is documented below.\nVariable\tConfig File Field\tMONETR_PG_ADDRESS\tpostgresql.address\tMONETR_PG_PORT\tpostgresql.port\tMONETR_PG_USERNAME\tpostgresql.username\tMONETR_PG_PASSWORD\tpostgresql.password\tMONETR_PG_DATABASE\tpostgresql.database\tMONETR_PG_INSECURE_SKIP_VERIFY\tpostgresql.insecureSkipVerify\tMONETR_PG_CA_PATH\tpostgresql.caCertificatePath\tMONETR_PG_KEY_PATH\tpostgresql.keyPath\tMONETR_PG_CERT_PATH\tpostgresql.certificatePath","database-migrations#Database Migrations":"The provided Docker Compose file will automatically run database migrations on startup as needed. However if you want to\nrun the migrations manually you can remove the --migrate flag from the serve command in the compose file.To run database migrations manually run the following command:\nTo see the current database schema version run the following command:"}},"/documentation/configure/redis":{"title":"Redis","data":{"":"monetr can use any cache that is compatible with Redis's wire protocol. In the provided Docker compose file, local\ndevelopment environment as well as in production valkey is used.monetr only caches a few things, and for self-hosting it may not even be necessary to run a dedicated cache at this time\nas monetr also leverages miniredis when a cache server has not been configured.\nFor a single monetr server this embedded \"Redis\" is sufficient.To configure a dedicated cache server though:\nName\tType\tDefault\tDescription\tenabled\tBoolean\tfalse\tEnable a dedicated cache server, if this is set to false then an embedded miniredis instance is used instead.\taddress\tString\t\tThe IP, or DNS resolvable address of your Redis-compatible cache server.\tport\tNumber\t6379\tPort that the Redis-compatible cache server can be reached at.\t\nmonetr does not support credentials or TLS for this cache server at this time. Sensitive information is never cached\non this server and the use of the cache is purely for performance.\nThe following environment variables map to the following configuration file fields. Each field is documented below.\nVariable\tConfig File Field\tMONETR_REDIS_ENABLED\tredis.enabled\tMONETR_REDIS_ADDRESS\tredis.address\tMONETR_REDIS_PORT\tredis.port"}},"/documentation/configure/security":{"title":"Security","data":{"":"monetr uses Platform-Agnostic Security Tokens for authentication as well as other stateless\nvalidation. For example, the links sent for resetting your password via email include a short-lived token signed and\nscoped exclusively for password resets. This is all done using\ngithub.com/aidantwoods/go-paseto.These tokens require an Ed25519 public and private key. If you are using\nthe provided Docker compose file then these are generated automatically the first time the server starts (via\n--generate-certificates on the serve command). The generated certificate is stored in a single file\n/etc/monetr/ed25519.key in PEM format, containing both the public and private key.\nName\tType\tDefault\tDescription\tprivateKey\tString\t/etc/monetr/ed25519.key\tThe path to the PEM encoded Ed25519 certificate that monetr will use for all security tokens.\t\nThis configuration cannot be defined via environment variable at this time.","generate-your-own-certificate#Generate Your Own Certificate":"If you want to provide your own certificate you can generate your own certificate using the following command:\nTo see the public key from this generated certificate:\nmonetr does not support certificate rotation for the security certificate. To rotate the certificate simply regenerate\nthe certificate file and restart the monetr server. Any existing tokens will no longer be considered valid, this will\nalso logout any currently active or signed on users."}},"/documentation/configure/server":{"title":"Server","data":{"":"These configuration parameters control monetr's actual HTTP server as well as some configuration around cookies.\nName\tType\tDefault\tDescription\tlistenPort\tNumber\t4000\tThe TCP port that monetr will listen for HTTP connections on.\tlistenAddress\tString\t0.0.0.0\tThe TCP address that monetr will listen for HTTP connections on. Recommended to set to your computer's IP address or 0.0.0.0 if you want to access it from outside the host's system.\texternalUrl\tString\thttps://localhost:{{ Listen Port }}\tThe actual external URL that monetr is accessible at, if you are exposing monetr to the internet or just your local network via a domain name you must specify this parameter. For example: http://monetr.local:4000. monetr uses this to determine how to set cookies as well as build URLs used in emails.\tstatsPort\tNumber\t9000\tThe TCP port that monetr will server Prometheus metrics on. Note: These metrics are not well maintained at the moment.\tuiCacheHours\tNumber\t336\tDefines the number of hours that UI assets should be cached by clients, sets the cache headers on all UI asset HTTP responses.\ttlsCertificate\tString\t\tSpecify the TLS certificate that the monetr HTTP server should use.\ttlsKey\tString\t\tSpecify the TLS key that the monetr HTTP server should use.\t\nThe TLS certificate and key do not affect the external URL. If you specify https://... in the external URL and\nomit a TLS certificate and key, monetr assumes that you have some kind of proxy layer such as Nginx providing TLS\ntermination.\nTLS certificates are also not automatically rotated for the HTTP server either. The server must be restarted after\ncertificates are changed.\nThe following environment variables map to the following configuration file fields. Each field is documented below.\nVariable\tConfig File Field\tMONETR_SERVER_EXTERNAL_URL\tserver.externalUrl","cookies#Cookies":"monetr uses cookies for authentication, cookies can be configured depending on whether or not you are using HTTPS for\nyour self hosted instance. But all cookies monetr issues are HTTP only such that they are never visible to client side\ncode.\nName\tType\tDefault\tDescription\tsameSiteStrict\tBoolean\ttrue\tShould cookies be issued such that they are only usable by the exact website specified in the external URL above? (Please always set to true)\tsecure\tBoolean\ttrue\tShould cookies be issued with the secure flag. If your external URL is using an http protocol though, then this will be treated as false regardless of the setting value here.\tname\tString\tM-Token\tThe name of the cookie that monetr should both issue for authentication and look for when authenticating requests from clients.\t\nNote: None of these can be configured via environment variables at this time."}},"/documentation/configure/storage":{"title":"Storage","data":{"":"monetr allows files to be uploaded in order to import transactions using OFX files. You can find the documentation on\nthat feature here. To facilitate this monetr requires a file storage backend.\nFor self hosted environments the filesystem provider is likely sufficient. But monetr also supports S3-compatible\nobject stores such as RADOSGW or minio, as\nwell as Google Cloud Storage.If you are running more than one monetr server instance, you should not use the filesystem storage provider. Instead one\nof the other two storage providers should be used.If you disable file storage, all file upload functionality will be disabled. Manual links will still work, but\ntransactions must be created one by one manually instead.\nName\tType\tDefault\tDescription\tenabled\tBoolean\tfalse\tAllow monetr to store files uploaded to it. As well as allow users to upload files.\tprovider\tString\tfilesystem\tValid values are:- filesystem: Store uploaded files on the local filesystem available to monetr.- s3: Store uploaded files on an external S3-compatible object store.- gcs: Store uploaded files on Google Cloud Storage.\t\nThe following environment variables map to the following configuration file fields. Each field is documented below.\nVariable\tConfig File Field\tMONETR_STORAGE_ENABLED\tstorage.enabled\tMONETR_STORAGE_PROVIDER\tstorage.provider\t\nmonetr does not currently have a way to migrate between storage providers. This should not be a problem immediately as\nthe only files currently being uploaded are deleted shortly after they are processed. But as monetr adds support for\nthings like transaction attachments this will become more relevant.","s3-compatible#S3 Compatible":"monetr supports any S3 compatible object store. Non AWS object stores will require additional configuration though, such\nas defining a custom endpoint and potentially specifying path style.\nName\tType\tDefault\tDescription\taccessKey\tString\t\tThe access key provided to you buy your object storage system. Required when useEnvCredentials: false\tsecretKey\tString\t\tThe secret key provided to you buy your object storage system. Required when useEnvCredentials: false\tendpoint\tString\t\tThe full URL of the object storage provider you are using. Required when you are not using AWS S3.\tbucket\tString\t\tThe name of the bucket where files will be uploaded. This is always required. The bucket must also already exist.\tforcePathStyle\tBoolean\tfalse\tIf you are using a custom object storage provider you might need to set this to true, instead of prefixing the bucket name onto the hostname. It will be appended to the path of requests made to the object store.\tuseEnvCredentials\tBoolean\tfalse\tIf this is set to true then the access key and secret will be loaded from the AWS_ACCESS_KEY and AWS_SECRET_KEY environment variables respectively.\t\nNote: This provider cannot be configured via environment variables outside of useEnvCredentials: true.","google-cloud-storage#Google Cloud Storage":"Similar to Google Cloud KMS, this will also require a\ncredentials JSON file from Google Cloud. However if you set the permissions for the service account correctly, the same\nfile can be used for both configurations.monetr requires the following permissions to use Google Cloud Storage:\nstorage.objects.create\nstorage.objects.delete\nstorage.objects.get\nstorage.objects.list\nIf you are using GCS for your storage, monetr will perform a permission check on startup to make sure that it has these\npermissions available. If it does not then it will log an error an exit.\nName\tType\tDefault\tDescription\tbucket\tString\t\tThe bucket in Google Cloud Storage that files should be uploaded to, monetr does not create this bucket. It must be created before-hand.\tcredentialsJSON\tString\tnull\tIf you want to load credentials for your service account via a JSON file, specify the path to that file here. If left blank the Google Cloud SDK will look in default locations on the system for credentials.\t\nNote: This provider cannot be configured via environment variables.","filesystem#Filesystem":"If you are self-hosting monetr, the filesystem storage is the easiest to use and is already configured in the provided\nDocker compose file.\nName\tType\tDefault\tDescription\tbasePath\tString\t/etc/monetr/storage\tA path to a directory that monetr will store uploaded files on the current system. If this directory does not exist monetr will create it.\t\nNote: This provider cannot be configured via environment variables."}},"/documentation/development":{"title":"Contributing","data":{"":"We want to make it as easy as possible for monetr users to become contributors. This documentation is still very much a\nwork in progress, but as time goes on it will hopefully become a helpful guide to building out features or fixing\nproblems within monetr."}},"/documentation/development/build":{"title":"Build","data":{"":"Building monetr locally using CMake.","general-requirements#General Requirements":"Node (>= 18.0.0)\nGo (>= 1.24.0)\ngit (>= 2.0.0)\nCMake (>= 3.23.0)\nGNUMake (>= 4.0)\ngcc (>= 12)\nmonetr will also create some binaries within the CMake binary directory, these binaries may be created by gem, npm\nor go install. These will not be installed on the host system itself, and are automatically removed when the source\ndirectory is cleaned.","building-monetr#Building monetr":"To build monetr you can simply run the following make command. This will run the CMake configuration and build steps\nnecessary to produce a binary at $PWD/build/monetr ($PWD/build/monetr.exe on Windows).","release-build#Release Build":"In order to produce a release build of monetr the following flag must be added.\nIn CI/CD, all builds are performed in release mode."}},"/documentation/development/code_of_conduct":{"title":"Contributor Covenant Code of Conduct","data":{"our-pledge#Our Pledge":"We as members, contributors, and leaders pledge to make participation in our community a harassment-free experience for\neveryone, regardless of age, body size, visible or invisible disability, ethnicity, sex characteristics, gender identity\nand expression, level of experience, education, socioeconomic status, nationality, personal appearance, race, religion,\nor sexual identity and orientation.We pledge to act and interact in ways that contribute to an open, welcoming, diverse, inclusive, and healthy community.","our-standards#Our Standards":"Examples of behavior that contributes to a positive environment for our community include:\nDemonstrating empathy and kindness toward other people\nBeing respectful of differing opinions, viewpoints, and experiences\nGiving and gracefully accepting constructive feedback\nAccepting responsibility and apologizing to those affected by our mistakes, and learning from the experience\nFocusing on what is best not just for us as individuals, but for the overall community\nExamples of unacceptable behavior include:\nThe use of sexualized language or imagery, and sexual attention or advances of any kind\nTrolling, insulting or derogatory comments, and personal or political attacks\nPublic or private harassment\nPublishing others' private information, such as a physical or email address, without their explicit permission\nOther conduct which could reasonably be considered inappropriate in a professional setting","enforcement-responsibilities#Enforcement Responsibilities":"Community leaders are responsible for clarifying and enforcing our standards of acceptable behavior and will take\nappropriate and fair corrective action in response to any behavior that they deem inappropriate, threatening, offensive,\nor harmful.Community leaders have the right and responsibility to remove, edit, or reject comments, commits, code, wiki edits,\nissues, and other contributions that are not aligned to this Code of Conduct, and will communicate reasons for\nmoderation decisions when appropriate.","scope#Scope":"This Code of Conduct applies within all community spaces, and also applies when an individual is officially representing\nthe community in public spaces. Examples of representing our community include using an official e-mail address, posting\nvia an official social media account, or acting as an appointed representative at an online or offline event.","enforcement#Enforcement":"Instances of abusive, harassing, or otherwise unacceptable behavior may be reported to the community leaders responsible\nfor enforcement at conduct@monetr.app. All complaints will be reviewed and investigated promptly and fairly.All community leaders are obligated to respect the privacy and security of the reporter of any incident.","enforcement-guidelines#Enforcement Guidelines":"Community leaders will follow these Community Impact Guidelines in determining the consequences for any action they deem\nin violation of this Code of Conduct:","1-correction#1. Correction":"Community Impact: Use of inappropriate language or other behavior deemed unprofessional or unwelcome in the\ncommunity.Consequence: A private, written warning from community leaders, providing clarity around the nature of the violation\nand an explanation of why the behavior was inappropriate. A public apology may be requested.","2-warning#2. Warning":"Community Impact: A violation through a single incident or series of actions.Consequence: A warning with consequences for continued behavior. No interaction with the people involved, including\nunsolicited interaction with those enforcing the Code of Conduct, for a specified period of time. This includes avoiding\ninteractions in community spaces as well as external channels like social media. Violating these terms may lead to a\ntemporary or permanent ban.","3-temporary-ban#3. Temporary Ban":"Community Impact: A serious violation of community standards, including sustained inappropriate behavior.Consequence: A temporary ban from any sort of interaction or public communication with the community for a specified\nperiod of time. No public or private interaction with the people involved, including unsolicited interaction with those\nenforcing the Code of Conduct, is allowed during this period. Violating these terms may lead to a permanent ban.","4-permanent-ban#4. Permanent Ban":"Community Impact: Demonstrating a pattern of violation of community standards, including sustained inappropriate\nbehavior, harassment of an individual, or aggression toward or disparagement of classes of individuals.Consequence: A permanent ban from any sort of public interaction within the community.","attribution#Attribution":"This Code of Conduct is adapted from the Contributor Covenant, version 2.0, available at\nhttps://www.contributor-covenant.org/version/2/0/code_of_conduct.html.Community Impact Guidelines were inspired\nby Mozilla's code of conduct enforcement ladder.For answers to common questions about this code of conduct, see the FAQ at\nhttps://www.contributor-covenant.org/faq. Translations are available at\nhttps://www.contributor-covenant.org/translations."}},"/documentation/development/credentials":{"title":"3rd Party API credentials for development","data":{"":"To work on all of the features monetr provides locally, you will need access to several sets of API credentials. These\ncredentials are outlines here in order of significance. monetr or people representing monetr will not provide any of\nthese credentials to you. You are responsible for gaining access to these credentials on your own. None of the\ncredentials require that you pay for them for development purposes.","plaid#Plaid":"It is recommended to use Sandbox credentials from Plaid for local development. The \"production\" credentials (as Plaid\ndesignates them) are for live bank accounts, however they can only be used a limited number of times.\nStart by creating a Plaid account at: Plaid Sign Up\nFill out the form to the best of your abilities. Please do not use monetr for the company name.\nOnce you have created your Plaid account, you can find your credentials\nhere: Plaid Keys\nFor monetr you will need your client_id as well as your sandbox secret.Add your credentials to the file $HOME/.monetr/development.env:\nThese credentials will be used the next time you run the monetr local development stack.","oauth#OAuth":"TODO","ngrok#ngrok":"ngrok is used to test code for webhooks. It allows requests to be made to your local development instance from an\nexternal endpoint. You can use ngrok without an API key; however, the tunnels will only last a short amount of time, and\nthe external endpoint will change each time. This might cause difficulty if you plan on working on webhook related\nfeatures. It is recommended to sign up for the free plan of ngrok and use the API key they provide you.You can sign up for ngrok here: ngrok Sign UpAdd your token and desired ngrok domain to your development environment file:","stripe#Stripe":"If you want to work on billing related features, you can also provide Stripe credentials to the local development\nenvironment. It is required to provide ngrok credentials along-side Stripe for local development. You can sign up for a\nStripe account here: Stripe Sign UpYou will need two sets of keys to work with Stripe.\nA test mode Stripe secret key. (Not the public key)\nA webhook secret, configured for your ngrok endpoint and with the proper scopes selected.\nOnce you have made a Stripe account you can follow this guide to retrieve your keys.","secret-key#Secret key":"Navigate to your Stripe API Keys page within the dashboard. Make sure you\nare in\n\"Test mode\".You will need to click Reveal test key in order to retrieve the API key.","webhook-secret#Webhook secret":"On the Stripe Webhooks page click + Add endpoint.Enter your ngrok base URL here with the suffix: /api/stripe/webhookThen you can add events that you need to work with. At a minimum the following events should be added as monetr requires\nthem.\nOnce the webhook endpoint has been created click Reveal under Signing Secret to retrieve the secret for the webhook\nendpoint.","recaptcha#ReCAPTCHA":"TODO","sentry#Sentry":"TODO","smtp#SMTP":"TODO","google-cloud-kms#Google Cloud KMS":"Google Cloud KMS support is currently being added to improve the security of storing encrypted secrets in monetr.\nDocumentation to follow.TODO"}},"/documentation/development/documentation":{"title":"Documentation","data":{"":"This is an overview of ways to contribute to monetr's documentation. To get started:\nYou can find outstanding issues for documentation\nhere: \nIf you don't find an issue that you'd be interested in working on, you can still create a pull request with your\ndesired changes.\nIf you have found a gap in our documentation that you aren't able to, or do not wish to fill yourself; please create\nan issue so that others are aware of this gap, and it can be addressed.","editing-documentation#Editing documentation":"All of our documentation is in the form of Markdown files in the docs directory of the monetr repository. You can\nsimply edit the existing files to make changes to the documentation. The documentation site is automatically generated\nin our GitHub Actions workflows.","building-locally#Building Locally":"You can build our documentation site locally using the following command, it requires Node.js and will create a static\nsite in the $PWD/docs/out directory.","editing-locally#Editing Locally":"If you want to work on the documentation in real time locally you can run the following command:\nThis will start a Next.js server locally serving docs. As you edit files in the docs/ directory you will be able to\nsee those changes automatically refresh in your browser.","style#Style":"We would like our documentation to follow a general guide, this creates some consistency in how our documentation is\nboth written, presented, and maintained over time.","language#Language":"All documentation should be written in \"American\" English as much as possible. The exception to that rule are\nquotations, trademarks or terms that are better known by their own language's equivalent.","reader--author#Reader / Author":"The documentation prefers \"we\" to address the author and \"you\" to address the reader. The gender of the reader shall be\nneutral if possible. Attempt to use \"they\" as a pronoun for the reader.","code-blocks#Code Blocks":"Code blocks should always be accompanied by a preceding text to give context as to what that code block is, or\nrepresents. Adjacent code blocks without a paragraph of text between them should be avoided.","screenshots#Screenshots":"Screenshots, if at all possible, should be no larger than 1280x720. This is not a strict requirement, but if a\nscreenshot can reasonably capture all the necessary details in that resolution or less; that is greatly preferred.","issue-tracking#Issue Tracking":"If documentation is missing and is planned to be added later. Please add a placeholder badge for that documentation\nusing shields.io, with the GitHub issue/pull request detail shield.The \"override label\" should use the following format.\nPlease make the badge link back to the original issue as well.","inclusivity#Inclusivity":"Language that has been identified as hurtful or insensitive should be avoided."}},"/documentation/development/local_development":{"title":"Local Development","data":{"":"This guide walks you through setting up a local development environment for monetr on macOS or Linux. If you are using\nWindows, it is still possible to run the development environment locally. However, it is not documented at this time.","prerequisites#Prerequisites":"At the time of writing this, monetr requires Plaid credentials for development. Among other credentials, documentation\non how to retrieve them can be found here: Credentials","clone-the-repository#Clone the repository":"To get started, clone the monetr repository from GitHub or from your fork.\nThe rest of the commands in this guide are issued from this directory.","dependencies#Dependencies":"monetr does require a few tools to be installed locally in order to develop or build it. These tools are outlined below:","required#Required":"Node (>= 18.0.0)\nnpm (>= 8.0.0)\ngit (>= 2.0.0)\nGo (>= 1.24.0)\nCMake (>= 3.23.0)\nGNUMake (>= 4.0)\ngcc (>= 12)\nThe tools above are the minimum tools required in order to build and work on monetr locally. But if you intend to run\nthe complete development environment locally or if you plan on creating release builds of monetr you will also need:","optional#Optional":"Docker (>= 20.0.0): Docker (and Docker Compose) are used to run the local development environment for monetr,\nallowing you to have the entire application and all of it's features with hot-reloading.","mac-specific#Mac Specific":"macOS can ship with a version of make that is outdated. It is recommended that you use brew or any other preferred\nmethod to install the most recent version of GNUMake on your Mac. This will not break anything that is already using\nmake, but will make sure that your version is compatible with the monetr Makefiles.For example; you should see something like this for your make version.","configuration--credentials#Configuration & Credentials":"At the moment monetr requires at least Plaid credentials in order to run properly, even for development. You can read\nmore about obtaining these credentials here: CredentialsThe makefile will look for these development credentials and some configuration options in the following path:\nYou can create the file manually like this:\nOnce you've opened this file you'll need to provide the Plaid Client ID as PLAID_CLIENT_ID and Plaid Client Secret as\nPLAID_CLIENT_SECRET here.Please do not store credentials in the project directory for monetr, it is much easier to accidentally commit secrets to\ngit when they are in your project directory. Keeping sensitive development credentials outside of the project makes it\nmuch harder to accidentally push them to a public repository.","cmake#CMake":"monetr uses CMake as the primary build system, it is also used for running the tasks for local development. If you want\nto use a custom CMake configuration you can create a CMakeUserPresets.json file in the project directory (it will be\nignored by Git) and populate it with the configuration variables you want to override. If you want to always use a\nspecific preset when running general make targets you can create a .cmakepreset file in the project directory. Inside\nthat file you can put the name of the preset you want to use by default. Or you can pass CMAKE_PRESET=... when running\na make target.\nCMAKE_PRESET is ignored for some make targets, such as release and test. As each of those targets have a\nspecific preset that they are expected to use.\nHere is a sample of a user presets file with a few customized options:\nThis config specifically changes the following options:\nMONETR_EMAIL_VERIFICATION_ENABLED: By setting this to true the developer is required to use the local SMTP server to\nverify their email address when creating a new user. Valid values are true or false.\nMONETR_KMS_PROVIDER: As configured, enables a local instance of Hashicorp Vault as\nwell as configures monetr to use Vault Transit for secret encryption and decryption. Valid values are plaintext,\naws or vault. Note: The AWS setting runs a local KMS service compatible with AWS KMS's API.\nMONETR_STORAGE_PROVIDER: A minio instance will be run as part of the local development stack. Valid values are s3\nor filesystem. When using filesystem uploaded files will be stored in your $PWD/build/development/storage\nfolder.\nMONETR_DEVELOPMENT_LITE_TARGET: When working on monetr's frontend only, specify an API server that you want to use\nfor the frontend to talk to. Requires an account on that API server.\nThere are other options here that will be documented later, as well as other options that have not been covered here at\nall, but those options are the primary ones that change the local development stack the most.","starting-it-up#Starting It Up":"With the above requirements installed. You should be able to spin up the local development environment that runs inside\nof Docker compose.This command will also load any of the environment variables specified in the development env file (mentioned above)\ninto the monetr container where the API is running.\nThis command may prompt you for an administrator password, this is because monetr is using mkcert and hostess to\nsetup TLS certificates as well as the monetr.local domain name in your /etc/hosts file.Disabling this will be available in the future, but has been required in order to integrate with Plaid's OAuth2 flow.\nThis will install node modules in the project's directory, as well as start up the containers needed for monetr to run\nlocally. This command will exit automatically once all the containers are healthy. If you want to follow along while it\nis starting up you can use the make logs command in another terminal inside the project directory.","certificate-problems#Certificate Problems":"If you run an issue where your browser is presenting a message like net::ERR_CERT_AUTHORITY_INVALID when trying to\nnavigate to https://my.monetr.local then please run the following commands in the monetr project directory.\nOn Linux you may also need to install libnss3-tools before running the mkcert install again.Once you restart your browser completely, this should correct the issue.","working#Working":"Congratulations, you should now have monetr running locally on your computer. The develop task will print out some\nbasic information for you. But if you missed it, you can access the development version of monetr at\nhttps://my.monetr.local.Almost all of monetr's code is setup to hot-reload as you make changes. The documentation, Go code and React UI will all\nautomatically reload as changes are made. Changes to the Go code will not invoke a browser refresh of any sort though,\nso to observe a new behavior in the API you will need to refresh or make the API call again.\nIf you want to disable hot reloading of the Go code, you can include DISABLE_GO_RELOAD=true in your env variables\nwhen you run make develop.","local-services#Local Services":"As part of the local development stack, several services are run to support monetr. These services include:\nminio As an S3 storage backend. The console is accessible via\nhttps://s3.monetr.local when the local environment is running.\nlocal-kms An AWS KMS compatible local development API. This is used for\nencrypting secrets in the local development environment.\nMailpit An SMTP server that allows emails to be sent without really sending\nthem. This is used to validate and test communication functionality locally. This service is accessible via\nhttps://mail.monetr.local when the local environment is running.\nVault Vault secret management and encryption, Transit is used by monetr for storing\nsecrets securely. Available at https://vault.monetr.local if you have Vault enabled in your user preset.","debugging#Debugging":"The monetr container running the API has delve included. If you prefer to work\nusing a step-debugger you can connect your editor to it. You will need to reconnect your editor each time it reloads,\nbut it is very easy to make your changes and then hit debug and let your breakpoints be hit.Delve is available via port 2345 on localhost. I'm not sure what the configuration will be for every editor to\nconnect to it; but this is a screenshot of IntellJ IDEA's configuration for remote debugging.","tests#Tests":"monetr requires a PostgreSQL instance to be available for Go tests to be run. At the moment there isn't a shorthand\nscript to provision this instance. But an easy way to do so is this:\nThis will start a PostgreSQL instance in Docker (or remove an existing one) and make it available on locahost:5432 as\nwell as not require authentication. This makes it easy for tests to target it.If tests are run via make then nothing more needs to be done. However, if you want to run tests directly from your\neditor or other tools you will need to run the database migrations.\nWill run all schema migrations on the PostgreSQL database on your localhost container.Tests can be run using the go test CLI, or all tests can be run using:","storybook#Storybook":"monetr now provides a storybook setup for working on UI components outside of running the entire application locally. To\nstart storybook you can run the following command.\nThis will kick off the storybook development server. You can make modifications to the stories locally or components\nused in stories and see the changes reflected with hot-reloading.To build the storybook as a static set of assets, you can run the following command:\nThis will output the storybook assets in $PWD/build/stories/dist","frontend#Frontend":"An alternative to running storybook to work on only the frontend components of monetr is to run a \"lite\" development\nenvironment. The lite environment only runs the frontend dev server and instead of requiring an active API server and\nadditional services to be running locally, you can instead point the frontend at a desired API server.To start the \"lite\" development environment run the following command:\nThis will run the UI dev server locally and the frontend will be available at http://localhost:3000. You can now make\nany desired changes to monetr's frontend without needing to run all of the services monetr relies on.This development mode defaults to monetr's staging environment (my.monetr.dev), which while it is publicly accessible;\nyou are not able to create new accounts on it at this time. If you want to change the API server that the lite\ndevelopment environment is using you can customize the domain name in your CMakeUserPresets.json file as noted above\nin the CMake section.\nBe extremely conscious about what actions you perform in the lite development environment, if you have your\ndevelopment environment pointed at the production instance for example; any actions you take locally will affect\nyour real account. Any data modified or deleted will not be recoverable.","documentation#Documentation":"monetr's documentation is built using Next.js and Nextra, it can be developed locally using the following command:\nThis will setup everything the documentation site needs and run the Next.JS development server locally, you can now make\nchanges to the documentation and see those changes reflected in your browser.Note: The \"hero\" or interface example on the documentation site's homepage does not work in development mode.In order to build the complete documentation site as it is hosted online you can run the follow command:\nThis will compile the documentation and output to $PWD/docs/out.If you want you can then run the entire site using the command: npx http-server docs/out -c-1.","emails#Emails":"monetr's email templates are generated using react-email. They can be found in\nthe emails/ directory in the project folder. These emails are compiled at build-time and include some go\ntemplating in their output in order to be useful for the server.In order to develop or make changes to the email templates and see your changes, you can run the following command:\nThis will start the react email development server, allowing you to preview the email templates in your browser with\nsome preset values (instead of the go template placeholders).","cleaning-up#Cleaning Up":"Once you have finished your work and you want to take the local development environment down you have a few options.","shutting-down-development-environment#Shutting Down Development Environment":"If you want to completely shut everything down then you can run the following command:\nThis will delete all of your local development data, including any Plaid links, expenses, goals, etc...\nThis removes the Plaid links that are active, takes down the Docker compose containers, removes their volumes.","completely-clean-up#Completely Clean up":"If you want to completely start fresh you can run the following make task. This will shut down the local development\nenvironment if it is running, but it will also delete any files created or generated during development. This deletes\nyour node_modules folder, any submodules, and generated UI code.\nThis should leave the project directory in a state similar to when it was initially cloned.Clean will not remove your CMakeUserPresets.json or .cmakepreset files.It is recommended to run make clean before performing a git pull when working from the main branch, this way changes\nin the build system or significant changes to project layout or the application will be applied properly."}},"/documentation":{"title":"Documentation","data":{"":"Welcome to the monetr documentation! Here, you’ll find everything you need to get started, whether you’re new to\nmonetr, looking to host it yourself, or contributing to its development.","what-is-monetr#What is monetr?":"monetr is a powerful web application designed to help you take control of your finances. It’s built around simplifying\nhow you manage recurring expenses like rent, subscriptions, or credit card payments. Beyond recurring expenses, monetr\nhelps you prepare for one-time goals—whether it’s saving for a big purchase or building a financial safety net.With monetr, budgeting becomes intuitive, ensuring you’re always ready for what’s next.","getting-started#Getting Started":"Ready to dive in? Explore the guides below to see how monetr can work for you:"}},"/documentation/install":{"title":"Self-Hosted Installation","data":{"":"monetr is completely free to self-host, giving you full control over your data and setup. This guide provides an\noverview of how to install and run monetr on your own infrastructure.","why-self-host-monetr#Why Self-Host monetr?":"Self-hosting monetr offers several advantages:\nCost-Free Usage: Run monetr without paying subscription fees.\nNote: If you use Plaid as a data provider, you may incur additional costs. See Plaid’s\nPricing for details.\nFull Data Ownership: Keep complete control over your financial data.\nWhether you’re interested in hosting your own applications or prefer a private alternative to hosted services,\nself-hosting gives you more control over your data and setup.","requirements-for-self-hosting#Requirements for Self-Hosting":"Before you begin, ensure you have the following:\nContainer Runtime: Docker Compose is the officially supported method for running monetr.\nServer or Host Machine:\nRecommended: A system with at least 512MB of RAM and 1GB of disk space.\nDatabase: monetr runs with PostgreSQL, which is included in the Docker Compose setup.\nDomain and SSL (Optional): For public access, consider setting up a domain with HTTPS.","installation-options#Installation Options":"Currently, monetr only officially supports container-based installations:","install-via-docker-compose#Install via Docker Compose":"The easiest way to self-host monetr is by using Docker Compose. This setup includes all necessary services, such as the\nmonetr application and PostgreSQL.","whats-next#What’s Next?":"After installing monetr, you can:\nConfigure it for your specific needs. See Configuration.\nExplore advanced hosting options like reverse proxies or custom domains.\nExplore available resources for feedback and support, including documentation updates and support channels.\nFor detailed steps, visit the full Docker Compose Installation Guide."}},"/documentation/install/docker":{"title":"Self-Host with Docker Compose","data":{"":"Self-hosting monetr via Docker Compose is the simplest and officially supported way to run monetr yourself. This guide\nassumes Docker is already installed on your system. If not, please refer to Docker's Installation\nGuide to set it up.monetr's container images are built with every tagged release and are available on both:\nDockerHub\nGitHub Container Registry (GHCR)\nImages from both registries are identical for the same version tag, so feel free to use your preferred registry.","image-tags#Image Tags":"Each monetr release provides two types of container image tags:","latest-tag#latest Tag":"The latest tag always points to the most recent version of monetr. For example:\nghcr.io/monetr/monetr:latest\nNote\nUsing the latest tag is convenient but can lead to unexpected behavior if updates introduce breaking changes.","versioned-tags#Versioned Tags":"Versioned tags, such as 0.18.31, refer to specific releases. For example:\nghcr.io/monetr/monetr:0.18.31Version tags are recommended for stability. By pinning a version, you can control updates and easily roll back if\nneeded. monetr's version numbers use a v prefix (e.g., v0.18.31), but container tags omit this prefix.","docker-compose#Docker Compose":"The easiest way to start monetr is to use the provided\ndocker-compose.yaml located in the project's root\ndirectory.","clone-the-repository#Clone The Repository":"To get the compose file, first clone the monetr repository:","configure-the-server#Configure The Server":"The provided compose file includes some defaults that should be sufficient to get monetr started and to try out manual\nbudgeting. But if you want to change anything; like adding Plaid credentials or setting up a proper domain name, you'll\nneed to configure monetr. The recommended way to do this is to pass environment variables for the parameters you want to\nchange. The easiest way to do this is to create a .env file somewhere outside the monetr repository folder and when\nrunning the Docker commands below, include the flag --env-file=${YOUR FILE PATH}. This will apply your customizations\nto the compose file without needing to modify the provided file.If you want to use a config file though you will need to modify the compose file to use one, or you will need to create\na config file within the default volume mount that gets created. To use a config file adjust the command for the\nmonetr service in the compose file to look like this:\nYou can replace the path to the config file with any path you want as long as it is readable by monetr. You can specify\nmultiple configuration file if you need to by passing -c ${file} multiple times before the serve command.\nEnvironment variables can take priority over values in the configuration file. If you are not seeing the behavior\nyou're expecting with your configuration changes, make sure that the environment variable for that configuration\nparameter is not specified with an incorrect or blank value. A blank value in the environment variable may cause\nunusual behaviors.","start-the-server#Start The Server":"To run monetr, execute the following command in your terminal from the root directory of monetr's repository.\nThis will start the monetr server, as well as the database it needs and a Valkey server. It will wait for everything to\nbe healthy before letting you continue.","open-monetr#Open monetr":"Once monetr is finished starting, you should be able to access it in your browser via http://localhost:4000.\nmonetr may be accessible from other URLs like the host's IP address, but it will only set the authentication cookie\n(as well as other things like email links) based on the external URL configuration. If you are having trouble logging\nin, make sure you are accessing monetr from the same URL that it logs as \"externalUrl\" when it starts.You can configure the external URL here: Server Configuration\nSign ups are enabled by default from the docker-compose.yaml provided. If you are exposing your monetr instance to\nthe public internet; it is recommended you disable sign ups after you have created your own login.","updating-via-docker-compose#Updating Via Docker Compose":"If you are already running monetr and want to upgrade to a more recent version you can perform the following steps.Please make sure to review the release notes for monetr before upgrading, as it will include any breaking changes you\nshould be aware of.","update-the-repository#Update The Repository":"In your cloned monetr directory, run the following command to retrieve the latest changes.\nIf you encounter a conflict while performing the pull, this means that some changes you may have made locally might\ncause problems with the latest version of monetr. Make sure to resolve these conflicts before moving onto the next step.","stop-the-containers#Stop The Containers":"You'll need to stop the containers running before upgrading to make sure there are not conflicts.","pull-new-images#Pull New Images":"Once the containers have stopped you can run the following command to update the monetr image:","start-monetr-again#Start monetr Again":"Once the new images have been pulled onto your local machine you can restart the server via docker compose:\nThings like database migrations are automatically run when using the provided compose file.","troubleshooting#Troubleshooting":"If you encounter issues while setting up or running monetr, here are some common problems and their solutions:","containers-wont-start#Containers Won’t Start":"If the containers fail to start or exit immediately:\nCheck the logs using:","cannot-access-monetr-in-the-browser#Cannot Access monetr in the Browser":"If http://localhost:4000 doesn’t load:Verify the containers are running using:\nEnsure no other services are using port 4000. Modify the docker-compose.yaml file to use a different port if needed.\nCheck firewall or network settings on your machine.","update-issues-after-pulling-new-images#Update Issues After Pulling New Images":"If monetr doesn't work correctly after an update:\nCheck for breaking changes in the Release Notes\nRun\nThis should recreate the containers for monetr without deleting any data on the volumes.","need-more-help#Need More Help?":"If these solutions don't resolve your issue:\nCheck the monetr GitHub Issues for similar problems.\nCreate a new issue with detailed logs and steps to reproduce the problem.\nReach out for assistance on Discord.","uninstalling#Uninstalling":"This will remove all of your data stored for monetr, please be careful as this data cannot be recovered unless you\nhave created a backup yourself somewhere.\nTo uninstall monetr via Docker Compose you can run the following command:"}},"/documentation/use":{"title":"Using monetr","data":{"":"Whether you’re just starting out or looking to maximize your financial planning with monetr, the guides below will help you make the most of the platform."}},"/documentation/use/billing":{"title":"Billing","data":{"":"monetr is a paid product for the hosted version. However, if you'd prefer, you can host monetr yourself for free\n(see Self-Hosting).","trial-period#Trial Period":"monetr offers a 30-day free trial to let you explore all its features. During the trial:\nNo credit card is required.\nYou'll have access to all features, but are limited to a single Plaid connection.\nAfter 30 days, your trial will expire, and you'll need to subscribe to continue using monetr.\nWe’ll email you a few days before your trial expires. If you decide not to continue, no action is required.","what-happens-when-my-trial-ends#What happens when my trial ends?":"You can still log in, but you’ll be prompted to subscribe before using the application.\nAfter 90 days, any active Plaid connections will be deactivated.","subscribe-to-monetr#Subscribe to monetr":"When your trial expires, subscribing is simple:\nLog in to your account.\nClick the Continue button when prompted to subscribe.\nYou’ll be redirected to our billing portal hosted by Stripe to enter your payment details and\nconfirm your subscription.","billing-details#Billing Details":"Subscriptions are billed monthly. See more details on our Pricing page.\nBilling begins immediately after subscribing.\nYou can manage your subscription, update payment methods, or view past invoices by clicking on the\n icon in the sidebar or selecting Manage Your Subscription from the billing page\nunder settings.\nThe billing settings page:The Stripe hosted billing management page:","canceling-your-subscription#Canceling Your Subscription":"You can cancel your subscription at any time:\nClick the  icon in the sidebar or select Manage Your Subscription from the\nbilling page under settings.\nIn the Stripe billing portal, click Cancel subscription.\nConfirm your cancellation.","what-happens-when-i-cancel#What happens when I cancel?":"You'll retain access until the end of your current billing cycle.\nYour data will remain accessible for 90 days after cancellation. During this period, you can resubscribe without\nlosing your data."}},"/documentation/use/expense":{"title":"Expenses","data":{"what-are-expenses#What Are Expenses":"Expenses are how monetr helps you manage recurring financial obligations, such as rent, car payments, or\nsubscriptions. The platform tracks how much money is required for each expense and when it’s due. Using Funding\nSchedules, monetr automatically sets aside a portion of the expense from each paycheck. This\napproach ensures that you don’t need to cover the full amount from a single paycheck. As a result, your\nFree-To-Use funds should remain consistent with every paycheck.This approach is similar to envelope budgeting, where funds are allocated to specific categories to ensure they’re\navailable for designated expenses. Like envelope budgeting, monetr helps you plan ahead and manage your cash flow\neffectively. However, monetr automates the process by calculating how much to set aside based on your paycheck schedule\nand expense deadlines.It’s best to create a separate expense entry for each recurring obligation. For example, setting up a monthly expense\nfor rent due on the first of the month ensures you’ll always have enough funds available to pay it on time. However,\nexpenses are less suitable for irregular costs, such as dining out or saving for large, infrequent purchases.Each expense is tied to an individual bank account. If a regular expense is paid from multiple accounts, create separate\nexpense entries in monetr for each account. Assign the appropriate amount to each entry based on how much each account\ncontributes to that expense.\nLooking for something else?\nIf you're trying to save for a one-time financial target or track contributions toward a larger goal, consider using\nmonetr's Goals feature instead. Goals are ideal for managing non-recurring targets like vacations, down\npayments, or paying off loans, and they provide more flexibility in tracking usage over time.","create-an-expense#Create an Expense":"To create an expense, navigate to the expense view for your current account by clicking Expenses in the sidebar.Then, click New Expense in the top navigation to open the creation modal.","how-much-do-you-need#How Much Do You Need?":"monetr needs to know the amount required for the expense. If the amount varies (e.g., utility bills), set it to the\nhighest expected amount within reason. For example, you might set a utility bill to its seasonal peak. You can adjust\nthe amount as needed, and any surplus funds will reduce the contribution required from future paychecks.","when-do-you-need-it-next#When Do You Need It Next?":"monetr needs the next due date for the expense. This date determines how the expense repeats going forward. You can\nupdate it later if necessary.If the expense’s due date varies, select a date a few days before it’s typically due. This ensures funds are available\nin advance. Contributions will still align with your funding schedule.","how-do-you-want-to-fund-it#How Do You Want to Fund It?":"If you haven’t already created a Funding Schedule, you’ll be prompted to do so here. Otherwise,\nselect an existing schedule to match how you want to contribute. For example, if your funding schedule aligns with your\npaychecks, you’ll contribute a portion of the expense each payday.","how-frequently-do-you-need-this-expense#How Frequently Do You Need This Expense?":"Choose how often the expense occurs. monetr will repeat the expense on this frequency and ensure funds are set aside\nbefore the due date.Supported frequencies include:\nWeekly\nEvery other week\nMonthly\nEvery other month\nEvery third month (quarterly)\nEvery six months\nYearly\nIf the date selected in When Do You Need It Next? is the 1st, 15th, or last day of the\nmonth, these additional options are available:\n1st and 15th of every month\n15th and last day of every month","how-expenses-help#How Expenses Help":"After creating expenses, monetr calculates contributions based on your funding schedule. For example, if you’re paid\ntwice a month, half the amount will be set aside each paycheck to balance contributions.In the expenses overview, you’ll see:\nThe next due date (e.g., December 30th in the screenshot above).\nHow frequently the expense occurs (e.g., monthly on the 30th).\nThe amount to be contributed next paycheck.\nThe current amount set aside for the expense (e.g., $0.00 in this example).","expense-details#Expense Details":"Click on an individual expense to view more details.This page provides all the information available in the list view and allows you to modify the expense if needed. You\ncan also Transfer funds to adjust the amount set aside for the expense\nmanually.\nWhen you remove an expense, any funds set aside for it are returned to your Free-To-Use amount.","expense-timeline#Expense Timeline":"Each expense includes a timeline showing predicted contributions and expected usage. This helps you track when funds\nwill be allocated and when the expense is due."}},"/documentation/use/forecasting":{"title":"Budget Forecasting with monetr","data":{"":"monetr includes a forecasting feature that it uses to calculate the future of your budgets. This feature can be see on\nthe Expenses, Goals, and Funding Schedule pages.","expense-forecasting#Expense Forecasting":"Expenses will show you what the current allocation is, and then will show you the next several events. Including\ncontributions or spending events for that expense.","goal-forecasting#Goal Forecasting":"Goals are similar to expenses, but will not show a spending event. Since it's not necessarily known to monetr whether or\nnot you are using the goal throughout the lifetime of the goal (spending from it as you contribute) or if you are\nattempting to build up for a singular purchase. Due to this monetr will show you how much will be allocated to the goal\nas well as how much is being contributed for the future events of the goal. If the goal is already complete then nothing\nwill be shown.","funding-schedule-forecasting#Funding Schedule Forecasting":"Funding schedules are forecasted as well, but are summarized differently. The funding schedule timeline will show you\nwhen your next contribution will be made for that specific schedule as well as how much that contribution will be\nbetween all of the budgets using that schedule. If you have specified an Estimated Deposit for a funding schedule\nthen it will also include an estimated Free-To-Use amount for that contribution event.","related-topics#Related Topics":""}},"/documentation/use/free_to_use":{"title":"Free-To-Use and Fund Allocation Guide","data":{"understanding-free-to-use#Understanding Free-To-Use":"Free-To-Use is a powerful feature in monetr designed to help you manage your discretionary spending. It shows you\nhow much money is available to spend after setting aside funds for your essential budgets, goals, and expenses. By\ncalculating your Available Balance and subtracting the total funds allocated to your Goals and Expenses, Free-To-Use\nensures that your essential expenses are covered, leaving you with a clear picture of your spending freedom.","how-free-to-use-works#How Free-To-Use Works":"Automatic Updates: Your Free-To-Use balance is automatically updated whenever there are changes to your budgets or\naccount balances. This real-time adjustment means you always have an accurate view of your financial situation without\nmanual intervention.\nThis requires that monetr has up-to-date account balances and transactions from your bank.\nTransaction Adjustments: If you change a Transaction's \"Spent From\" field, it can affect your Free-To-Use balance.\nFor instance, if a transaction is moved to be spent from a Goal or Expense with allocated funds, your Free-To-Use\nbalance may increase.\nImpact of Expenses and Goals:\nExpenses: These are recurring financial obligations like rent or subscriptions. Funds are automatically set\naside for these expenses, ensuring they don't unexpectedly impact your Free-To-Use balance. If an expense is\nremoved, any funds set aside are returned to your Free-To-Use balance, increasing your available spending money.\nGoals: These are savings targets for specific purposes, such as a vacation or a down payment. Allocating funds\nto a goal reduces your Free-To-Use balance, as the money is earmarked for future use. Achieving a goal or adjusting\nits target can free up funds, impacting your Free-To-Use balance.","why-free-to-use-is-useful#Why Free-To-Use is Useful":"Simplified Budgeting: For budgeting newcomers, Free-To-Use provides a straightforward way to see how much money is\nsafe to spend, reducing the risk of overspending.\nFinancial Flexibility: Life is unpredictable, and Free-To-Use offers the flexibility to make spontaneous purchases\nor handle unexpected expenses without compromising your financial plans.\nInformed Spending Decisions: Knowing your Free-To-Use amount allows you to decide whether to save for a new goal\nor enjoy a night out, all while staying informed about your financial commitments.","negative-free-to-use#Negative Free-To-Use":"Your Free-To-Use balance can become negative if the funds allocated to your budgets exceed your available balance.\nWhile this situation should be avoided, it can occasionally happen due to the timing of monetr's automations. For\ninstance, if monetr processes your funding schedule before your paycheck's transaction or balance is updated in monetr,\nyour Free-To-Use balance might temporarily show as negative until the update occurs.If this isn't the case, it might indicate that you're stretching your finances too thin. If your budgets require more\nthan your regular income or if you're spending beyond your Free-To-Use amount, it may be time to consider reducing your\nexpenses or overall spending.","transfer-allocating-funds#Transfer (Allocating Funds)":"You can easily transfer funds between your Free-To-Use balance, Expenses, and Goals. This helps you adjust your\nbudget as needed.\nNote\nThis process only changes how funds are allocated within monetr. It does not move actual money in your bank account.","1-navigate-to-the-expense-or-goal-you-are-moving-funds-between#1. Navigate to the Expense or Goal you are moving funds between.":"First, go to the Expense or Goal you want to adjust. Then, click the Transfer button located in the top navigation\nbar. This will open the transfer modal.","2-choose-where-to-move-funds#2: Choose Where to Move Funds":"In the transfer modal, you'll see two dropdown menus labeled From and To. Choose where you want to move funds\nfrom and to. You can select any Expense, Goal, or the Free-To-Use balance, but make sure the selections are\ndifferent. You can also use the arrow button to quickly swap the selections.For convenience, clicking on any of the amounts displayed above the dropdowns will automatically fill that amount into\nthe form.","3-finalize-the-transfer#3. Finalize the transfer.":"Once you've made your selections, click the Transfer button to complete the process. The modal will close, and the\nallocations in your Free-To-Use balance and the selected budget will be updated accordingly.","the-transfer-modal#The Transfer Modal":"The Transfer modal provides quick shortcuts above the dropdowns to help you move specific amounts easily. For the\nFree-To-Use balance, you can see the total available amount if you want to allocate all of it. For Expenses and\nGoals, you'll see three numbers: the current allocation, the target amount, and the difference between them. These\nshortcuts make it easy to adjust your budget with just a click."}},"/documentation/use/funding_schedule":{"title":"Funding Schedules","data":{"what-are-funding-schedules#What Are Funding Schedules":"Funding schedules let monetr know when to allocate funds for your budgets. Think of funding schedules as \"when do\nyou get paid.\" Allocating funds each time you get paid ensures that your Free-To-Use funds remain\npredictable and consistent.You can create multiple funding schedules if needed, such as putting money aside weekly or only once a month. Every\nExpense or Goal you create must be tied to a funding schedule.Funding schedules are unique to each bank account, not to the entire bank connection. For example, if you have both a\nchecking and savings account at the same bank, you may want separate funding schedules for each account. You can create\nmultiple funding schedules per account, but each must have a unique name within the account.This flexibility allows, for instance, a primary funding schedule for your checking account, covering most of your\npaycheck, and a secondary schedule for your savings account, allocating leftover funds.","create-a-funding-schedule#Create a Funding Schedule":"To create a funding schedule, navigate to the funding view of your current account by clicking Funding Schedules in\nthe sidebar.Then, click New Funding Schedule in the top navigation to open the creation modal.","when-do-you-get-paid-next#When Do You Get Paid Next?":"This date acts as a baseline for the funding schedule's recurrence. It influences the options available in the How\nOften Do You Get Paid? dropdown.For example, if you’re paid every two weeks on Friday, select the next Friday you’ll be paid.","how-often-do-you-get-paid#How Often Do You Get Paid?":"monetr supports the following recurring patterns:\nWeekly\nEvery other week\nMonthly\nEvery other month\nEvery third month (quarterly)\nEvery six months\nYearly\nIf the date chosen in When Do You Get Paid Next? is the 1st, 15th, or last day of the\nmonth, these additional options are available:\n1st and 15th of every month\n15th and last day of every month","additional-options#Additional Options":"Funding schedules offer two optional features for a more tailored budgeting experience. These options are visible on the\nfunding schedule’s details page.","excluding-weekends#Excluding Weekends":"If you get paid on the 1st and 15th, or 15th and last day of the month, your paycheck may arrive earlier when the date\nfalls on a weekend. Deposits aren’t typically processed on weekends or holidays. To align your funding schedule with\nwhen funds are likely deposited, enable Exclude Weekends in the details page.When enabled, if the next scheduled funding date falls on a Saturday or Sunday, it will adjust to the previous weekday.\n Holidays are not yet accounted for, but this feature will be added in the future, particularly for\nbank holidays that impact deposits.","estimated-deposit#Estimated Deposit":"Providing an estimated deposit amount helps monetr’s forecasting tools. This allows you to:\nAnticipate how much will be set aside from each paycheck.\nSee an estimate of your Free-To-Use funds after budgeting.","estimated-contribution#Estimated Contribution":"Once you’ve linked Expenses or Goals to a funding schedule, monetr calculates an \"Estimated\nContribution\" displayed on the funding schedule page. This value represents how much monetr expects to allocate toward\nyour budgets on the next funding date.Ensure the estimated contribution is less than your expected deposit. If it exceeds your deposit, you may not have\nenough funds to cover all expenses.","funding-timeline#Funding Timeline":"As you create more Expenses and Goals, the funding schedule provides insights into upcoming\nfunding events.This timeline shows:\nHow much money is expected to be allocated each time you’re paid.\nIf you’ve specified an Estimated Deposit, it also shows the leftover amount after accommodating\nyour budgets."}},"/documentation/use/getting_started":{"title":"Getting Started","data":{"":"Welcome to monetr! This guide will walk you through the initial steps to set up your account and start managing your\nfinances. You can choose to connect your bank account via our partner Plaid for automated updates,\nor create a manual budget for full control over your data, including the option to upload transactions via a file.monetr refers to these connections as \"links\"—a link between monetr and your bank or a \"manual link\" for self-managed\nbudgets. The table below highlights the differences between Plaid links and manual links:\nFeature\tPlaid\tManual\tAutomated Updates\tYes\tNo\tCreate Custom Transactions\tNo\tYes\tEdit Transaction Details\t(Only Names)\tYes\tImport Data From File\tNo\tYes\t\nThese features may evolve over time as monetr approaches its v1.0 release.","link-accounts#Link Accounts":"Using Plaid is the simplest way to manage your finances in monetr. Plaid securely connects to your bank and imports\ntransaction and balance data automatically.\nmonetr uses Plaid to provide read-only access to your banking data. This ensures your security—monetr cannot\nmove funds in your account. The imported data is exclusively used to create and maintain your budget.For more details, review our Privacy Policy.\nTo get started with Plaid:\nSelect Plaid and click Continue.\nFollow the on-screen instructions in the Plaid interface to authenticate your bank accounts.\nOnce complete, you’ll be redirected to the accounts page in monetr to begin creating your budget.\nTip: Connect monetr to the bank account you use most frequently for spending. If you use multiple accounts, you can\nconnect them later.","manual-accounts#Manual Accounts":"Prefer to manage your finances manually? monetr provides an easy-to-follow process for setting up a manual budget.To create a manual budget:\nSelect Manual and click Continue.\nFollow the steps below to configure your manual budget.","name-your-budget#Name Your Budget":"Give your manual budget a name. This could be the name of your bank or a custom label.","create-your-first-account#Create Your First Account":"Set up an account within your budget. This account should correspond directly to a real checking or savings account for\nclarity and simplicity.","set-a-starting-balance#Set a Starting Balance":"(Optional) Enter the current or starting balance for the account.\nIf you import data via file upload later, this balance will be overwritten.","create-an-initial-funding-schedule#Create an Initial Funding Schedule":"To maximize monetr’s functionality, set up a funding schedule for your manual budget. This determines how frequently\nfunds will be contributed to your budgets. You can modify or delete this later.","finishing-up#Finishing Up":"Click Finish to complete your setup. You’ll be redirected to your budget’s page, ready to start managing your\nfinances!"}},"/documentation/use/goal":{"title":"Goals","data":{"what-are-goals#What Are Goals?":"Goals in monetr are designed to help you save for one-off financial targets or manage payments toward larger\nobligations. Examples include:\nSaving for a down payment on a house.\nPaying off a loan or buy-now-pay-later balance.\nSetting aside money for a vacation or large purchase.\nUnlike recurring expenses, goals track both contributions and usage. This ensures you always know how much has been\nspent and how much remains allocated, while keeping your contribution schedule consistent.\nNeed to manage recurring payments?\nIf you're tracking regular expenses like rent, subscriptions, or utility bills, monetr's Expenses\nfeature is designed for that purpose. Expenses are ideal for consistent obligations that repeat on a predictable\nschedule.","example-how-goals-track-usage#Example: How Goals Track Usage":"Let’s say you create a goal to save $1,000 by the end of the year. You’ve contributed $100 so far, but you spend $50\nfrom the goal:\nmonetr knows $50 has been spent, leaving $50 still allocated.\nFuture contributions remain unchanged, as monetr tracks that $900 is still needed to meet the target.\nThis approach avoids over-funding and ensures contributions align with the goal’s timeline.","how-goals-differ-from-expenses#How Goals Differ from Expenses":"Although you can spend from both goals and expenses, their behavior differs significantly:\nGoals:\nTrack usage versus allocation.\nContributions remain consistent because monetr understands how much has already been used.\nIdeal for saving toward a specific target or managing payments over time.\nExpenses:\nDo not track usage.\nContributions dynamically adjust to cover what is assumed to be required (e.g., if funds are spent).\nBest for recurring obligations where usage tracking isn’t necessary.\nThis distinction makes goals better suited for long-term planning and flexible spending, while expenses excel at\nmanaging regular, predictable payments.","flexible-spending-with-goals#Flexible Spending with Goals":"A unique feature of goals is the ability to spend from them even before they are fully funded. For example:\nSuppose you set up a $1,000 goal to pay off a loan with monthly payments. You can mark each payment as Spent\nFrom the goal. monetr will keep track of these transactions and ensure the total contributions still\nmeet the $1,000 target by the due date.\nThis makes goals a versatile tool, whether you’re saving for the future or managing payments toward a larger financial\ntarget, while avoiding the risk of over-funding.","creating-a-goal#Creating a Goal":"To create a goal, navigate to the Goals section in the sidebar of your current account.Then, click New Goal in the top navigation to open the creation modal.","how-much-do-you-need#How Much Do You Need?":"Enter the total amount you need for the goal. monetr will allocate funds up to this amount by the due date.","how-soon-will-you-need-it#How Soon Will You Need It?":"Set a single due date for the goal. monetr uses this to calculate contributions, ensuring the goal is fully funded by\nthat date.","when-do-you-want-to-fund-the-goal#When Do You Want to Fund the Goal?":"Choose a Funding Schedule to determine how contributions will be made. If you don’t already have\none, you’ll be prompted to create a schedule during this step.","how-goals-help#How Goals Help":"Once your goal is created, monetr automatically calculates contributions based on your funding schedule. Goals provide:\nA way to save for the future with structured contributions.\nA method to track spending for specific purposes, such as loan payments or planned purchases.\nVisibility into progress, showing how much has been contributed and how much is left.\nIn the goals overview, you’ll see:\nThe goal’s due date.\nIts status: paused, active, or complete.\nThe amount to be contributed at the next funding event.\nThe current amount allocated, available for spending.\nThe goal’s total target amount, excluding what has already been spent.","goal-details#Goal Details":"Click on a goal to view detailed information.From the details page, you can:\nModify the goal if your plans change.\nTransfer funds to adjust the amount allocated.\nPause the goal to temporarily stop contributions.","pausing-and-resuming-goals#Pausing and Resuming Goals":"When a goal is paused:\nNo contributions are made toward it.\nThe timeline and calculations are frozen.\nWhen you resume the goal:\nmonetr recalculates the remaining contributions to ensure the target is met by the due date.\nIf you remove a goal, any funds allocated to it are returned to your Free-To-Use balance.","goal-timeline#Goal Timeline":"Every goal includes a timeline that visualizes contributions over time. This timeline:\nShows planned contributions up to the due date.\nDoes not predict spending since goals are designed to be flexible and less structured than expenses.\nIf a goal is paused, displays the current amount allocated and today’s date only."}},"/documentation/use/security/mfa":{"title":"Multi-Factor Authentication (MFA)","data":{"":"monetr supports TOTP (Time-Based One-Time Password) multi-factor authentication, offering a more secure alternative\nto SMS or email-based authentication. TOTP requires you to register with a trusted device or service, such as 1Password\nor Google Authenticator. Unlike phone numbers or email addresses, which can be more easily compromised, a TOTP-enabled\ndevice or service provides an additional layer of security for your account.","setup-mfa#Setup MFA":"You can navigate to the Settings page using the Gear icon on the sidebar, then clicking Security on the top\ntabs.\nThis will open the multi-factor setup modal.Scan the QR Code using your preferred MFA app such as Google Authenticator or 1Password. Or you can copy the secret\ngenerated below into the app manually.Your app will generate a 6-digit code, enter it in the text field at the bottom of the modal.If the code you entered is valid for the secret/QR Code given to you, then this will enable MFA for your account going\nforward.\nThe next time you login to monetr you will be prompted to enter your MFA code from your authenticator app.\nIf you lose access to your authenticator app you will lose access to your monetr account. If this happens please reach\nout to monetr support via support@monetr.app and we can help you recover your account\nafter verifying ownership."}},"/documentation/use/plaid":{"title":"Plaid","data":{"":"monetr integrates with Plaid to connect to your bank accounts, enabling automatic updates for transactions and balances.\nThis feature simplifies financial management by keeping your data up to date without requiring manual entry. Using Plaid\nis optional—monetr can be fully used without it.","supported-account-types#Supported Account Types":"monetr currently focuses on checking accounts for its features and functionality. While you can connect other\naccount types (e.g., savings or loans), monetr has not yet implemented features to fully utilize data from these\naccounts. Expanding support for additional account types is planned for future updates.","supported-countries#Supported Countries":"monetr currently supports the following countries via Plaid:\nCanada\nUnited States\nWe are looking to add support for more countries in the future as we are capable. If you are self hosting monetr you can\nconfigure additional countries via Plaid Configuration.","institution-health#Institution Health":"Plaid connections depend on the reliability of your bank’s integration with Plaid. Occasionally, a bank’s connection may\nencounter issues, preventing monetr from receiving regular updates. Here’s how monetr indicates the status of your\ninstitution:","healthy-institutions#Healthy Institutions":"When Plaid is successfully providing updates, the institution will appear in color in the sidebar:","updates-stopped#Updates Stopped":"If updates stop due to an issue with the bank or Plaid, the institution's logo will appear in black and white:","re-authenticating-connections#Re-authenticating Connections":"Sometimes updates stop because your connection requires re-authentication. To resolve this:\nClick on your bank’s name in the sidebar to open the menu.\nSelect Update Account Selection and follow the prompts to re-authenticate.\nThis process may trigger Plaid to sync new data from your institution.","adding-new-accounts#Adding New Accounts":"If you’ve already set up a Plaid connection, you can add additional accounts later. monetr doesn’t automatically detect\nnew accounts opened at your bank, so you’ll need to follow these steps to add them manually:","step-1-open-the-bank-menu#Step 1: Open the Bank Menu":"Click the bank’s name at the top of the sidebar. This will open a dropdown menu.","step-2-select-update-account-selection#Step 2: Select Update Account Selection":"Choose Update Account Selection to open the Plaid interface.","step-3-add-new-accounts#Step 3: Add New Accounts":"Select the new accounts you want to connect and click Continue.\nOnce Plaid updates the connection, monetr will sync the new accounts. They should appear in the dropdown under your\nbank’s name shortly. If they don’t show up immediately, try refreshing the page.","disconnecting-a-single-account#Disconnecting a Single Account":"To disconnect an individual account without removing the entire link:\nFollow the steps for Update Account Selection.\nDeselect the account you want to disconnect and complete the process.\nThe disconnected account may still appear temporarily but will show an Inactive badge. It will no longer receive\nupdates.","removing-a-plaid-link#Removing a Plaid Link":"If you need to remove a Plaid link entirely:\nClick on the bank’s name in the sidebar to open the menu.\nSelect Remove (Bank Name) and confirm your action.\nImportant: Removing a Plaid link permanently deletes all associated data, including transactions, expenses, and\ngoals. This data cannot be recovered once deleted.","best-practices-for-plaid-integration#Best Practices for Plaid Integration":"Monitor Institution Health: Keep an eye on the institution’s status in the sidebar and re-authenticate if needed.\nReport Issues: If you encounter recurring problems with a bank, report them to monetr support so we can escalate\nthem to Plaid.\nRegularly Update Connections: Use the Update Account Selection flow to ensure all relevant accounts are\nconnected and receiving updates.","summary#Summary":"Plaid simplifies managing your finances in monetr by automating transaction and balance updates. While it’s not\nrequired, it can save time and effort. Use the tools provided to monitor connections, add new accounts, or remove links\nwhen necessary."}},"/documentation/use/security/user_password":{"title":"User Password","data":{"":"monetr requires users authenticate using an email and a password. A password that is weak or easy to guess makes it\neasier for unauthorized people to sign in to your account.","change-your-password#Change your password":"You can change your password one of two ways. If you have access to your login you can click the Gear icon in the\nsidebar and then navigate to the Security tab within your settings. Or you can access the page here: Security\nSettings.There will be a few cards on this page, clicking Change Password button on the first card will open a dialog\nallowing you to update your password.Once you have updated your password monetr will send a confirmation email to your login's email address. You do not need\nto reply or do anything with this email, it is intended to notify users of unauthorized activity in the event that their\naccount may have been compromised.","forgot-password#Forgot password":"If you do not have access to your login, or have forgotten your password; you can still reset your password as long as\nyou have access to the email address that is associated with your login.Navigate to the Forgot Password page. Here you can provide the email address\nassociated with your login.Once you submit the form we will send you an email with a link that can be used to reset your password. Click the link\nin the email to proceed. If you do not receive the email make sure to check your spam or junk folder, otherwise please\nreach out to support for help.Once you open the link in the email, you will be prompted to provide a new password as well as to repeat it to help\nprevent any typos. Once submitted you will receive a confirmation email that your password was changed, and you should\nnow be able to login to your account with your new credentials.\nOn self-hosted instances of monetr, resetting your password via forgot password requires that the server has SMTP\nconfigured and forgot password enabled. There is an issue to track the feature of allowing passwords to be reset via\nthe monetr CLI for self hosted instances:"}},"/documentation/use/transactions":{"title":"Transactions","data":{"":"Transactions are the foundation of any budgeting app, and in monetr, they are central to how you plan and track your\nfinances. Unlike some budgeting apps that group transactions into broad categories, monetr maps each transaction\ndirectly to a specific budget, such as Rent or a subscription. This approach makes it easy to:\nSee which transactions are part of your planned budget.\nIdentify unbudgeted spending at a glance.\nGain better insight into your financial habits.","adding-transactions#Adding Transactions":"You can add transactions to monetr in one of three ways:\nPlaid Integration (Recommended): Automatically sync transactions from your bank. With Plaid, your\ntransactions will appear in monetr automatically, so you can log in periodically and assign them to budgets.\nFile Upload: Import transactions manually using a file from your bank.\nManual Entry: Create one-off transactions directly in monetr.\nEach method ensures your financial activity is accurately reflected in your budgeting process.","assigning-a-transaction-to-a-budget#Assigning a Transaction to a Budget":"When a transaction is created in monetr, it is automatically assigned to your Free-To-Use budget by\ndefault. The Free-To-Use budget represents the money that is not allocated to specific budgets you've set up.If a transaction should belong to a specific expense (e.g., Rent) or goal (e.g., Vacation), you can reassign it. Here's\nhow:","on-desktop#On Desktop":"Locate the transaction in the Transactions view.\nClick on the Spent From Free-To-Use text in the transaction row.\nSelect the appropriate budget (Expense or Goal) from the dropdown.","on-mobile#On Mobile":"Reassigning transactions on mobile requires navigating to the transaction details page:\nTap on the transaction in the Transactions view.\nOn the transaction details page, tap on the Spent From dropdown.\nSelect the budget (Expense or Goal) that the transaction should be assigned to.","similar-transactions#Similar Transactions":"monetr automatically identifies and groups similar transactions based on their name or memo. This feature is\nparticularly useful for recurring transactions, making it easier to spot patterns or review related expenses.\nSupported Methods: Similar transaction detection works for transactions added via Plaid or file uploads.\nHow to View Similar Transactions: Navigate to a transaction's details page to see similar transactions listed for\nreview.\nYou can view a similar transaction in detail by clicking the arrow or tapping the item on mobile.","notes-on-similar-transactions#Notes on Similar Transactions":"Manually Created Transactions\nSimilar transaction detection is not currently available for manually created transactions but will be supported in the future.Potential Inaccuracies\nThis feature is still being refined. The accuracy of similar transactions depends on the quality of the data provided:\nPlaid: Plaid may misidentify merchants, leading to incorrect groupings.\nFile Uploads: File uploads typically include raw transaction names, which are easier for monetr to process.\nHowever, extra details like location can sometimes cause grouping errors (e.g., grouping all transactions from a\ntown instead of a specific merchant).\nWe’re continually improving this feature to enhance its accuracy.","why-transactions-matter-in-monetr#Why Transactions Matter in monetr":"By managing your transactions effectively, you can:\nEnsure every dollar is accounted for in your budget.\nEasily spot unplanned spending and adjust accordingly.\nKeep track of your progress toward financial goals.\nWith monetr’s intuitive transaction management, you’re always in control of your finances.","next-steps#Next Steps":"If you’d like to learn more:"}},"/documentation/use/transactions/uploads":{"title":"Transaction File Uploads","data":{"":"monetr allows you to import transactions and balances via file uploads, providing an alternative for users who prefer\nnot to use Plaid. This guide explains how to upload files, supported formats, and key considerations to keep your data\naccurate and secure.","supported-file-format-ofx#Supported File Format: OFX":"monetr primarily supports the OFX (Open Financial Exchange) file format for importing transactions and balances.\nMost US banks offer an option to download OFX files alongside CSV files. OFX files are ideal because they:\nFollow a Standard Format: Ensuring compatibility without requiring user modifications.\nWork Seamlessly with monetr: Avoiding the complexity of non-standardized formats like CSV.\nWhile QFX (Quicken Financial Exchange) files are also accepted, monetr is optimized for OFX files. Some features may\nnot work as expected with QFX files due to differences in formatting.","account-type-support#Account Type Support":"Currently, monetr supports file uploads for Checking accounts only. The structure of OFX files can vary across\naccount types (e.g., Savings, Credit Card, Money Market), and these are not yet supported. Future updates will expand\nsupport to additional account types.While imports for other types of accounts may not present an error, the data may be incomplete for those account types.","how-file-uploads-work#How File Uploads Work":"When you upload an OFX file to monetr:\nTransaction Import:\nNew transactions from the file are added to your account.\nExisting transactions are not duplicated or overwritten.\nBalance Updates:\nThe account's current and available balances are updated based on the file data.\nAccidentally uploading an outdated file will not delete or overwrite existing transactions, but balances will\nreflect the old data. Simply upload the latest file to correct this.","important-considerations#Important Considerations":"Sensitive Information\nOFX files may contain sensitive information, such as account numbers. monetr:\nDoes not process or store sensitive information like account numbers.\nDeletes all uploaded files immediately after processing to ensure data security.\nManually Created Transactions\nCurrently, monetr does not merge manually created transactions with those imported via file uploads. Manually created\ntransactions remain separate.\nManual Links Only: File uploads are supported exclusively for manual links. Plaid-managed links cannot import\ntransactions via file uploads.","uploading-transactions#Uploading Transactions":"This will open the file upload modal, allowing you to select your file.You can click on the file upload area to open a file picker, or you can simply drag a QFX or OFX file into the upload\nbox to continue.Click Upload to send the file to monetr for processing, once you do monetr will show the status of the upload to you\nin real time.Clicking on Done will close the modal and refresh your view, you should now see the transactions from the file as\nwell as the balance on the sidebar updated.","future-updates#Future Updates":"monetr plans to expand file upload functionality to include:\nAdditional account types (e.g., Savings, Credit Card).\nImproved integration between manually created transactions and imported transactions.\nSupport for additional file formats such as CSV.","related-topics#Related Topics":""}},"/":{"title":"monetr: Take Control of Your Finances","data":{}},"/policy/privacy":{"title":"Privacy Policy","data":{"":"This Privacy Notice for monetr LLC (doing business as monetr) (\"we,\" \"us,\" or \"our\"), describes how and why\nwe might access, collect, store, use, and/or share (\"process\") your personal information when you use our services\n(\"Services\"), including when you:\nVisit our website at https://monetr.app, https://my.monetr.app, or\nany website of ours that links to this Privacy Notice.\nEngage with us in other related ways, including any sales, marketing, or events.\nQuestions or concerns? We’re here to help! Understanding this Privacy Notice is key to making informed decisions\nabout your privacy rights and choices. If you have questions or concerns, or if there’s anything in this policy that\ndoesn’t sit right with you, we encourage you to reach out to us at support@monetr.app.\nWe’ll do our best to address your concerns and provide clarity.Please note that we recommend not using our Services until you’re comfortable with how your personal information is\nhandled under this policy. Your privacy and trust are important to us, and we’re committed to working with you to ensure\nyour concerns are addressed.","summary-of-key-points#Summary Of Key Points":"This summary provides key points from our Privacy Policy, but you can find more details about any of these topics by\nclicking the link following each key point or by using our table of contents below to navigate to\nthe relevant section.What personal information do we collect? We collect personal information that you provide to us, such as names,\nemail addresses, passwords, and payment details. Financial data can be provided either manually or through Plaid, with\nyour explicit consent. Learn more about personal information you provide to\nus.Do we process any sensitive personal information? We may process sensitive information such as financial data, but\nonly with your explicit consent or as otherwise permitted by law. You have full control over how this information is\nshared. Learn more about sensitive information we process.Do we collect any information from third parties? We may use publicly available information, such as data from\nmerchant websites, to enhance your experience. We do not collect data from marketing partners, affiliates, or\nadvertisers. Learn more about information collected from other sources.How do we process your information? We process your information to provide and improve our Services, ensure\nsecurity, and comply with legal obligations. We do not share your information externally without your explicit consent.\nLearn more about how we process your information.In what situations and with whom do we share personal information? We only share your information with trusted\nservice providers like Stripe or Plaid, and only when necessary to deliver the Services you request. Data sharing with\nPlaid is entirely opt-in and requires your explicit consent. Learn more about when and with whom we share your personal\ninformation.How do we keep your information safe? We use industry-standard security measures such as encryption, restricted\naccess, and regular updates to protect your information. While we strive to safeguard your data, no system can guarantee\n100% security. Learn more about how we keep your information safe.What are your privacy rights? Depending on your location, you may have the right to access, correct, delete, or\nrestrict the use of your personal information. Learn more about what are your privacy\nrights.How do you exercise your rights? You can exercise your rights by visiting https://monetr.app/contact/ or\ncontacting us directly. We will respond in accordance with applicable data protection laws.Want to learn more about what we do with any information we collect? Review the Privacy Policy in\nfull.","table-of-contents#Table Of Contents":"1. What Information Do We Collect?2. How Do We Process Your Information?3. When and With Whom Do We Share Your Personal Information?4. Do We Use Cookies And Other Tracking Technologies?5. How Long Do We Keep Your Information?6. How Do We Keep Your Information Safe?7. Do We Collect Information From Minors?8. What Are Your Privacy Rights?9. Controls For Do-Not-Track Features10. Do United States Residents Have Specific Privacy Rights?11. Do We Make Updates To This Notice?12. How Can You Contact Us About This Notice?13. How Can You Review, Update, Or Delete The Data We Collect From You?","1-what-information-do-we-collect#1. What Information Do We Collect?":"","11-personal-information-you-provide-to-us#1.1. Personal Information You Provide to Us":"In Short: We only collect personal information that you choose to share with us.We collect personal information directly from you when you interact with our Services. This includes information you\nprovide when you:\nRegister for an account.\nExpress interest in our products or services.\nParticipate in activities on the Services.\nContact us for support or inquiries.\nPersonal Information We Collect: The specific information we collect depends on how you interact with our Services\nand the features you use. This may include:\nNames: To identify you in your account and communications.\nEmail addresses: To communicate with you and provide account-related notifications.\nPasswords: To secure your account and enable authentication (encrypted for your protection).\nPayment details (e.g., debit/credit card numbers, billing addresses): Collected solely to process transactions.\nPayment data is securely handled by our third-party provider, Stripe.","12-sensitive-information#1.2. Sensitive Information":"Sensitive Information: With your explicit consent or as permitted by applicable law, we process the following\ncategories of sensitive information:\nFinancial Data: This includes information such as account numbers, transaction histories, and balances. Financial\ndata can be provided in the following ways:\nVia Plaid (Third-Party Integration): To provide certain services, we utilize Plaid, a third-party service that\nfacilitates secure connections to your financial accounts. Data is shared with Plaid only on an opt-in basis,\nrequiring your explicit consent. You must authenticate and authorize Plaid to access your financial information for\ndata retrieval or sharing to occur. For more details on Plaid's data handling practices, please review their\nPrivacy Policy.\nManually by You: Financial data may also be provided directly by you, either through manual entry or by\nuploading a file containing the relevant information. This option gives you full control over what data you share\nwith us.\nPayment Data: If you choose to make purchases, we may collect data necessary to process your payment, such as your\npayment instrument number and associated security code. All payment data is handled and stored by Stripe. You can find\ntheir privacy notice here: https://stripe.com/privacy.For certain types of information, such as billing or payment details, we rely on you to provide accurate and complete\ninformation to process transactions and maintain your account.","13-information-from-other-sources#1.3. Information from Other Sources":"In Short: We may collect limited data from public sources to enhance your experience and provide accurate\ninformation.In some cases, we may use publicly available information to improve our Services. This includes:\nPublic databases: We may access publicly available information, such as a merchant’s website or similar resources,\nto provide additional context for a transaction (e.g., verifying the merchant’s name or categorizing a transaction).\nThis data is used solely to enhance the accuracy and functionality of our Services. It is not directly related to your\npersonal information and is only processed to improve your experience.We do not source data from marketing partners, affiliates, or third-party advertisers.","2-how-do-we-process-your-information#2. How Do We Process Your Information?":"In Short: We process your information to provide, improve, and administer our Services, communicate with you,\nensure security and fraud prevention, and comply with legal obligations. We will never share your information without\nyour direct consent.We process your personal information for a variety of reasons, depending on how you interact with our Services,\nincluding:\nTo facilitate account creation and authentication and manage user accounts. We may process your information so you\ncan create and log in to your account, as well as maintain its functionality.\nTo deliver and facilitate delivery of services to you. We may process your information to provide you with the\nrequested service.\nTo request feedback. We may process your information to request feedback and communicate with you about your use\nof our Services.\nTo protect our Services. We may process your information as part of our efforts to keep our Services safe and\nsecure, including fraud monitoring and prevention.\nTo evaluate and improve our Services and your experience. We may process your information to identify usage\ntrends, evaluate product performance, and improve the features and functionality of our Services. However, your\ninformation will never be shared externally, even in anonymized form, without your explicit consent.\nNote on Aggregate Metrics: We may use aggregate, identityless data—such as the total number of active users or\ngeneral platform statistics—for public communication, marketing, or internal analysis. This data does not include any\ninformation that could identify you or any other user.","3-when-and-with-whom-do-we-share-your-personal-information#3. When and With Whom Do We Share Your Personal Information?":"In Short: We do not share your personal information with third parties except when absolutely necessary to\nprovide the Services you request.We are committed to maintaining your privacy and will only share your personal information in the following situations:\nService Providers. We may share information with trusted third-party service providers who assist in delivering\nthe functionality of our Services (e.g., payment processing via Stripe or secure data integrations via Plaid).Note: Sharing financial data with Plaid is entirely optional and requires your explicit consent. You must\nauthenticate and authorize the connection to Plaid before any data is retrieved or shared. If you choose not to connect\nwith Plaid, this will not limit your ability to use our Services, as manual data entry and file uploads are supported.\nLegal Obligations. We may disclose information if required to do so by law or in response to valid legal requests,\nsuch as subpoenas or court orders.\nWe will never sell, rent, or share your personal information for marketing, advertising, or other unrelated purposes\nwithout your explicit consent.","4-do-we-use-cookies-and-other-tracking-technologies#4. Do We Use Cookies And Other Tracking Technologies?":"In Short: We use cookies only for essential functionality, such as authentication and customer support. We do not\nuse cookies for analytics or advertising.We may use cookies and similar tracking technologies to facilitate certain essential functions when you interact with\nour Services. Specifically, we use cookies to:\nEnable authentication and secure access to your account.\nProvide customer support and maintain the functionality of our Services\nCustomer Support Cookies: We use Chatwoot, a self-hosted customer support\napplication. Chatwoot uses cookies to maintain chat session continuity, ensuring a seamless support experience. These\ncookies are used solely to provide customer support and do not track your activity outside the support chat.Analytics Without Cookies:  We use Umami, a privacy-focused, cookieless,\nand self-hosted analytics solution. Umami collects anonymous usage data to help us improve our Services. No personal\ndata is ever collected, and no data is shared externally.No Advertising or Third-Party Tracking:  We do not permit third-party services to use tracking technologies on our\nplatform for advertising, targeting, or analytics purposes. Your interactions with our Services are never shared with\nadvertisers or external analytics providers.If you have any questions about our use of cookies or tracking technologies, please contact us at\nsupport@monetr.app.","5-how-long-do-we-keep-your-information#5. How Long Do We Keep Your Information?":"In Short: We retain your information only as long as necessary to provide our Services, comply with legal\nobligations, or fulfill the purposes described in this Privacy Notice. Once it is no longer needed, we securely delete\nor anonymize it.We will only keep your personal information for as long as it is necessary for the purposes set out in this Privacy\nNotice, unless a longer retention period is required or permitted by law (such as tax, accounting, or other legal\nrequirements). No purpose in this notice will require us keeping your personal information for longer than 90 days past\nthe termination of the user's account.When we have no ongoing legitimate business need to process your personal information, we will either delete or\nanonymize such information, or, if this is not possible (for example, because your personal information has been stored\nin backup archives), then we will securely store your personal information and isolate it from any further processing\nuntil deletion is possible.","6-how-do-we-keep-your-information-safe#6. How Do We Keep Your Information Safe?":"In Short: We aim to protect your personal information through a system of organizational and technical security\nmeasures.We have implemented appropriate and reasonable technical and organizational security measures designed to protect the\nsecurity of any personal information we process. However, despite our safeguards and efforts to secure your information,\nno electronic transmission over the Internet or information storage technology can be guaranteed to be 100% secure, so\nwe cannot promise or guarantee that hackers, cybercriminals, or other unauthorized third parties will not be able to\ndefeat our security and improperly collect, access, steal, or modify your information. Although we will do our best to\nprotect your personal information, transmission of personal information to and from our Services is at your own risk.\nYou should only access the Services within a secure environment.","7-do-we-collect-information-from-minors#7. Do We Collect Information From Minors?":"In Short: We do not knowingly collect data from or market to children under 18 years of age.We do not knowingly collect or solicit data from, or market to, children under 18 years of age. By using the Services,\nyou represent that you are at least 18 years old or are the parent or guardian of a minor and consent to their use of\nthe Services.If we learn that personal information from users under the age of 18 has been collected, we will deactivate the account\nand take reasonable measures to promptly delete such data from our records. If you become aware of any data we may have\ncollected from children under 18, please contact us at support@monetr.app.","8-what-are-your-privacy-rights#8. What Are Your Privacy Rights?":"In Short:  You may review, change, or terminate your account at any time, depending on your country, province, or\nstate of residence.Withdrawing your consent: If we are relying on your consent to process your personal information, which may be\nexpress and/or implied consent depending on the applicable law, you have the right to withdraw your consent at any time.\nYou can withdraw your consent at any time by contacting us by using the contact details provided in the section \"How\nCan You Contact Us About This Notice?\" below.However, please note that this will not affect the lawfulness of the processing before its withdrawal nor, when\napplicable law allows, will it affect the processing of your personal information conducted in reliance on lawful\nprocessing grounds other than consent.Account InformationIf you would at any time like to review or change the information in your account or terminate your account, you can:\nLog in to your account settings and update your user account.\nContact us using the contact information provided.\nUpon your request to terminate your account, we will deactivate or delete your account and information from our active\ndatabases. However, we may retain some information in our files to prevent fraud, troubleshoot problems, assist with any\ninvestigations, enforce our legal terms and/or comply with applicable legal requirements.Cookies and similar technologies: Most Web browsers are set to accept cookies by default. If you prefer, you can\nusually choose to set your browser to remove cookies and to reject cookies. If you choose to remove cookies or reject\ncookies, this could affect certain features or services of our Services.If you have questions or comments about your privacy rights, you may email us at\nsupport@monetr.app.","9-controls-for-do-not-track-features#9. Controls For Do-Not-Track Features":"Most web browsers and some mobile operating systems and mobile applications include a Do-Not-Track (\"DNT\") feature or\nsetting you can activate to signal your privacy preference not to have data about your online browsing activities\nmonitored and collected. At this stage, no uniform technology standard for recognizing and implementing DNT signals has\nbeen finalized. As such, we do not currently respond to DNT browser signals or any other mechanism that automatically\ncommunicates your choice not to be tracked online. If a standard for online tracking is adopted that we must follow in\nthe future, we will inform you about that practice in a revised version of this Privacy Notice.California law requires us to let you know how we respond to web browser DNT signals. Because there currently is not an\nindustry or legal standard for recognizing or honoring DNT signals, we do not respond to them at this time.","10-do-united-states-residents-have-specific-privacy-rights#10. Do United States Residents Have Specific Privacy Rights?":"In Short: If you are a resident of California, Colorado, Connecticut, Delaware, Florida, Indiana, Iowa, Kentucky,\nMinnesota, Montana, Nebraska, New Hampshire, New Jersey, Oregon, Tennessee, Texas, Utah, or Virginia, you may have the\nright to request access to and receive details about the personal information we maintain about you and how we have\nprocessed it, correct inaccuracies, get a copy of, or delete your personal information. You may also have the right to\nwithdraw your consent to our processing of your personal information. These rights may be limited in some circumstances\nby applicable law. More information is provided below.Categories of Personal Information We CollectWe have collected the following categories of personal information in the past twelve (12) months:\nCategory\tExamples\tCollected\tA. Identifiers\tContact details, such as real name, alias, postal address, telephone or mobile contact number, unique personal identifier, online identifier, Internet Protocol address, email address, and account name\tYES\tB. Personal information as defined in the California Customer Records statute\tName, contact information, education, employment, employment history, and financial information\tYES\tC. Protected classification characteristics under state or federal law\tGender, age, date of birth, race and ethnicity, national origin, marital status, and other demographic data\tNO\tD. Commercial information\tTransaction information, purchase history, financial details, and payment information\tYES\tE. Biometric information\tFingerprints and voiceprints\tNO\tF. Internet or other similar network activity\tBrowsing history, search history, online behavior, interest data, and interactions with our and other websites, applications, systems, and advertisements\tNO\tG. Geolocation data\tDevice location\tNO\tH. Audio, electronic, sensory, or similar information\tImages and audio, video or call recordings created in connection with our business activities\tNO\tI. Professional or employment-related information\tBusiness contact details in order to provide you our Services at a business level or job title, work history, and professional qualifications if you apply for a job with us\tNO\tJ. Education Information\tStudent records and directory information\tNO\tK. Inferences drawn from collected personal information\tInferences drawn from any of the collected personal information listed above to create a profile or summary about, for example, an individual’s preferences and characteristics\tNO\tL. Sensitive personal Information\tAccount login information, debit or credit card numbers and financial information including account access details\tYES\t\nWe only collect sensitive personal information, as defined by applicable privacy laws or the purposes allowed by law or\nwith your consent. Sensitive personal information may be used, or disclosed to a service provider or contractor, for\nadditional, specified purposes. You may have the right to limit the use or disclosure of your sensitive personal\ninformation. We do not collect or process sensitive personal information for the purpose of inferring characteristics\nabout you.We may also collect other personal information outside of these categories through instances where you interact with us\nin person, online, or by phone or mail in the context of:\nReceiving help through our customer support channels;\nParticipation in customer surveys or contests; and\nFacilitation in the delivery of our Services and to respond to your inquiries.\nWe will use and retain the collected personal information as needed to provide the Services or for:\nCategory A - As long as the user has an account with us\nCategory B - As long as the user has an account with us\nCategory D - As long as the user has an account with us\nCategory L - As long as the user has an account with us\nSources of Personal InformationLearn more about the sources of personal information we collect in \"What Information Do We\nCollect?\"How We Use and Share Personal InformationLearn more about how we use your personal information in the section, \"How Do We Process Your\nInformation?\"Will your information be shared with anyone else?We may disclose your personal information with our service providers pursuant to a written contract between us and each\nservice provider. Learn more about how we disclose personal information to in the section, \"When and With Whom Do We\nShare Your Personal Information?\"We may use your personal information for our own business purposes, such as for undertaking internal research for\ntechnological development. This is not considered to be \"selling\" of your personal information.We have not disclosed, sold, or shared any personal information to third parties for a business or commercial purpose in\nthe preceding twelve (12) months. We will not sell or share personal information in the future belonging to website\nvisitors, users, and other consumers.Your RightsYou have rights under certain US state data protection laws. However, these rights are not absolute, and in certain\ncases, we may decline your request as permitted by law. These rights include:\nRight to know whether or not we are processing your personal data\nRight to access your personal data\nRight to correct inaccuracies in your personal data\nRight to request the deletion of your personal data\nRight to obtain a copy of the personal data you previously shared with us\nRight to non-discrimination for exercising your rights\nRight to opt out of the processing of your personal data if it is used for targeted advertising (or sharing as\ndefined under California’s privacy law), the sale of personal data, or profiling in furtherance of decisions that\nproduce legal or similarly significant effects (\"profiling\")\nDepending upon the state where you live, you may also have the following rights:\nRight to access the categories of personal data being processed (as permitted by applicable law, including\nMinnesota’s privacy law)\nRight to obtain a list of the categories of third parties to which we have disclosed personal data (as permitted by\napplicable law, including California's and Delaware's privacy law)\nRight to obtain a list of specific third parties to which we have disclosed personal data (as permitted by\napplicable law, including Minnesota's and Oregon's privacy law)\nRight to review, understand, question, and correct how personal data has been profiled (as permitted by applicable\nlaw, including Minnesota’s privacy law)\nRight to limit use and disclosure of sensitive personal data (as permitted by applicable law, including California’s\nprivacy law)\nRight to opt out of the collection of sensitive data and personal data collected through the operation of a voice or\nfacial recognition feature (as permitted by applicable law, including Florida’s privacy law)\nHow to Exercise Your RightsTo exercise these rights, you can contact us by visiting https://monetr.app/contact/, by emailing us at\nsupport@monetr.app, by calling toll-free at (651) 243-0035, or by referring to the contact\ndetails at the bottom of this document.Under certain US state data protection laws, you can designate an authorized agent to make a request on your behalf. We\nmay deny a request from an authorized agent that does not submit proof that they have been validly authorized to act on\nyour behalf in accordance with applicable laws.Request VerificationUpon receiving your request, we will need to verify your identity to determine you are the same person about whom we\nhave the information in our system. We will only use personal information provided in your request to verify your\nidentity or authority to make the request. However, if we cannot verify your identity from the information already\nmaintained by us, we may request that you provide additional information for the purposes of verifying your identity and\nfor security or fraud-prevention purposes.If you submit the request through an authorized agent, we may need to collect additional information to verify your\nidentity before processing your request and the agent will need to provide a written and signed permission from you to\nsubmit such request on your behalf.AppealsUnder certain US state data protection laws, if we decline to take action regarding your request, you may appeal our\ndecision by emailing us at support@monetr.app. We will inform you in writing of any action\ntaken or not taken in response to the appeal, including a written explanation of the reasons for the decisions. If your\nappeal is denied, you may submit a complaint to your state attorney general.California \"Shine The Light\" LawCalifornia Civil Code Section 1798.83, also known as the \"Shine The Light\" law, permits our users who are California\nresidents to request and obtain from us, once a year and free of charge, information about categories of personal\ninformation (if any) we disclosed to third parties for direct marketing purposes and the names and addresses of all\nthird parties with which we shared personal information in the immediately preceding calendar year. If you are a\nCalifornia resident and would like to make such a request, please submit your request in writing to us by using the\ncontact details provided in the section \"How Can You Contact Us About This\nNotice?\"","11-do-we-make-updates-to-this-notice#11. Do We Make Updates To This Notice?":"In Short: Yes, we will update this notice as necessary to stay compliant with relevant laws.We may update this Privacy Notice from time to time. The updated version will be indicated by an updated \"Revised\" date\nat the top of this Privacy Notice. If we make material changes to this Privacy Notice, we may notify you either by\nprominently posting a notice of such changes or by directly sending you a notification. We encourage you to review this\nPrivacy Notice frequently to be informed of how we are protecting your information.","12-how-can-you-contact-us-about-this-notice#12. How Can You Contact Us About This Notice?":"If you have questions or comments about this notice, you may email us at\nsupport@monetr.app:","13-how-can-you-review-update-or-delete-the-data-we-collect-from-you#13. How Can You Review, Update, Or Delete The Data We Collect From You?":"You have the right to request access to the personal information we collect from you, details about how we have\nprocessed it, correct inaccuracies, or delete your personal information. You may also have the right to withdraw your\nconsent to our processing of your personal information. These rights may be limited in some circumstances by applicable\nlaw. To request to review, update, or delete your personal information, please visit:\nhttps://monetr.app/contact/."}},"/policy/terms":{"title":"Terms & Conditions","data":{"agreement-to-our-legal-terms#Agreement To Our Legal Terms":"We are monetr LLC, doing business as monetr (\"Company,\" \"we,\" \"us,\" \"our\"), a limited liability company\nregistered under the laws of the state of Minnesota, United States.We operate the https://monetr.app website (the \"Documentation and Landing Site\") and\nhttps://my.monetr.app (the \"Application Site\"), along with any related products and\nservices that reference or link to these legal terms (collectively, the \"Services\").These Terms and Conditions (\"Terms\") apply exclusively to your access and use of the hosted version of monetr,\navailable through the Documentation and Landing Site, the Application Site, and other hosted services we provide. Any\nuse, modification, or distribution of monetr outside of these Hosted Services is governed by the\nLICENSE under which monetr is distributed. Please refer to the\nmonetr license documentation for terms related to self-hosting or other non-commercial uses.You can contact us by phone at (651) 243-0035, via email at\nsupport@monetr.app.These Legal Terms constitute a binding agreement between you (\"you\"), whether individually or on behalf of an\nentity, and monetr LLC, governing your access and use of the Services. By accessing the Services, you acknowledge that\nyou have read, understood, and agreed to be bound by these Legal Terms. IF YOU DO NOT AGREE TO ALL OF THESE LEGAL TERMS,\nYOU ARE PROHIBITED FROM USING THE SERVICES AND MUST DISCONTINUE USE IMMEDIATELY.We will provide you with prior notice of any scheduled changes to the Services you are using. The modified Legal Terms\nwill become effective upon posting or notifying you by support@monetr.app, as stated in the email message. By continuing\nto use the Services after the effective date of any changes, you agree to be bound by the modified terms.The Services are intended for users who are at least 13 years of age. All users who are minors in the jurisdiction in\nwhich they reside (generally under the age of 18) must have the permission of, and be directly supervised by, their\nparent or guardian to use the Services. If you are a minor, you must have your parent or guardian read and agree to\nthese Legal Terms prior to you using the Services.We recommend that you print a copy of these Legal Terms for your records.","table-of-contents#Table Of Contents":"1. Our Services\n2. Intellectual Property Rights\n3. User Representations\n4. User Registration\n5. Purchases And Payment\n6. Subscriptions\n7. Software\n8. Prohibited Activities\n9. User Content And Interactions\n10. User Content License\n11. Third-Party Websites And Content\n12. Services Management\n13. Privacy Policy\n14. Copyright Infringements\n15. Term And Termination\n16. Modifications And Interruptions\n17. Governing Law\n18. Dispute Resolution\n19. Corrections\n20. Disclaimer\n21. Limitations Of Liability\n22. Indemnification\n23. User Data\n24. Electronic Communications, Transactions, And Signatures\n25. California Users And Residents\n26. Miscellaneous\n27. Contact Us","1-our-services#1. Our Services":"The information provided when using the Services is not intended for distribution to or use by any person or entity in\nany jurisdiction or country where such distribution or use would be contrary to law or regulation or which would subject\nus to any registration requirement within such jurisdiction or country. Accordingly, those persons who choose to access\nthe Services from other locations do so on their own initiative and are solely responsible for compliance with local\nlaws, if and to the extent local laws are applicable.The Services are not tailored to comply with industry-specific regulations (Health Insurance Portability and\nAccountability Act (HIPAA), Federal Information Security Management Act (FISMA), etc.), so if your interactions would be\nsubjected to such laws, you may not use the Services. You may not use the Services in a way that would violate the\nGramm-Leach-Bliley Act (GLBA) or any other applicable federal or state law.","2-intellectual-property-rights#2. Intellectual Property Rights":"","our-intellectual-property#Our intellectual property":"We are the owner or licensee of all intellectual property rights in our Services, including proprietary elements such as\nsource code, databases, functionality, software, website designs, audio, video, text, photographs, and graphics in the\nServices (collectively, the \"Content\"). This includes original trademarks, service marks, and logos created and owned by\nthe Company (the \"Marks\").While our Content and the Company's Marks are protected by copyright, trademark laws, and various other intellectual\nproperty rights and unfair competition laws both in the United States and internationally, the Services may include\nlogos, icons, and other brand elements that are used under applicable licenses, such as Creative Commons, or in a fair\nuse capacity.The Content and the Company's Marks are provided in or through the Services \"AS IS\" for your personal, non-commercial\nuse only.","your-use-of-our-services#Your use of our Services":"Subject to your compliance with these Legal Terms, including the \"Prohibited Activities\"\nsection below, we grant you a non-exclusive, non-transferable, revocable license to:\naccess the Services; and\ndownload or print a copy of any portion of the Content to which you have properly gained access.\nsolely for your personal, non-commercial use.Except as set out in this section or elsewhere in our Legal Terms, no part of the Services and no Content or Marks may\nbe copied, reproduced, aggregated, republished, uploaded, posted, publicly displayed, encoded, translated, transmitted,\ndistributed, sold, licensed, or otherwise exploited for any commercial purpose whatsoever, without our express prior\nwritten permission.You are welcome to discuss, share, or publicly display parts of the Services or Content, provided that the content you\nshare is your own or reflects your personal use of the Services. If you wish to use the Services, Content, or Marks for\npurposes beyond personal sharing (such as commercial use, extensive reproduction, or public display beyond fair use),\nplease submit a request to support@monetr.app. If we grant permission for such use, you must identify us as the owners\nor licensors of the Services, Content, or Marks and ensure that any applicable copyright or proprietary notice is\nvisible when posting, reproducing, or displaying our Content.We reserve all rights not expressly granted to you in and to the Services, Content, and Marks.Any breach of these Intellectual Property Rights will constitute a material breach of our Legal Terms and your right to\nuse our Services will terminate immediately and may be cause for legal liability.","your-submissions-and-uploads#Your Submissions and Uploads":"Please review this section and the \"Prohibited Activities\" section carefully prior to using\nour Services to understand the (a) rights you grant us and (b) obligations you have when you upload any content through\nthe Services.User Uploads: By uploading files such as financial data, receipts, images, or other materials (\"Uploads\") through\nthe Services, you retain ownership of any intellectual property rights in those Uploads. We do not claim ownership of\nyour Uploads, and they remain private, used solely to enrich your experience with the Services. However, by uploading\nsuch content, you grant us a limited, non-exclusive license to use, store, and process these Uploads as necessary to\nprovide the Services.Prohibited Content: You agree that you will not upload any content that is illegal, harassing, hateful, defamatory,\nobscene, harmful, abusive, discriminatory, threatening, sexually explicit, or otherwise in violation of any law. Any\ncontent uploaded that breaches these terms may lead to the removal of such content, suspension or termination of your\naccount, and reporting to authorities if applicable.Warranties and Representations: By uploading content through the Services, you:\nConfirm, represent and warrant that you have read and hereby acknowledge the \"Prohibited\nActivities\";\nRepresent and warrant that you have the necessary rights and licenses to upload such content and that the content does\nnot infringe on any third party’s intellectual property rights;\nRepresent and warrant that your Uploads do not contain any confidential information owned by a third party without\nauthorization.\nYour Responsibility: You are solely responsible for the content you upload. You agree to indemnify us for any losses\nthat we may suffer due to your breach of (a) this section, (b) any third party’s intellectual property rights, or (c)\napplicable law.Removal of Content: Although we do not monitor user-uploaded content proactively, we reserve the right to remove or\nedit any content that we reasonably consider to be in breach of these Legal Terms or harmful. We may suspend or disable\nyour account if such action is necessary.Copyright InfringementWe respect the intellectual property rights of others. If you believe that any material available on or through the\nServices infringes upon any copyright you own or control, please refer to the \"Copyright\nInfringement\" section below.","3-user-representations#3. User Representations":"By using the Services, you represent and warrant that: (1) all registration information you submit will be true,\naccurate, current, and complete; (2) you will maintain the accuracy of such information and promptly update such\nregistration information as necessary; (3) you have the legal capacity and you agree to comply with these Legal Terms;\n(4) you are not under the age of 13; (5) you are not a minor in the jurisdiction in which you reside, or if a minor, you\nhave received parental permission to use the Services; (6) you will not use the Services for any illegal or unauthorized\npurpose; and (7) your use of the Services will not violate any applicable law or regulation.If you provide any information that is untrue, inaccurate, not current, or incomplete, we have the right to suspend or\nterminate your account and refuse any and all current or future use of the Services (or any portion thereof).","4-user-registration#4. User Registration":"You may be required to register to use the Services. You agree to keep your password confidential and are responsible\nfor all use of your account and password. Your email address will serve as your username for accessing the Services.\nWhile we reserve the right to review account information and contact users regarding any inappropriate, obscene, or\nobjectionable content associated with their accounts, we will not change your registered email address without your\nconsent, as doing so could prevent you from accessing the Services.","5-purchases-and-payment#5. Purchases and Payment":"Payments for Services are processed through Stripe, which may support various forms of payment,\nincluding but not limited to:\nVisa\nMastercard\nAmerican Express\nDiscover\nPlease note that the accepted forms of payment are subject to change at any time based on the policies and offerings of\nStripe, our payment processor.You agree to provide current, complete, and accurate purchase and account information for all purchases made via the\nServices. You further agree to promptly update account and payment information, including email address, payment method,\nand payment card expiration date, so that we can complete your transactions and contact you as needed. Sales tax will be\nincluded in the purchase price and automatically calculated by Stripe, our payment processor, as required. All payments\nshall be in US dollars.You agree to pay all charges at the prices then in effect for your purchases, and you authorize us to charge your chosen\npayment provider for any such amounts upon placing your order. We reserve the right to correct any errors or mistakes in\npricing, even if we have already requested or received payment. If an error results in you being undercharged, you will\nnot be charged the difference for that specific transaction; the Company will cover the cost of the mistake. However,\nsubsequent subscription renewals will be charged at the correct price. If you are charged more than the correct price\ndue to an error, we will issue a refund for the difference as soon as we become aware of the error.We reserve the right to refuse any subscription or transaction placed through the Services. We may, in our sole\ndiscretion, limit or cancel the number of subscriptions or service plans associated with a single person, household, or\naccount. These restrictions may include subscriptions associated with the same customer account, payment method, and/or\nbilling address. We reserve the right to limit or prohibit subscriptions that, in our sole judgment, appear to be placed\nby dealers, resellers, or entities seeking to redistribute or misuse the Services.","6-subscriptions#6. Subscriptions":"Billing and RenewalYour subscription will continue and automatically renew unless canceled. You consent to our charging your payment method\non a recurring basis without requiring your prior approval for each recurring charge, until such time as you cancel the\napplicable order. The length of your billing cycle is monthly.Free TrialWe offer a 30-day free trial to new users who register with the Services. The account will not be charged and the\nsubscription will be suspended until upgraded to a paid version at the end of the free trial.CancellationAll purchases are non-refundable. You can cancel your subscription at any time by logging into your account. Your\ncancellation will take effect at the end of the current paid term. If you have any questions or are unsatisfied with our\nServices, please email us at support@monetr.app.Fee ChangesWe may, from time to time, make changes to the subscription fee and will communicate any price changes to you in\naccordance with applicable law.","7-software#7. Software":"We may include software for use in connection with our Services. If such software is accompanied by an end user license\nagreement (\"EULA\"), the terms of the EULA will govern your use of the software. If such software is not accompanied by a\nEULA, then we grant to you a non-exclusive, revocable, personal, and non-transferable license to use such software\nsolely in connection with our services and in accordance with these Legal Terms. Any software and any related\ndocumentation is provided \"AS IS\" without warranty of any kind, either express or implied, including, without\nlimitation, the implied warranties of merchantability, fitness for a particular purpose, or non-infringement. You accept\nany and all risk arising out of use or performance of any software. You may not reproduce or redistribute any software\nexcept in accordance with the EULA or these Legal Terms.","8-prohibited-activities#8. Prohibited Activities":"You may not access or use the Services for any purpose other than that for which we make the Services available. The\nServices may not be used in connection with any commercial endeavors except those that are specifically endorsed or\napproved by us.As a user of the Services, you agree not to:\nTrick, defraud, or mislead us and other users, especially in any attempt to learn sensitive account information such\nas user passwords.\nCircumvent, disable, or otherwise interfere with security-related features of the Services, including features that\nprevent or restrict the use or copying of any Content or enforce limitations on the use of the Services and/or the\nContent contained therein.\nUse any information obtained from the Services in order to harass, abuse, or harm another person.\nMake improper use of our support services or submit false reports of abuse or misconduct.\nUse the Services in a manner inconsistent with any applicable laws or regulations.\nEngage in unauthorized framing of or linking to the Services.\nUpload or transmit (or attempt to upload or transmit) viruses, Trojan horses, or other malicious material that\ninterferes with any party’s uninterrupted use and enjoyment of the Services or modifies, impairs, disrupts, alters, or\ninterferes with the use, features, functions, operation, or maintenance of the Services.\nEngage in any automated use of the system that degrades, disrupts, or negatively impacts the performance,\nfunctionality, or stability of the Services.\nDelete the copyright or other proprietary rights notice from any Content.\nAttempt to impersonate another user or person or use the username of another user.\nUpload or transmit (or attempt to upload or to transmit) any material that acts as a passive or active information\ncollection or transmission mechanism, including without limitation, clear graphics interchange formats (\"gifs\"), 1×1\npixels, web bugs, cookies, or other similar devices (sometimes referred to as \"spyware\" or \"passive collection\nmechanisms\" or \"pcms\").\nInterfere with, disrupt, or create an undue burden on the Services or the networks or services connected to the\nServices.\nHarass, annoy, intimidate, or threaten any of our employees or agents engaged in providing any portion of the\nServices to you.\nAttempt to bypass any measures of the Services designed to prevent or restrict access to the Services, or any\nportion of the Services.\nMake any unauthorized use of the Services, including collecting usernames and/or email addresses of users by\nelectronic or other means for the purpose of sending unsolicited email, or creating user accounts by automated means\nor under false pretenses.\nUse the Services as part of any effort to compete with us or otherwise use the Services and/or the Content for any\nrevenue-generating endeavor or commercial enterprise.\nUse the Services to advertise or offer to sell goods and services.\nSell or otherwise transfer your profile.\nInterfere with the service's operation, circumvent its access restrictions or conduct any security or vulnerability\ntest of the service.\nTransmit any viruses or harmful materials to the Service.","9-user-content-and-interactions#9. User Content and Interactions":"While the Services do not include public forums, message boards, or social interaction features within the Services,\nusers may interact with us and other community members through platforms such as GitHub for issues, pull requests, and\ndiscussions. These interactions are subject to the terms and conditions of the respective platform (e.g., GitHub) and\nnot directly covered by these Terms of Use.For any content or material you upload or submit through the Services (e.g., financial documents, images, or data):\nYou represent and warrant that you have the necessary rights, licenses, and permissions to upload or submit such\ncontent and that it does not violate any laws or third-party rights.\nYour uploaded content must not contain harmful, illegal, or objectionable material as outlined in the \"Prohibited\nActivities\" section.\nAny use of the Services in violation of these standards may result in the suspension or termination of your rights to\nuse the Services.","10-user-content-license#10. User Content License":"By uploading or submitting any content (e.g., financial data, documents, images) through the Services, you grant us a\nnon-exclusive, worldwide, royalty-free license to use, host, store, and process your content solely for the purpose of\noperating, improving, and providing the Services. This license enables us to facilitate features such as data analysis,\nstorage, and support, while respecting your ownership rights.You retain full ownership of all content you submit or upload and any associated intellectual property rights. We do not\nclaim ownership over your content and will not use it for commercial purposes outside the scope of providing the\nServices.You are solely responsible for the content you upload and represent that you have the necessary rights and permissions\nto submit such content. We are not liable for any statements or representations made by you in any content you provide.We reserve the right, at our discretion, to remove or modify any content that we determine violates these Legal Terms or\nis otherwise objectionable, without prior notice. However, we have no obligation to pre-screen or monitor user content.","11-third-party-websites-and-content#11. Third-Party Websites And Content":"The Services may contain (or you may be sent via the Site) links to other websites (\"Third-Party Websites\") as well as\narticles, photographs, text, graphics, pictures, designs, music, sound, video, information, applications, software, and\nother content or items belonging to or originating from third parties (\"Third-Party Content\"). Such Third-Party Websites\nand Third-Party Content are not investigated, monitored, or checked for accuracy, appropriateness, or completeness by\nus, and we are not responsible for any Third-Party Websites accessed through the Services or any Third-Party Content\nposted on, available through, or installed from the Services, including the content, accuracy, offensiveness, opinions,\nreliability, privacy practices, or other policies of or contained in the Third-Party Websites or the Third-Party\nContent. Inclusion of, linking to, or permitting the use or installation of any Third-Party Websites or any\nThird-Party Content does not imply approval or endorsement thereof by us. If you decide to leave the Services and access\nthe Third-Party Websites or to use or install any Third-Party Content, you do so at your own risk. These Terms &\nConditions do not govern Third-Party content or Third-Party Websites and you will be subject to the Third-Parties terms\nand conditions. You should review the applicable terms and policies, including privacy and data gathering practices, of\nany website to which you navigate from the Services or relating to any applications you use or install from the\nServices. Any purchases you make through Third-Party Websites will be through other websites and from other companies,\nand we take no responsibility whatsoever in relation to such purchases which are exclusively between you and the\napplicable third party. You agree and acknowledge that we do not endorse the products or services offered on Third-Party\nWebsites and you shall hold us blameless from any harm caused by your purchase of such products or services.\nAdditionally, you shall hold us blameless from any losses sustained by you or harm caused to you relating to or\nresulting in any way from any Third-Party Content or any contact with Third-Party Websites.","12-services-management#12. Services Management":"We reserve the right, but not the obligation, to: (1) monitor the Services for violations of these Legal Terms; (2) take\nappropriate legal action against anyone who, in our sole discretion, violates the law or these Legal Terms, including\nwithout limitation, reporting such user to law enforcement authorities; (3) in our sole discretion and without\nlimitation, refuse, restrict access to, limit the availability of, or disable (to the extent technologically feasible)\nany of your Contributions or any portion thereof; (4) in our sole discretion and without limitation, notice, or\nliability, to remove from the Services or otherwise disable all files and content that are excessive in size or are in\nany way burdensome to our systems; and (5) otherwise manage the Services in a manner designed to protect our rights and\nproperty and to facilitate the proper functioning of the Services.","13-privacy-policy#13. Privacy Policy":"We care about data privacy and security. Please review our Privacy\nPolicy: https://monetr.app/policy/privacy. By using the Services, you agree to\nbe bound by our Privacy Policy, which is incorporated into these Legal Terms. Please be advised the Services are hosted\nin the United States. If you access the Services from any other region of the world with laws or other requirements\ngoverning personal data collection, use, or disclosure that differ from applicable laws in the United States, then\nthrough your continued use of the Services, you are transferring your data to the United States, and you expressly\nconsent to have your data transferred to and processed in the United States. Further, we do not knowingly accept,\nrequest, or solicit information from children or knowingly market to children. Therefore, in accordance with the U.S.\nChildren’s Online Privacy Protection Act, if we receive actual knowledge that anyone under the age of 13 has provided\npersonal information to us without the requisite and verifiable parental consent, we will delete that information from\nthe Services as quickly as is reasonably practical.","14-copyright-infringements#14. Copyright Infringements":"We respect the intellectual property rights of others. If you believe that any material available on or through the\nServices infringes upon any copyright you own or control, please immediately notify us using the contact information\nprovided below (a \"Notification\"). A copy of your Notification will be sent to the person who posted or stored the\nmaterial addressed in the Notification. Please be advised that pursuant to applicable law you may be held liable for\ndamages if you make material misrepresentations in a Notification. Thus, if you are not sure that material located on or\nlinked to by the Services infringes your copyright, you should consider first contacting an attorney.","15-term-and-termination#15. Term And Termination":"These Legal Terms shall remain in full force and effect while you use the Services. WITHOUT LIMITING ANY OTHER PROVISION\nOF THESE LEGAL TERMS, WE RESERVE THE RIGHT TO, IN OUR SOLE DISCRETION AND WITHOUT NOTICE OR LIABILITY, DENY ACCESS TO\nAND USE OF THE SERVICES (INCLUDING BLOCKING CERTAIN IP ADDRESSES), TO ANY PERSON FOR ANY REASON OR FOR NO REASON,\nINCLUDING WITHOUT LIMITATION FOR BREACH OF ANY REPRESENTATION, WARRANTY, OR COVENANT CONTAINED IN THESE LEGAL TERMS OR\nOF ANY APPLICABLE LAW OR REGULATION. WE MAY TERMINATE YOUR USE OR PARTICIPATION IN THE SERVICES OR DELETE YOUR ACCOUNT\nAND ANY CONTENT OR INFORMATION THAT YOU POSTED AT ANY TIME, WITHOUT WARNING, IN OUR SOLE DISCRETION.If we terminate or suspend your account for any reason, you are prohibited from registering and creating a new account\nunder your name, a fake or borrowed name, or the name of any third party, even if you may be acting on behalf of the\nthird party. In addition to terminating or suspending your account, we reserve the right to take appropriate legal\naction, including without limitation pursuing civil, criminal, and injunctive redress.","16-modifications-and-interruptions#16. Modifications And Interruptions":"We reserve the right to change, modify, or remove the contents of the Services at any time or for any reason at our sole\ndiscretion without notice. However, we have no obligation to update any information on our Services. We will not be\nliable to you or any third party for any modification, price change, suspension, or discontinuance of the Services.We cannot guarantee the Services will be available at all times. We may experience hardware, software, or other problems\nor need to perform maintenance related to the Services, resulting in interruptions, delays, or errors. We reserve the\nright to change, revise, update, suspend, discontinue, or otherwise modify the Services at any time or for any reason\nwithout notice to you. You agree that we have no liability whatsoever for any loss, damage, or inconvenience caused by\nyour inability to access or use the Services during any downtime or discontinuance of the Services. Nothing in these\nLegal Terms will be construed to obligate us to maintain and support the Services or to supply any corrections, updates,\nor releases in connection therewith.","17-governing-law#17. Governing Law":"These Legal Terms and your use of the Services are governed by and construed in accordance with the laws of the State of\nMinnesota applicable to agreements made and to be entirely performed within the State of Minnesota, without regard to\nits conflict of law principles.","18-dispute-resolution#18. Dispute Resolution":"Informal NegotiationsTo expedite resolution and control the cost of any dispute, controversy, or claim related to these Legal Terms (each a\n\"Dispute\" and collectively, the \"Disputes\") brought by either you or us (individually, a \"Party\" and collectively, the\n\"Parties\"), the Parties agree to first attempt to negotiate any Dispute (except those Disputes expressly provided below)\ninformally for at least thirty (30) days before initiating arbitration. Such informal negotiations commence upon written\nnotice from one Party to the other Party.Binding ArbitrationIf the Parties are unable to resolve a Dispute through informal negotiations, the Dispute (except those Disputes\nexpressly excluded below) will be finally and exclusively resolved by binding arbitration. YOU UNDERSTAND THAT WITHOUT\nTHIS PROVISION, YOU WOULD HAVE THE RIGHT TO SUE IN COURT AND HAVE A JURY TRIAL. The arbitration shall be commenced and\nconducted under the Commercial Arbitration Rules of the American Arbitration Association (\"AAA\") and, where appropriate,\nthe AAA’s Supplementary Procedures for Consumer Related Disputes (\"AAA Consumer Rules\"), both of which are available at\nthe American Arbitration Association (AAA) website. Your arbitration fees and your share of\narbitrator compensation shall be governed by the AAA Consumer Rules and, where appropriate, limited by the AAA Consumer\nRules. If such costs are determined by the arbitrator to be excessive, we will pay all arbitration fees and expenses.\nThe arbitration may be conducted in person, through the submission of documents, by phone, or online. The arbitrator\nwill make a decision in writing, but need not provide a statement of reasons unless requested by either Party. The\narbitrator must follow applicable law, and any award may be challenged if the arbitrator fails to do so. Except where\notherwise required by the applicable AAA rules or applicable law, the arbitration will take place in Chisago County,\nMinnesota. Except as otherwise provided herein, the Parties may litigate in court to compel arbitration, stay\nproceedings pending arbitration, or to confirm, modify, vacate, or enter judgment on the award entered by the\narbitrator.If for any reason, a Dispute proceeds in court rather than arbitration, the Dispute shall be commenced or prosecuted in\nthe  state and federal courts located in Chisago County, Minnesota, and the Parties hereby consent to, and waive all\ndefenses of lack of personal jurisdiction, and forum non conveniens with respect to venue and jurisdiction in such state\nand federal courts. Application of the United Nations Convention on Contracts for the International Sale of Goods and\nthe Uniform Computer Information Transaction Act (UCITA) are excluded from these Legal Terms.In no event shall any Dispute brought by either Party related in any way to the Services be commenced more than one (1)\nyears after the cause of action arose. If this provision is found to be illegal or unenforceable, then neither Party\nwill elect to arbitrate any Dispute falling within that portion of this provision found to be illegal or unenforceable\nand such Dispute shall be decided by a court of competent jurisdiction within the courts listed for jurisdiction above,\nand the Parties agree to submit to the personal jurisdiction of that court.RestrictionsThe Parties agree that any arbitration shall be limited to the Dispute between the Parties individually. To the full\nextent permitted by law, (a) no arbitration shall be joined with any other proceeding; (b) there is no right or\nauthority for any Dispute to be arbitrated on a class-action basis or to utilize class action procedures; and (c) there\nis no right or authority for any Dispute to be brought in a purported representative capacity on behalf of the general\npublic or any other persons.Exceptions to Informal Negotiations and ArbitrationThe Parties agree that the following Disputes are not subject to the above provisions concerning informal negotiations\nbinding arbitration: (a) any Disputes seeking to enforce or protect, or concerning the validity of, any of the\nintellectual property rights of a Party; (b) any Dispute related to, or arising from, allegations of theft, piracy,\ninvasion of privacy, or unauthorized use; and (c) any claim for injunctive relief. If this provision is found to be\nillegal or unenforceable, then neither Party will elect to arbitrate any Dispute falling within that portion of this\nprovision found to be illegal or unenforceable and such Dispute shall be decided by a court of competent jurisdiction\nwithin the courts listed for jurisdiction above, and the Parties agree to submit to the personal jurisdiction of that\ncourt.","19-corrections#19. Corrections":"There may be information on the Services that contains typographical errors, inaccuracies, or omissions, including\ndescriptions, pricing, availability, and various other information. We reserve the right to correct any errors,\ninaccuracies, or omissions and to change or update the information on the Services at any time, without prior notice.","20-disclaimer#20. Disclaimer":"THE SERVICES ARE PROVIDED ON AN AS-IS AND AS-AVAILABLE BASIS. YOU AGREE THAT YOUR USE OF THE SERVICES WILL BE AT YOUR\nSOLE RISK. TO THE FULLEST EXTENT PERMITTED BY LAW, WE DISCLAIM ALL WARRANTIES, EXPRESS OR IMPLIED, IN CONNECTION WITH\nTHE SERVICES AND YOUR USE THEREOF, INCLUDING, WITHOUT LIMITATION, THE IMPLIED WARRANTIES OF MERCHANTABILITY, FITNESS FOR\nA PARTICULAR PURPOSE, AND NON-INFRINGEMENT. WE MAKE NO WARRANTIES OR REPRESENTATIONS ABOUT THE ACCURACY OR COMPLETENESS\nOF THE SERVICES' CONTENT OR THE CONTENT OF ANY WEBSITES OR MOBILE APPLICATIONS LINKED TO THE SERVICES AND WE WILL ASSUME\nNO LIABILITY OR RESPONSIBILITY FOR ANY (1) ERRORS, MISTAKES, OR INACCURACIES OF CONTENT AND MATERIALS, (2) PERSONAL\nINJURY OR PROPERTY DAMAGE, OF ANY NATURE WHATSOEVER, RESULTING FROM YOUR ACCESS TO AND USE OF THE SERVICES, (3) ANY\nUNAUTHORIZED ACCESS TO OR USE OF OUR SECURE SERVERS AND/OR ANY AND ALL PERSONAL INFORMATION AND/OR FINANCIAL INFORMATION\nSTORED THEREIN, (4) ANY INTERRUPTION OR CESSATION OF TRANSMISSION TO OR FROM THE SERVICES, (5) ANY BUGS, VIRUSES, TROJAN\nHORSES, OR THE LIKE WHICH MAY BE TRANSMITTED TO OR THROUGH THE SERVICES BY ANY THIRD PARTY, AND/OR (6) ANY ERRORS OR\nOMISSIONS IN ANY CONTENT AND MATERIALS OR FOR ANY LOSS OR DAMAGE OF ANY KIND INCURRED AS A RESULT OF THE USE OF ANY\nCONTENT POSTED, TRANSMITTED, OR OTHERWISE MADE AVAILABLE VIA THE SERVICES. WE DO NOT WARRANT, ENDORSE, GUARANTEE, OR\nASSUME RESPONSIBILITY FOR ANY PRODUCT OR SERVICE ADVERTISED OR OFFERED BY A THIRD PARTY THROUGH THE SERVICES, ANY\nHYPERLINKED WEBSITE, OR ANY WEBSITE OR MOBILE APPLICATION FEATURED IN ANY BANNER OR OTHER ADVERTISING, AND WE WILL NOT\nBE A PARTY TO OR IN ANY WAY BE RESPONSIBLE FOR MONITORING ANY TRANSACTION BETWEEN YOU AND ANY THIRD-PARTY PROVIDERS OF\nPRODUCTS OR SERVICES. AS WITH THE PURCHASE OF A PRODUCT OR SERVICE THROUGH ANY MEDIUM OR IN ANY ENVIRONMENT, YOU SHOULD\nUSE YOUR BEST JUDGMENT AND EXERCISE CAUTION WHERE APPROPRIATE.","21-limitations-of-liability#21. Limitations Of Liability":"IN NO EVENT WILL WE OR OUR DIRECTORS, EMPLOYEES, OR AGENTS BE LIABLE TO YOU OR ANY THIRD PARTY FOR ANY DIRECT, INDIRECT,\nCONSEQUENTIAL, EXEMPLARY, INCIDENTAL, SPECIAL, OR PUNITIVE DAMAGES, INCLUDING LOST PROFIT, LOST REVENUE, LOSS OF DATA,\nOR OTHER DAMAGES ARISING FROM YOUR USE OF THE SERVICES, EVEN IF WE HAVE BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.\nNOTWITHSTANDING ANYTHING TO THE CONTRARY CONTAINED HEREIN, OUR LIABILITY TO YOU FOR ANY CAUSE WHATSOEVER AND REGARDLESS\nOF THE FORM OF THE ACTION, WILL AT ALL TIMES BE LIMITED TO THE AMOUNT PAID, IF ANY, BY YOU TO US DURING THE FORTY EIGHT\n(48) MONTH PERIOD PRIOR TO ANY CAUSE OF ACTION ARISING. CERTAIN US STATE LAWS AND INTERNATIONAL LAWS DO NOT ALLOW\nLIMITATIONS ON IMPLIED WARRANTIES OR THE EXCLUSION OR LIMITATION OF CERTAIN DAMAGES. IF THESE LAWS APPLY TO YOU, SOME OR\nALL OF THE ABOVE DISCLAIMERS OR LIMITATIONS MAY NOT APPLY TO YOU, AND YOU MAY HAVE ADDITIONAL RIGHTS.","22-indemnification#22. Indemnification":"You agree to defend, indemnify, and hold us harmless, including our subsidiaries, affiliates, and all of our respective\nofficers, agents, partners, and employees, from and against any loss, damage, liability, claim, or demand, including\nreasonable attorneys’ fees and expenses, made by any third party due to or arising out of: (1) your Contributions; (2)\nyour use of the Services; (3) your breach of these Legal Terms; (4) any breach of your representations and warranties\nset forth in these Legal Terms; (5) your violation of the rights of a third party, including but not limited to\nintellectual property rights; or (6) any overt harmful act toward any other user of the Services with whom you connected\nvia the Services. Notwithstanding the foregoing, we reserve the right, at your expense, to assume the exclusive defense\nand control of any matter for which you are required to indemnify us, and you agree to cooperate, at your expense, with\nour defense of such claims. We will use reasonable efforts to notify you of any such claim, action, or proceeding which\nis subject to this indemnification upon becoming aware of it.","23-user-data#23. User Data":"We will maintain certain data that you transmit to the Services for the purpose of managing the performance of the\nServices, as well as data relating to your use of the Services. Although we perform regular routine backups of data, you\nare solely responsible for all data that you transmit or that relates to any activity you have undertaken using the\nServices. You agree that we shall have no liability to you for any loss or corruption of any such data, and you hereby\nwaive any right of action against us arising from any such loss or corruption of such data.","24-electronic-communications-transactions-and-signatures#24. Electronic Communications, Transactions, And Signatures":"Visiting the Services, sending us emails, and completing online forms constitute electronic communications. You consent\nto receive electronic communications, and you agree that all agreements, notices, disclosures, and other communications\nwe provide to you electronically, via email and on the Services, satisfy any legal requirement that such communication\nbe in writing. YOU HEREBY AGREE TO THE USE OF ELECTRONIC SIGNATURES, CONTRACTS, ORDERS, AND OTHER RECORDS, AND TO\nELECTRONIC DELIVERY OF NOTICES, POLICIES, AND RECORDS OF TRANSACTIONS INITIATED OR COMPLETED BY US OR VIA THE SERVICES.\nYou hereby waive any rights or requirements under any statutes, regulations, rules, ordinances, or other laws in any\njurisdiction which require an original signature or delivery or retention of non-electronic records, or to payments or\nthe granting of credits by any means other than electronic means.","25-california-users-and-residents#25. California Users And Residents":"If any complaint with us is not satisfactorily resolved, you can contact the Complaint Assistance Unit of the Division\nof Consumer Services of the California Department of Consumer Affairs in writing at 1625 North Market Blvd., Suite N\n112, Sacramento, California 95834 or by telephone at (800) 952-5210 or (916) 445-1254.","26-miscellaneous#26. Miscellaneous":"These Legal Terms and any policies or operating rules posted by us on the Services or in respect to the Services\nconstitute the entire agreement and understanding between you and us. Our failure to exercise or enforce any right or\nprovision of these Legal Terms shall not operate as a waiver of such right or provision. These Legal Terms operate to\nthe fullest extent permissible by law. We may assign any or all of our rights and obligations to others at any time. We\nshall not be responsible or liable for any loss, damage, delay, or failure to act caused by any cause beyond our\nreasonable control. If any provision or part of a provision of these Legal Terms is determined to be unlawful, void, or\nunenforceable, that provision or part of the provision is deemed severable from these Legal Terms and does not affect\nthe validity and enforceability of any remaining provisions. There is no joint venture, partnership, employment or\nagency relationship created between you and us as a result of these Legal Terms or use of the Services. You agree that\nthese Legal Terms will not be construed against us by virtue of having drafted them. You hereby waive any and all\ndefenses you may have based on the electronic form of these Legal Terms and the lack of signing by the parties hereto to\nexecute these Legal Terms.","27-contact-us#27. Contact Us":"In order to resolve a complaint regarding the Services or to receive further information regarding use of the Services,\nplease contact us at:Phone: (651) 243-0035Email: support@monetr.app"}},"/pricing":{"title":"Pricing","data":{}},"/documentation/configure/recaptcha":{"title":"ReCAPTCHA","data":{"":"ReCAPTCHA can be enabled on monetr to help prevent spamming certain endpoints in monetr's API. Specifically it is used\non the login, registration and forgot password endpoints. These endpoints are particularly sensitive, so a captcha can\nbe a good way to reduce spam.\nmonetr currently only supports version 2 of ReCAPTCHA. This feature is likely to be removed in a future release or\nmigrated to a non-Google captcha provider.\nName\tType\tDefault\tDescription\tenabled\tBoolean\tfalse\tEnable ReCAPTCHA for the server.\tpublicKey\tString\t\tThe public key string provided to you by ReCAPTCHA. This will also be provided to the UI at runtime.\tprivateKey\tString\t\tThe private key string provided to you by ReCAPTCHA. This is used only by the server to verify the captcha provided by clients.\tversion\tNumber\t2\tVersion of ReCAPTCHA to use. Only version 2 is supported.\tverifyLogin\tBoolean\tfalse\tRequire a valid captcha code for requests to /api/authentication/login.\tverifyRegister\tBoolean\tfalse\tRequire a valid captcha code for requests to /api/authentication/register.\tverifyForgotPassword\tBoolean\tfalse\tRequire a valid captcha code for requests to /api/authentication/forgot.\t\nThe following environment variables map to the following configuration file fields. Each field is documented below.\nVariable\tConfig File Field\tMONETR_CAPTCHA_ENABLED\treCAPTCHA.enabled\tMONETR_CAPTCHA_PUBLIC_KEY\treCAPTCHA.publicKey\tMONETR_CAPTCHA_PRIVATE_KEY\treCAPTCHA.privateKey\tMONETR_CAPTCHA_VERIFY_LOGIN\treCAPTCHA.verifyLogin\tMONETR_CAPTCHA_VERIFY_REGISTER\treCAPTCHA.verifyRegister\t\nNote: verifyForgotPassword cannot be configured via environment variables at this time."}},"/documentation/configure/sentry":{"title":"Sentry Configuration","data":{"":"monetr uses Sentry for error reporting and performance monitoring. But it\nsupports using a separate DSN for the frontend versus the backend. Or you can use the same DSN for both.\nName\tType\tDefault\tDescription\tenabled\tBoolean\tfalse\tEnable the Sentry integration with monetr, allowing you to gather debug information about your instance if you run into any issue.\tdsn\tString\t\tSpecify the DSN that the backend will use for its errors and performance traces. This DSN is never exposed publicly.\texternalDsn\tString\t\tSpecify the DSN that the frontend portion of monetr will use. Note: This DSN is publicly visible even without authentication as it is loaded into the index.html content served for the frontend with each request.\tsampleRate\tFloat\t1.0\tSpecify a sample rate for errors, 1.0 would be sampling every error where 0.0 would be sampling none of them.\ttraceSampleRate\tFloat\t1.0\tSpecify a sample rate for performance traces, 1.0 would be sampling every transaction span where 0.0 would be sampling none of them.\tsecurityHeaderEndpoint\tString\t\tSpecify a sentry URL to report CSP violations to. monetr enforces a strict CSP policy by default.\t\nThe following environment variables map to the following configuration file fields. Each field is documented below.\nVariable\tConfig File Field\tMONETR_SENTRY_ENABLED\tsentry.enabled\tMONETR_SENTRY_DSN\tsentry.dsn\tMONETR_SENTRY_EXTERNAL_DSN\tsentry.externalDsn\tMONETR_SENTRY_SAMPLE_RATE\tsentry.sampleRate\tMONETR_SENTRY_TRACE_SAMPLE_RATE\tsentry.traceSampleRate\tMONETR_SENTRY_CSP_ENDPOINT\tsentry.securityHeaderEndpoint"}}}