{"/about":{"title":"About","data":{}},"/blog":{"title":"Blog","data":{}},"/contact":{"title":"Contact monetr","data":{"":"Below are the preferred ways for contacting monetr staff.GitHub: github.com/monetr/monetrEmail: support@monetr.appDiscord: Join Discord ServerPhone: (651) 243-0035Mail:\nmonetr LLC\nPO Box 436\nLindstrom, MN 55045","note#Note":"The easiest way to get in contact with someone for support is via GitHub, Email or Discord. You are welcome to call\nour phone number, but at the moment we will not answer and would call you back at a later time.If your inquiry involves sensitive or personal information, please contact us directly via phone or email. Do not\ndisclose personal or sensitive information in any public channels."}},"/documentation/configure":{"title":"Configuration","data":{"":"Configure your monetr installation using the following guides. monetr offers many configuration options, make sure to\nread the documentation of each option thoroughly before customizing monetr.monetr is configured via a YAML file, typically located at /etc/monetr/config.yaml. This file allows many of the\nfeatures that monetr offers to be tweaked and adjusted for your use case, or for development.The root structure of this YAML file is:\nName\tType\tDefault\tDescription\tenvironment\tString\tdevelopment\tEnvironment name, used by the Sentry integration.\tallowSignUp\tBoolean\ttrue\tAre people allowed to create new users on the server?\t\nThe two values that are at the root level of the configuration can also be specified via the following environment\nvariables:\nVariable\tConfig File Field\tMONETR_ENVIRONMENT\tenvironment\tMONETR_ALLOW_SIGN_UP\tallowSignUp\t\nEach of the sub-configurations noted above are documented in more detail in the following guides:"}},"/documentation/configure/cors":{"title":"CORS","data":{"":"monetr generally is hosted on a single domain name and thus does not require CORS, however if your self hosting setup\nrequires that your monetr instance be accessible from another domain name then you must configure CORS.Below is an example of the CORS configuration block:\nName\tType\tDefault\tDescription\tallowedOrigins\tArray\t[]\tOther origins that are allowed to access your monetr server.\tdebug\tBoolean\tfalse\tDebug logging for helping diagnose CORS issues.\t\nThe following environment variables can be used to configure CORS options:\nVariable\tConfig File Field\tMONETR_CORS_ALLOWED_ORIGINS\tcors.allowedOrigins\tMONETR_CORS_DEBUG\tcors.debug"}},"/documentation/configure/email":{"title":"Email/SMTP Configuration","data":{"":"monetr supports sending email notifications (and email verification) if SMTP is configured. Currently emails can be sent\nwhen a user creates a new account, forgets their password, or changes their password.All email features require that enabled is set to true and a valid smtp config is provided. monetr does not\nsupport specific email APIs and has no plans to. Several email providers offer an SMTP relay, this is monetr's preferred\nmethod of sending emails as it is the most flexible.Below is an example of the email/SMTP configuration block:\nName\tType\tDefault\tDescription\tenabled\tBoolean\tfalse\tAre email notifications enabled on this server?\tdomain\tString\t\tEmail domain used to send emails, emails will always be sent from no-reply@{DOMAIN}.","email-verification-configuration#Email Verification Configuration":"If you want to require users to verify their email address when they create a new login on monetr, you can enable email\nverification. This will email users a link that they must click after creating their login, the link's lifetime can be\ncustomized if needed.An example of the email verification config:\nThe token lifetime is parsed using time.ParseDuration(...), any value that\ncan be parsed using that function is a valid configuration value.\nName\tType\tDefault\tDescription\tenabled\tBoolean\tfalse\tIs email verification enabled/required on this server?\ttokenLifetime\tDuration\t10m\tHow long should the link in the verification email be valid?","forgot-password-configuration#Forgot Password Configuration":"If you ever lose your password and need to reset it, the easiest way is by using the forgot password form. This will\nsend an email to the user (if a user with that email exists) that includes a link to reset their password. Similar to\nthe Email Verification Configuration, this also only requires an enabled and\ntokenLifetime value.Example of the forgot password configuration:\nName\tType\tDefault\tDescription\tenabled\tBoolean\tfalse\tAre users allowed to reset their password via forgot password?\ttokenLifetime\tDuration\t10m\tHow long should the password reset link be valid?","smtp-configuration#SMTP Configuration":"monetr only supports PLAIN SMTP authentication at this time. You can\nobtain all of the necessary details from your preferred email provider.\nmonetr's SMTP implementation requires TLS. Your email provider must support TLS on whatever port specified below."}},"/documentation/configure/kms":{"title":"Key Management","data":{"":"monetr supports encrypting secrets before they are stored in PostgreSQL. Other data may support encryption in the future\nbut at the moment only Plaid credentials are encrypted.To that end, monetr supports a few different providers. An outline of the configuration for key management:\nIf you are using the plaintext provider (which is the default), no additional options needs to be provided for the\nkey management configuration.\nIt is possible to migrate to another KMS provider using the monetr CLI, however this workflow is not documented at this\ntime. It is recommended you pick the key management provider you want to stick with initially and not change it.","plaintext#Plaintext":"When plaintext is specified as the provider, monetr will not encrypt any secrets and all items in the secrets table\nwill be stored in plain text. This is fine for self hosted deployments or development environments.","aws-kms-configuration#AWS KMS Configuration":"The AWS KMS will encrypt secrets using AWS's key management API. There is also an option to run a local version of AWS\nKMS for the local development environment for monetr.\nName\tType\tDefault\tDescription\tregion\tString\t\tThe AWS region to use for the client. May be required depending on your configuration.\taccessKey\tString\t\tThe Access Key that monetr should use to access the AWS KMS API.\tsecretKey\tString\t\tThe Secret Key that monetr should use to access the AWS KMS API.\tkeyID\tString\t\tThe actual Key ID in AWS, this must be the ID of the key to use for encryption and decryption and should not be changed. If this ID is changed then values encrypted with another key will not be able to be decrypted with this new key.\tendpoint\tString\tnull\tThe AWS KMS API endpoint, this is intended to be used only for local development environments.","google-cloud-kms-configuration#Google Cloud KMS Configuration":"Google Cloud KMS is also supported for encryption/decryption of secrets in monetr. It will require service account\ncredentials in the form of a JSON file. However if you are running monetr within Google Cloud, you can typically inject\nthe service account credentials directly into the VM or the GKE container. Documentation on obtaining credentials\nmagically via Google Cloud will not be provided here.\nName\tType\tDefault\tDescription\tresourceName\tString\t\tThe name of the actual keyring to use for encryption and decryption. This cannot be changed later as previously encrypted secrets cannot be decrypted with a different keyring.\tcredentialsJSON\tString\tnull\tIf you want to load credentials for your service account via a JSON file, specify the path to that file here. If left blank the Google Cloud SDK will look in default locations on the system for credentials.\t\nMore information on how credentials in Google Cloud can be found here: How Application Default Credentials\nworks","vault-transit-configuration#Vault Transit Configuration":"Hashicorp Vault is a self-hostable option for encryption. Vault keeps track of the\nencryption keys themselves while monetr leverages the\nTransit secrets engine to encrypt and decrypt data.When running inside Kubernetes, monetr can use the kubernetes authentication method to access Vault. When this is\nconfigured, monetr will automatically renew its Vault credentials a few moments before they expire. Other authentication\nmethods may require a non-expiring token such as the root token.\nName\tType\tDefault\tDescription\tkeyID\tString\t\tName of the transit mount to use for KMS.\tauthMethod\tString\t\tValid values are:- token: Use a hardcoded token to authenticate Vault.- kubernetes: Use the container's Kubernetes Service Account Token.- userpass: Provide a username and password.\ttoken\tString\t\tWhen using token authentication, you can provide the raw token here.\ttokenFile\tString\t\tAs an alternative to providing the token directly in the config file, specify a path to a file containing the token itself.\tusername\tString\t\tIf you are using userpass authentication, then this field and the password field must be specified.\tpassword\tString\t\tIf you are using userpass authentication, then this field and the username field must be specified.\trole\tString\t\tRole in Vault that monetr should authenticate for, decides what permissions monetr has.\tendpoint\tString\t\tThe URL that Vault API requests should be made to, should be the complete URL including protocol (https), as well as port if non-standard and path if the API is on a sub-route.\ttlsCertificatePath\tString\t\tPath to the TLS certificate file, used if Vault is being hosted with a self signed certificate.\ttlsKeyPath\tString\t\tPath to the TLS key file, used if Vault is being hosted with a self signed certificate.\ttlsCAPath\tString\t\tPath to the Certificate Authority file, used if Vault is being hosted with a self signed certificate.\tinsecureSkipVerify\tBoolean\tfalse\tWhen true, monetr will not verify the TLS certificate of the Vault server, less secure."}},"/documentation/configure/links":{"title":"Links Configuration","data":{"":"The links configuration is extremely simple, at the moment it only contains a single parameter.\nThe max number of links determines how many Plaid links an account can have configured at any given time. monetr does\nnot currently enforce a maximum number of manual links. If the value is set to 0 then no limit is enforced at all.\nIt is likely that this configuration option will be removed in the future, and will be superceded by a feature flag\nconfiguration instead. Allowing more flexibility with enforcing limits."}},"/documentation/configure/logging":{"title":"Logging Configuration","data":{"":"monetr uses logrus for all of its logging at this time. At the moment it supports\na text and JSON formatter. The text formatter will have colors enabled by default, unless an environment variable CI\nis provided with a non-empty value.\nThe default log level for monetr is info. Lower log levels can create a lot of noise, debug will log each HTTP\nrequest that the server handles, trace will log every SQL query that the application performs (except as part of\nbackground job processing).If you are running your application on Google Cloud, it is recommended to enable StackDriver logging, as it will adjust\nthe way some important fields are formatted (when the format is set to json) to match StackDriver's expected patterns.\nMore information on the StackDriver format is available here: Structured\nLogging."}},"/documentation/configure/postgres":{"title":"PostgreSQL Configuration","data":{}},"/documentation/configure/plaid":{"title":"Plaid Configuration","data":{"":"This guide shows you how to configure Plaid for your self hosted monetr instance. This will require Plaid credentials\nwhich can be obtained by following the Plaid Credentials Guide.\nName\tType\tDefault\tDescription\tenabled\tBoolean\ttrue\tAre users allowed to create Plaid links on this server? Even if this value is false, it is only considered enabled if the Client ID and Client Secret are also provided.\tclientId\tString\t\tYour Plaid Client ID obtained from your Plaid account.\tclientSecret\tString\t\tYour Plaid Client Secret obtained from your Plaid account.\tenvironment\tString\t\tPlaid environment URL, must match the environment of your Plaid credentials.\twebhooksEnabled\tBoolean\t\tIf you want to allow Plaid to send updates to monetr via webhooks.\twebhooksDomain\tString\t\tRequired if you want to receive webhooks from Plaid, must be an externally accessible domain name. Plaid also requires HTTPS for all webhooks. Only specify the domain name, not a full URL. Sub-routes are not supported here.\toauthDomain\tString\t\tDomain used for OAuth redirect URLs, does not necessarily need to be externally accessible, however must support HTTPS as Plaid will not redirect to a non-HTTPS URL. Only specify the domain name. Sub-routes are not supported.\t\nThe following environment variables map to the following configuration file fields. Each field is documented below.\nVariable\tConfig File Field\tMONETR_PLAID_CLIENT_ID\tplaid.clientId\tMONETR_PLAID_CLIENT_SECRET\tplaid.clientSecret\tMONETR_PLAID_ENVIRONMENT\tplaid.environment\tMONETR_PLAID_WEBHOOKS_ENABLED\tplaid.webhooksEnabled\tMONETR_PLAID_WEBHOOKS_DOMAIN\tplaid.webhooksDomain\tMONETR_PLAID_OAUTH_DOMAIN\tplaid.oauthDomain"}},"/documentation/configure/recaptcha":{"title":"ReCAPTCHA","data":{}},"/documentation/configure/redis":{"title":"Redis Configuration","data":{}},"/documentation/configure/security":{"title":"Security Configuration","data":{}},"/documentation/configure/sentry":{"title":"Sentry Configuration","data":{}},"/documentation/configure/server":{"title":"Server Configuration","data":{}},"/documentation/configure/storage":{"title":"Storage Configuration","data":{}},"/documentation/development":{"title":"Contributing","data":{"":"We want to make it as easy as possible for monetr users to become contributors. This documentation is still very much a\nwork in progress, but as time goes on it will hopefully become a helpful guide to building out features or fixing\nproblems within monetr."}},"/documentation/development/build":{"title":"Build","data":{"":"Building monetr locally using CMake.","general-requirements#General Requirements":"Node (>= 18.0.0)\nGo (>= 1.21.9)\ngit (>= 2.0.0)\nCMake (>= 3.23.0)\nGNUMake (>= 4.0)\ngcc (>= 12)\nmonetr will also create some binaries within the CMake binary directory, these binaries may be created by gem, npm\nor go install. These will not be installed on the host system itself, and are automatically removed when the source\ndirectory is cleaned.","linux#Linux":"If you want to do a release build of monetr on Linux, you will also need the following packages:\nruby-full\nlibssl-dev\npkg-config\nlocales-all\nThese are required in order for monetr to setup licensed. This tool is setup in\nthe CMake binary directory and is not installed on the host, but is installed via gem. The tool is used to generate\nmonetr's third party notice file that is embedded in it at build time. This file contains a list of all of the licenses\nof all of monetr's Go and JS dependencies.","building-monetr#Building monetr":"To build monetr you can simply run the following make command. This will run the CMake configuration and build steps\nnecessary to produce a binary at $PWD/build/monetr ($PWD/build/monetr.exe on Windows).","release-build#Release Build":"In order to produce a release build of monetr the following flag must be added.\nIn CI/CD, all builds are performed in release mode."}},"/documentation/development/code_of_conduct":{"title":"Contributor Covenant Code of Conduct","data":{"our-pledge#Our Pledge":"We as members, contributors, and leaders pledge to make participation in our community a harassment-free experience for\neveryone, regardless of age, body size, visible or invisible disability, ethnicity, sex characteristics, gender identity\nand expression, level of experience, education, socioeconomic status, nationality, personal appearance, race, religion,\nor sexual identity and orientation.We pledge to act and interact in ways that contribute to an open, welcoming, diverse, inclusive, and healthy community.","our-standards#Our Standards":"Examples of behavior that contributes to a positive environment for our community include:\nDemonstrating empathy and kindness toward other people\nBeing respectful of differing opinions, viewpoints, and experiences\nGiving and gracefully accepting constructive feedback\nAccepting responsibility and apologizing to those affected by our mistakes, and learning from the experience\nFocusing on what is best not just for us as individuals, but for the overall community\nExamples of unacceptable behavior include:\nThe use of sexualized language or imagery, and sexual attention or advances of any kind\nTrolling, insulting or derogatory comments, and personal or political attacks\nPublic or private harassment\nPublishing others' private information, such as a physical or email address, without their explicit permission\nOther conduct which could reasonably be considered inappropriate in a professional setting","enforcement-responsibilities#Enforcement Responsibilities":"Community leaders are responsible for clarifying and enforcing our standards of acceptable behavior and will take\nappropriate and fair corrective action in response to any behavior that they deem inappropriate, threatening, offensive,\nor harmful.Community leaders have the right and responsibility to remove, edit, or reject comments, commits, code, wiki edits,\nissues, and other contributions that are not aligned to this Code of Conduct, and will communicate reasons for\nmoderation decisions when appropriate.","scope#Scope":"This Code of Conduct applies within all community spaces, and also applies when an individual is officially representing\nthe community in public spaces. Examples of representing our community include using an official e-mail address, posting\nvia an official social media account, or acting as an appointed representative at an online or offline event.","enforcement#Enforcement":"Instances of abusive, harassing, or otherwise unacceptable behavior may be reported to the community leaders responsible\nfor enforcement at conduct@monetr.app. All complaints will be reviewed and investigated promptly and fairly.All community leaders are obligated to respect the privacy and security of the reporter of any incident.","enforcement-guidelines#Enforcement Guidelines":"Community leaders will follow these Community Impact Guidelines in determining the consequences for any action they deem\nin violation of this Code of Conduct:","1-correction#1. Correction":"Community Impact: Use of inappropriate language or other behavior deemed unprofessional or unwelcome in the\ncommunity.Consequence: A private, written warning from community leaders, providing clarity around the nature of the violation\nand an explanation of why the behavior was inappropriate. A public apology may be requested.","2-warning#2. Warning":"Community Impact: A violation through a single incident or series of actions.Consequence: A warning with consequences for continued behavior. No interaction with the people involved, including\nunsolicited interaction with those enforcing the Code of Conduct, for a specified period of time. This includes avoiding\ninteractions in community spaces as well as external channels like social media. Violating these terms may lead to a\ntemporary or permanent ban.","3-temporary-ban#3. Temporary Ban":"Community Impact: A serious violation of community standards, including sustained inappropriate behavior.Consequence: A temporary ban from any sort of interaction or public communication with the community for a specified\nperiod of time. No public or private interaction with the people involved, including unsolicited interaction with those\nenforcing the Code of Conduct, is allowed during this period. Violating these terms may lead to a permanent ban.","4-permanent-ban#4. Permanent Ban":"Community Impact: Demonstrating a pattern of violation of community standards, including sustained inappropriate\nbehavior, harassment of an individual, or aggression toward or disparagement of classes of individuals.Consequence: A permanent ban from any sort of public interaction within the community.","attribution#Attribution":"This Code of Conduct is adapted from the Contributor Covenant, version 2.0, available at\nhttps://www.contributor-covenant.org/version/2/0/code_of_conduct.html.Community Impact Guidelines were inspired\nby Mozilla's code of conduct enforcement ladder.For answers to common questions about this code of conduct, see the FAQ at\nhttps://www.contributor-covenant.org/faq. Translations are available at\nhttps://www.contributor-covenant.org/translations."}},"/documentation/development/credentials":{"title":"3rd Party API credentials for development","data":{"":"To work on all of the features monetr provides locally, you will need access to several sets of API credentials. These\ncredentials are outlines here in order of significance. monetr or people representing monetr will not provide any of\nthese credentials to you. You are responsible for gaining access to these credentials on your own. None of the\ncredentials require that you pay for them for development purposes.","plaid#Plaid":"Plaid credentials are required for local development at this time. Until manual accounts are fully supported, only\nlive bank accounts can be used for budgeting within monetr. It is recommended to use Sandbox credentials from Plaid for\nlocal development. The \"development\" credentials (as Plaid designates them) are for live bank accounts, however they can\nonly be used a limited number of times.\nStart by creating a Plaid account at: Plaid Sign Up\nFill out the form to the best of your abilities. Please do not use monetr for the company name.\nOnce you have created your Plaid account, you can find your credentials\nhere: Plaid Keys\nFor monetr you will need your client_id as well as your sandbox secret.Add your credentials to the file $HOME/.monetr/development.env:","oauth#OAuth":"TODO","ngrok#ngrok":"ngrok is used to test code for webhooks. It allows requests to be made to your local development instance from an\nexternal endpoint. You can use ngrok without an API key; however, the tunnels will only last a short amount of time, and\nthe external endpoint will change each time. This might cause difficulty if you plan on working on webhook related\nfeatures. It is recommended to sign up for the free plan of ngrok and use the API key they provide you.You can sign up for ngrok here: ngrok Sign UpAdd your token and desired ngrok domain to your development environment file:","stripe#Stripe":"If you want to work on billing related features, you can also provide Stripe credentials to the local development\nenvironment. It is required to provide ngrok credentials along-side Stripe for local development. You can sign up for a\nStripe account here: Stripe Sign UpYou will need two sets of keys to work with Stripe.\nA test mode Stripe secret key. (Not the public key)\nA webhook secret, configured for your ngrok endpoint and with the proper scopes selected.\nOnce you have made a Stripe account you can follow this guide to retrieve your keys.","secret-key#Secret key":"Navigate to your Stripe API Keys page within the dashboard. Make sure you\nare in\n\"Test mode\".You will need to click Reveal test key in order to retrieve the API key.","webhook-secret#Webhook secret":"On the Stripe Webhooks page click + Add endpoint.Enter your ngrok base URL here with the suffix: /api/stripe/webhookThen you can add events that you need to work with. At a minimum the following events should be added as monetr requires\nthem.\nOnce the webhook endpoint has been created click Reveal under Signing Secret to retrieve the secret for the webhook\nendpoint.","recaptcha#ReCAPTCHA":"TODO","sentry#Sentry":"TODO","smtp#SMTP":"TODO","google-cloud-kms#Google Cloud KMS":"Google Cloud KMS support is currently being added to improve the security of storing encrypted secrets in monetr.\nDocumentation to follow.TODO"}},"/documentation/development/documentation":{"title":"Documentation","data":{"":"This is an overview of ways to contribute to monetr's documentation. To get started:\nYou can find outstanding issues for documentation\nhere: \nIf you don't find an issue that you'd be interested in working on, you can still create a pull request with your\ndesired changes.\nIf you have found a gap in our documentation that you aren't able to, or do not wish to fill yourself; please create\nan issue so that others are aware of this gap, and it can be addressed.","editing-documentation#Editing documentation":"All of our documentation is in the form of Markdown files in the docs directory of the monetr repository. You can\nsimply edit the existing files to make changes to the documentation. The documentation site is automatically generated\nin our GitHub Actions workflows.","building-locally#Building Locally":"You can build our documentation site locally using the following command, it requires Node.js and will create a static\nsite in the $PWD/docs/out directory.","editing-locally#Editing Locally":"If you want to work on the documentation in real time locally you can run the following command:\nThis will start a Next.js server locally serving docs. As you edit files in the docs/ directory you will be able to\nsee those changes automatically refresh in your browser.","style#Style":"We would like our documentation to follow a general guide, this creates some consistency in how our documentation is\nboth written, presented, and maintained over time.","language#Language":"All documentation should be written in \"American\" English as much as possible. The exception to that rule are\nquotations, trademarks or terms that are better known by their own language's equivalent.","reader--author#Reader / Author":"The documentation prefers \"we\" to address the author and \"you\" to address the reader. The gender of the reader shall be\nneutral if possible. Attempt to use \"they\" as a pronoun for the reader.","code-blocks#Code Blocks":"Code blocks should always be accompanied by a preceding text to give context as to what that code block is, or\nrepresents. Adjacent code blocks without a paragraph of text between them should be avoided.","screenshots#Screenshots":"Screenshots, if at all possible, should be no larger than 1280x720. This is not a strict requirement, but if a\nscreenshot can reasonably capture all the necessary details in that resolution or less; that is greatly preferred.","issue-tracking#Issue Tracking":"If documentation is missing and is planned to be added later. Please add a placeholder badge for that documentation\nusing shields.io, with the GitHub issue/pull request detail shield.The \"override label\" should use the following format.\nPlease make the badge link back to the original issue as well.","inclusivity#Inclusivity":"Language that has been identified as hurtful or insensitive should be avoided."}},"/documentation/development/local_development":{"title":"Local Development","data":{"":"This guide walks you through setting up a local development environment for monetr on macOS or Linux. If you are using\nWindows, it is still possible to run the development environment locally. However, it is not documented at this time.","prerequisites#Prerequisites":"At the time of writing this, monetr requires Plaid credentials for development. Among other credentials, documentation\non how to retrieve them can be found here: Credentials","clone-the-repository#Clone the repository":"To get started, clone the monetr repository from GitHub or from your fork.\nThe rest of the commands in this guide are issued from this directory.","dependencies#Dependencies":"monetr does require a few tools to be installed locally in order to develop or build it. These tools are outlined below:","required#Required":"Node (>= 18.0.0)\nnpm (>= 8.0.0)\ngit (>= 2.0.0)\nGo (>= 1.21.9)\nCMake (>= 3.23.0)\nGNUMake (>= 4.0)\ngcc (>= 12)\nThe tools above are the minimum tools required in order to build and work on monetr locally. But if you intend to run\nthe complete development environment locally or if you plan on creating release builds of monetr you will also need:","optional#Optional":"Docker (>= 20.0.0): Docker (and Docker Compose) are used to run the local development environment for monetr,\nallowing you to have the entire application and all of it's features with hot-reloading.\nRuby (>= 2.7): Ruby is required to run licensed which is used to generate third-party-notice files, these show all\nof the dependencies of monetr and their licenses. This is embedded at build time for releases.","mac-specific#Mac Specific":"macOS can ship with a version of make that is outdated. It is recommended that you use brew or any other preferred\nmethod to install the most recent version of GNUMake on your Mac. This will not break anything that is already using\nmake, but will make sure that your version is compatible with the monetr Makefiles.For example; you should see something like this for your make version.","configuration--credentials#Configuration & Credentials":"At the moment monetr requires at least Plaid credentials in order to run properly, even for development. You can read\nmore about obtaining these credentials here: CredentialsThe makefile will look for these development credentials and some configuration options in the following path:\nYou can create the file manually like this:\nOnce you've opened this file you'll need to provide the Plaid Client ID as PLAID_CLIENT_ID and Plaid Client Secret as\nPLAID_CLIENT_SECRET here.Please do not store credentials in the project directory for monetr, it is much easier to accidentally commit secrets to\ngit when they are in your project directory. Keeping sensitive development credentials outside of the project makes it\nmuch harder to accidentally push them to a public repository.","cmake#CMake":"monetr uses CMake as the primary build system, it is also used for running the tasks for local development. If you want\nto use a custom CMake configuration you can create a CMakeUserPresets.json file in the project directory (it will be\nignored by Git) and populate it with the configuration variables you want to override. If you want to always use a\nspecific preset when running general make targets you can create a .cmakepreset file in the project directory. Inside\nthat file you can put the name of the preset you want to use by default. Or you can pass CMAKE_PRESET=... when running\na make target.\nCMAKE_PRESET is ignored for some make targets, such as release and test. As each of those targets have a\nspecific preset that they are expected to use.\nHere is a sample of a user presets file with a few customized options:\nThis config specifically changes the following options:\nMONETR_EMAIL_VERIFICATION_ENABLED: By setting this to true the developer is required to use the local SMTP server to\nverify their email address when creating a new user. Valid values are true or false.\nMONETR_KMS_PROVIDER: As configured, enables a local instance of Hashicorp Vault as\nwell as configures monetr to use Vault Transit for secret encryption and decryption. Valid values are plaintext,\naws or vault. Note: The AWS setting runs a local KMS service compatible with AWS KMS's API.\nMONETR_STORAGE_PROVIDER: A minio instance will be run as part of the local development stack. Valid values are s3\nor filesystem. When using filesystem uploaded files will be stored in your $PWD/build/development/storage\nfolder.\nMONETR_DEVELOPMENT_LITE_TARGET: When working on monetr's frontend only, specify an API server that you want to use\nfor the frontend to talk to. Requires an account on that API server.\nThere are other options here that will be documented later, as well as other options that have not been covered here at\nall, but those options are the primary ones that change the local development stack the most.","starting-it-up#Starting It Up":"With the above requirements installed. You should be able to spin up the local development environment that runs inside\nof Docker compose.This command will also load any of the environment variables specified in the development env file (mentioned above)\ninto the monetr container where the API is running.\nThis command may prompt you for an administrator password, this is because monetr is using mkcert and hostess to\nsetup TLS certificates as well as the monetr.local domain name in your /etc/hosts file.Disabling this will be available in the future, but has been required in order to integrate with Plaid's OAuth2 flow.\nThis will install node modules in the project's directory, as well as start up the containers needed for monetr to run\nlocally. This command will exit automatically once all the containers are healthy. If you want to follow along while it\nis starting up you can use the make logs command in another terminal inside the project directory.","certificate-problems#Certificate Problems":"If you run an issue where your browser is presenting a message like net::ERR_CERT_AUTHORITY_INVALID when trying to\nnavigate to https://my.monetr.local then please run the following commands in the monetr project directory.\nOn Linux you may also need to install libnss3-tools before running the mkcert install again.Once you restart your browser completely, this should correct the issue.","working#Working":"Congratulations, you should now have monetr running locally on your computer. The develop task will print out some\nbasic information for you. But if you missed it, you can access the development version of monetr at\nhttps://my.monetr.local.Almost all of monetr's code is setup to hot-reload as you make changes. The documentation, Go code and React UI will all\nautomatically reload as changes are made. Changes to the Go code will not invoke a browser refresh of any sort though,\nso to observe a new behavior in the API you will need to refresh or make the API call again.\nIf you want to disable hot reloading of the Go code, you can include DISABLE_GO_RELOAD=true in your env variables\nwhen you run make develop.","local-services#Local Services":"As part of the local development stack, several services are run to support monetr. These services include:\nminio As an S3 storage backend. The console is accessible via\nhttps://s3.monetr.local when the local environment is running.\nlocal-kms An AWS KMS compatible local development API. This is used for\nencrypting secrets in the local development environment.\nMailpit An SMTP server that allows emails to be sent without really sending\nthem. This is used to validate and test communication functionality locally. This service is accessible via\nhttps://mail.monetr.local when the local environment is running.\nVault Vault secret management and encryption, Transit is used by monetr for storing\nsecrets securely. Available at https://vault.monetr.local if you have Vault enabled in your user preset.","debugging#Debugging":"The monetr container running the API has delve included. If you prefer to work\nusing a step-debugger you can connect your editor to it. You will need to reconnect your editor each time it reloads,\nbut it is very easy to make your changes and then hit debug and let your breakpoints be hit.Delve is available via port 2345 on localhost. I'm not sure what the configuration will be for every editor to\nconnect to it; but this is a screenshot of IntellJ IDEA's configuration for remote debugging.","tests#Tests":"monetr requires a PostgreSQL instance to be available for Go tests to be run. At the moment there isn't a shorthand\nscript to provision this instance. But an easy way to do so is this:\nThis will start a PostgreSQL instance in Docker (or remove an existing one) and make it available on locahost:5432 as\nwell as not require authentication. This makes it easy for tests to target it.If tests are run via make then nothing more needs to be done. However, if you want to run tests directly from your\neditor or other tools you will need to run the database migrations.\nWill run all schema migrations on the PostgreSQL database on your localhost container.Tests can be run using the go test CLI, or all tests can be run using:","storybook#Storybook":"monetr now provides a storybook setup for working on UI components outside of running the entire application locally. To\nstart storybook you can run the following command.\nThis will kick off the storybook development server. You can make modifications to the stories locally or components\nused in stories and see the changes reflected with hot-reloading.To build the storybook as a static set of assets, you can run the following command:\nThis will output the storybook assets in $PWD/build/stories/dist","frontend#Frontend":"An alternative to running storybook to work on only the frontend components of monetr is to run a \"lite\" development\nenvironment. The lite environment only runs the frontend dev server and instead of requiring an active API server and\nadditional services to be running locally, you can instead point the frontend at a desired API server.To start the \"lite\" development environment run the following command:\nThis will run the UI dev server locally and the frontend will be available at http://localhost:3000. You can now make\nany desired changes to monetr's frontend without needing to run all of the services monetr relies on.This development mode defaults to monetr's staging environment (my.monetr.dev), which while it is publicly accessible;\nyou are not able to create new accounts on it at this time. If you want to change the API server that the lite\ndevelopment environment is using you can customize the domain name in your CMakeUserPresets.json file as noted above\nin the CMake section.\nBe extremely conscious about what actions you perform in the lite development environment, if you have your\ndevelopment environment pointed at the production instance for example; any actions you take locally will affect\nyour real account. Any data modified or deleted will not be recoverable.","documentation#Documentation":"monetr's documentation is built using Next.js and Nextra, it can be developed locally using the following command:\nThis will setup everything the documentation site needs and run the Next.JS development server locally, you can now make\nchanges to the documentation and see those changes reflected in your browser.Note: The \"hero\" or interface example on the documentation site's homepage does not work in development mode.In order to build the complete documentation site as it is hosted online you can run the follow command:\nThis will compile the documentation and output to $PWD/docs/out.If you want you can then run the entire site using the command: npx http-server docs/out -c-1.","emails#Emails":"monetr's email templates are generated using react-email. They can be found in\nthe emails/ directory in the project folder. These emails are compiled at build-time and include some go\ntemplating in their output in order to be useful for the server.In order to develop or make changes to the email templates and see your changes, you can run the following command:\nThis will start the react email development server, allowing you to preview the email templates in your browser with\nsome preset values (instead of the go template placeholders).","cleaning-up#Cleaning Up":"Once you have finished your work and you want to take the local development environment down you have a few options.","shutting-down-development-environment#Shutting Down Development Environment":"If you want to completely shut everything down then you can run the following command:\nThis will delete all of your local development data, including any Plaid links, expenses, goals, etc...\nThis removes the Plaid links that are active, takes down the Docker compose containers, removes their volumes.","completely-clean-up#Completely Clean up":"If you want to completely start fresh you can run the following make task. This will shut down the local development\nenvironment if it is running, but it will also delete any files created or generated during development. This deletes\nyour node_modules folder, any submodules, and generated UI code.\nThis should leave the project directory in a state similar to when it was initially cloned.Clean will not remove your CMakeUserPresets.json or .cmakepreset files.It is recommended to run make clean before performing a git pull when working from the main branch, this way changes\nin the build system or significant changes to project layout or the application will be applied properly."}},"/documentation":{"title":"Documentation","data":{"":"Welcome to the monetr documentation! Here, you’ll find everything you need to get started, whether you’re new to\nmonetr, looking to host it yourself, or contributing to its development.","what-is-monetr#What is monetr?":"monetr is a powerful web application designed to help you take control of your finances. It’s built around simplifying\nhow you manage recurring expenses like rent, subscriptions, or credit card payments. Beyond recurring expenses, monetr\nhelps you prepare for one-time goals—whether it’s saving for a big purchase or building a financial safety net.With monetr, budgeting becomes intuitive, ensuring you’re always ready for what’s next.","getting-started#Getting Started":"Ready to dive in? Explore the guides below to see how monetr can work for you:"}},"/documentation/install":{"title":"Self-Hosted Installation","data":{"":"monetr is completely free to self-host, giving you full control over your data and setup. This guide provides an\noverview of how to install and run monetr on your own infrastructure.","why-self-host-monetr#Why Self-Host monetr?":"Self-hosting monetr offers several advantages:\nCost-Free Usage: Run monetr without paying subscription fees.\nNote: If you use Plaid as a data provider, you may incur additional costs. See Plaid’s\nPricing for details.\nFull Data Ownership: Keep complete control over your financial data.\nWhether you’re interested in hosting your own applications or prefer a private alternative to hosted services,\nself-hosting gives you more control over your data and setup.","requirements-for-self-hosting#Requirements for Self-Hosting":"Before you begin, ensure you have the following:\nContainer Runtime: Docker Compose is the officially supported method for running monetr.\nServer or Host Machine:\nRecommended: A system with at least 512MB of RAM and 1GB of disk space.\nDatabase: monetr runs with PostgreSQL, which is included in the Docker Compose setup.\nDomain and SSL (Optional): For public access, consider setting up a domain with HTTPS.","installation-options#Installation Options":"Currently, monetr only officially supports container-based installations:","install-via-docker-compose#Install via Docker Compose":"The easiest way to self-host monetr is by using Docker Compose. This setup includes all necessary services, such as the\nmonetr application and PostgreSQL.","whats-next#What’s Next?":"After installing monetr, you can:\nConfigure it for your specific needs. See Configuration.\nExplore advanced hosting options like reverse proxies or custom domains.\nExplore available resources for feedback and support, including documentation updates and support channels.\nFor detailed steps, visit the full Docker Compose Installation Guide."}},"/documentation/install/docker":{"title":"Self-Host with Docker Compose","data":{"":"Self-hosting monetr via Docker Compose is the simplest and officially supported way to run monetr yourself. This guide\nassumes Docker is already installed on your system. If not, please refer to Docker's Installation\nGuide to set it up.monetr's container images are built with every tagged release and are available on both:\nDockerHub\nGitHub Container Registry (GHCR)\nImages from both registries are identical for the same version tag, so feel free to use your preferred registry.","image-tags#Image Tags":"Each monetr release provides two types of container image tags:","latest-tag#latest Tag":"The latest tag always points to the most recent version of monetr. For example:\nghcr.io/monetr/monetr:latest\nNote\nUsing the latest tag is convenient but can lead to unexpected behavior if updates introduce breaking changes.","versioned-tags#Versioned Tags":"Versioned tags, such as 0.18.31, refer to specific releases. For example:\nghcr.io/monetr/monetr:0.18.31Version tags are recommended for stability. By pinning a version, you can control updates and easily roll back if needed. monetr's version numbers use a v prefix (e.g., v0.18.31), but container tags omit this prefix.","docker-compose#Docker Compose":"The easiest way to start monetr is to use the provided\ndocker-compose.yaml located in the project's root\ndirectory.","clone-the-repository#Clone The Repository":"To get the compose file, first clone the monetr repository:","start-the-server#Start The Server":"To run monetr, execute the following command in your terminal from the root directory of monetr's repository.\nThis will start the monetr server, as well as the database it needs and a redis server.","open-monetr#Open monetr":"Once monetr is finished starting, you should be able to access it in your browser via http://localhost:4000.\nSign ups are enabled by default from the docker-compose.yaml provided. If you are exposing your monetr instance to\nthe public internet; it is recommended you disable sign ups after you have created your own login.","updating-via-docker-compose#Updating Via Docker Compose":"If you are already running monetr and want to upgrade to a more recent version you can perform the following steps.Please make sure to review the release notes for monetr before upgrading, as it will include any breaking changes you\nshould be aware of.","update-the-repository#Update The Repository":"In your cloned monetr directory, run the following command to retrieve the latest changes.\nIf you encounter a conflict while performing the pull, this means that some changes you may have made locally might\ncause problems with the latest version of monetr. Make sure to resolve these conflicts before moving onto the next step.","stop-the-containers#Stop The Containers":"You'll need to stop the containers running before upgrading to make sure there are not conflicts.","pull-new-images#Pull New Images":"Once the containers have stopped you can run the following command to update the monetr image:","start-monetr-again#Start monetr Again":"Once the new images have been pulled onto your local machine you can restart the server via docker compose:\nThings like database migrations are automatically run when using the provided compose file.","troubleshooting#Troubleshooting":"If you encounter issues while setting up or running monetr, here are some common problems and their solutions:","containers-wont-start#Containers Won’t Start":"If the containers fail to start or exit immediately:\nCheck the logs using:","cannot-access-monetr-in-the-browser#Cannot Access monetr in the Browser":"If http://localhost:4000 doesn’t load:Verify the containers are running using:\nEnsure no other services are using port 4000. Modify the docker-compose.yaml file to use a different port if needed.\nCheck firewall or network settings on your machine.","update-issues-after-pulling-new-images#Update Issues After Pulling New Images":"If monetr doesn't work correctly after an update:\nCheck for breaking changes in the Release Notes\nRun\nThis should recreate the containers for monetr without deleting any data on the volumes.","need-more-help#Need More Help?":"If these solutions don't resolve your issue:\nCheck the monetr GitHub Issues for similar problems.\nCreate a new issue with detailed logs and steps to reproduce the problem.\nReach out for assistance on Discord."}},"/documentation/use":{"title":"Using monetr","data":{"":"Whether you’re just starting out or looking to maximize your financial planning with monetr, the guides below will help you make the most of the platform."}},"/documentation/use/billing":{"title":"Billing","data":{"":"monetr is a paid product for the hosted version. However, if you'd prefer, you can host monetr yourself for free\n(see Self-Hosting).","trial-period#Trial Period":"monetr offers a 30-day free trial to let you explore all its features. During the trial:\nNo credit card is required.\nYou'll have access to all features, but are limited to a single Plaid connection.\nAfter 30 days, your trial will expire, and you'll need to subscribe to continue using monetr.\nWe’ll email you a few days before your trial expires. If you decide not to continue, no action is required.","what-happens-when-my-trial-ends#What happens when my trial ends?":"You can still log in, but you’ll be prompted to subscribe before using the application.\nAfter 90 days, any active Plaid connections will be deactivated.","subscribe-to-monetr#Subscribe to monetr":"When your trial expires, subscribing is simple:\nLog in to your account.\nClick the Continue button when prompted to subscribe.\nYou’ll be redirected to our billing portal hosted by Stripe to enter your payment details and\nconfirm your subscription.","billing-details#Billing Details":"Subscriptions are billed monthly. See more details on our Pricing page.\nBilling begins immediately after subscribing.\nYou can manage your subscription, update payment methods, or view past invoices by clicking on the\n icon in the sidebar or selecting Manage Your Subscription from the billing page\nunder settings.\nThe billing settings page:The Stripe hosted billing management page:","canceling-your-subscription#Canceling Your Subscription":"You can cancel your subscription at any time:\nClick the  icon in the sidebar or select Manage Your Subscription from the\nbilling page under settings.\nIn the Stripe billing portal, click Cancel subscription.\nConfirm your cancellation.","what-happens-when-i-cancel#What happens when I cancel?":"You'll retain access until the end of your current billing cycle.\nYour data will remain accessible for 90 days after cancellation. During this period, you can resubscribe without\nlosing your data."}},"/documentation/use/expense":{"title":"Expenses","data":{"what-are-expenses#What Are Expenses":"Expenses are how monetr helps you manage recurring financial obligations, such as rent, car payments, or\nsubscriptions. The platform tracks how much money is required for each expense and when it’s due. Using Funding\nSchedules, monetr automatically sets aside a portion of the expense from each paycheck. This\napproach ensures that you don’t need to cover the full amount from a single paycheck. As a result, your\nFree-To-Use funds should remain consistent with every paycheck.This approach is similar to envelope budgeting, where funds are allocated to specific categories to ensure they’re\navailable for designated expenses. Like envelope budgeting, monetr helps you plan ahead and manage your cash flow\neffectively. However, monetr automates the process by calculating how much to set aside based on your paycheck schedule\nand expense deadlines.It’s best to create a separate expense entry for each recurring obligation. For example, setting up a monthly expense\nfor rent due on the first of the month ensures you’ll always have enough funds available to pay it on time. However,\nexpenses are less suitable for irregular costs, such as dining out or saving for large, infrequent purchases.Each expense is tied to an individual bank account. If a regular expense is paid from multiple accounts, create separate\nexpense entries in monetr for each account. Assign the appropriate amount to each entry based on how much each account\ncontributes to that expense.\nLooking for something else?\nIf you're trying to save for a one-time financial target or track contributions toward a larger goal, consider using\nmonetr's Goals feature instead. Goals are ideal for managing non-recurring targets like vacations, down\npayments, or paying off loans, and they provide more flexibility in tracking usage over time.","create-an-expense#Create an Expense":"To create an expense, navigate to the expense view for your current account by clicking Expenses in the sidebar.Then, click New Expense in the top navigation to open the creation modal.","how-much-do-you-need#How Much Do You Need?":"monetr needs to know the amount required for the expense. If the amount varies (e.g., utility bills), set it to the\nhighest expected amount within reason. For example, you might set a utility bill to its seasonal peak. You can adjust\nthe amount as needed, and any surplus funds will reduce the contribution required from future paychecks.","when-do-you-need-it-next#When Do You Need It Next?":"monetr needs the next due date for the expense. This date determines how the expense repeats going forward. You can\nupdate it later if necessary.If the expense’s due date varies, select a date a few days before it’s typically due. This ensures funds are available\nin advance. Contributions will still align with your funding schedule.","how-do-you-want-to-fund-it#How Do You Want to Fund It?":"If you haven’t already created a Funding Schedule, you’ll be prompted to do so here. Otherwise,\nselect an existing schedule to match how you want to contribute. For example, if your funding schedule aligns with your\npaychecks, you’ll contribute a portion of the expense each payday.","how-frequently-do-you-need-this-expense#How Frequently Do You Need This Expense?":"Choose how often the expense occurs. monetr will repeat the expense on this frequency and ensure funds are set aside\nbefore the due date.Supported frequencies include:\nWeekly\nEvery other week\nMonthly\nEvery other month\nEvery third month (quarterly)\nEvery six months\nYearly\nIf the date selected in When Do You Need It Next? is the 1st, 15th, or last day of the\nmonth, these additional options are available:\n1st and 15th of every month\n15th and last day of every month","how-expenses-help#How Expenses Help":"After creating expenses, monetr calculates contributions based on your funding schedule. For example, if you’re paid\ntwice a month, half the amount will be set aside each paycheck to balance contributions.In the expenses overview, you’ll see:\nThe next due date (e.g., December 30th in the screenshot above).\nHow frequently the expense occurs (e.g., monthly on the 30th).\nThe amount to be contributed next paycheck.\nThe current amount set aside for the expense (e.g., $0.00 in this example).","expense-details#Expense Details":"Click on an individual expense to view more details.This page provides all the information available in the list view and allows you to modify the expense if needed. You\ncan also Transfer funds to adjust the amount set aside for the expense\nmanually.\nWhen you remove an expense, any funds set aside for it are returned to your Free-To-Use amount.","expense-timeline#Expense Timeline":"Each expense includes a timeline showing predicted contributions and expected usage. This helps you track when funds\nwill be allocated and when the expense is due."}},"/documentation/use/free_to_use":{"title":"Free-To-Use","data":{"what-is-free-to-use#What is Free-To-Use":"","transfer-allocating-funds#Transfer (Allocating Funds)":""}},"/documentation/use/funding_schedule":{"title":"Funding Schedules","data":{"what-are-funding-schedules#What Are Funding Schedules":"Funding schedules let monetr know when to allocate funds for your budgets. Think of funding schedules as \"when do\nyou get paid.\" Allocating funds each time you get paid ensures that your Free-To-Use funds remain\npredictable and consistent.You can create multiple funding schedules if needed, such as putting money aside weekly or only once a month. Every\nExpense or Goal you create must be tied to a funding schedule.Funding schedules are unique to each bank account, not to the entire bank connection. For example, if you have both a\nchecking and savings account at the same bank, you may want separate funding schedules for each account. You can create\nmultiple funding schedules per account, but each must have a unique name within the account.This flexibility allows, for instance, a primary funding schedule for your checking account, covering most of your\npaycheck, and a secondary schedule for your savings account, allocating leftover funds.","create-a-funding-schedule#Create a Funding Schedule":"To create a funding schedule, navigate to the funding view of your current account by clicking Funding Schedules in\nthe sidebar.Then, click New Funding Schedule in the top navigation to open the creation modal.","when-do-you-get-paid-next#When Do You Get Paid Next?":"This date acts as a baseline for the funding schedule's recurrence. It influences the options available in the How\nOften Do You Get Paid? dropdown.For example, if you’re paid every two weeks on Friday, select the next Friday you’ll be paid.","how-often-do-you-get-paid#How Often Do You Get Paid?":"monetr supports the following recurring patterns:\nWeekly\nEvery other week\nMonthly\nEvery other month\nEvery third month (quarterly)\nEvery six months\nYearly\nIf the date chosen in When Do You Get Paid Next? is the 1st, 15th, or last day of the\nmonth, these additional options are available:\n1st and 15th of every month\n15th and last day of every month","additional-options#Additional Options":"Funding schedules offer two optional features for a more tailored budgeting experience. These options are visible on the\nfunding schedule’s details page.","excluding-weekends#Excluding Weekends":"If you get paid on the 1st and 15th, or 15th and last day of the month, your paycheck may arrive earlier when the date\nfalls on a weekend. Deposits aren’t typically processed on weekends or holidays. To align your funding schedule with\nwhen funds are likely deposited, enable Exclude Weekends in the details page.When enabled, if the next scheduled funding date falls on a Saturday or Sunday, it will adjust to the previous weekday.\n Holidays are not yet accounted for, but this feature will be added in the future, particularly for\nbank holidays that impact deposits.","estimated-deposit#Estimated Deposit":"Providing an estimated deposit amount helps monetr’s forecasting tools. This allows you to:\nAnticipate how much will be set aside from each paycheck.\nSee an estimate of your Free-To-Use funds after budgeting.","estimated-contribution#Estimated Contribution":"Once you’ve linked Expenses or Goals to a funding schedule, monetr calculates an \"Estimated\nContribution\" displayed on the funding schedule page. This value represents how much monetr expects to allocate toward\nyour budgets on the next funding date.Ensure the estimated contribution is less than your expected deposit. If it exceeds your deposit, you may not have\nenough funds to cover all expenses.","funding-timeline#Funding Timeline":"As you create more Expenses and Goals, the funding schedule provides insights into upcoming\nfunding events.This timeline shows:\nHow much money is expected to be allocated each time you’re paid.\nIf you’ve specified an Estimated Deposit, it also shows the leftover amount after accommodating\nyour budgets."}},"/documentation/use/getting_started":{"title":"Getting Started","data":{"":"Welcome to monetr! This guide will walk you through the initial steps to set up your account and start managing your\nfinances. You can choose to connect your bank account via our partner Plaid for automated updates,\nor create a manual budget for full control over your data, including the option to upload transactions via a file.monetr refers to these connections as \"links\"—a link between monetr and your bank or a \"manual link\" for self-managed\nbudgets. The table below highlights the differences between Plaid links and manual links:\nFeature\tPlaid\tManual\tAutomated Updates\tYes\tNo\tCreate Custom Transactions\tNo\tYes\tEdit Transaction Details\t(Only Names)\tYes\tImport Data From File\tNo\tYes\t\nThese features may evolve over time as monetr approaches its v1.0 release.","link-accounts#Link Accounts":"Using Plaid is the simplest way to manage your finances in monetr. Plaid securely connects to your bank and imports\ntransaction and balance data automatically.\nmonetr uses Plaid to provide read-only access to your banking data. This ensures your security—monetr cannot\nmove funds in your account. The imported data is exclusively used to create and maintain your budget.For more details, review our Privacy Policy.\nTo get started with Plaid:\nSelect Plaid and click Continue.\nFollow the on-screen instructions in the Plaid interface to authenticate your bank accounts.\nOnce complete, you’ll be redirected to the accounts page in monetr to begin creating your budget.\nTip: Connect monetr to the bank account you use most frequently for spending. If you use multiple accounts, you can\nconnect them later.","manual-accounts#Manual Accounts":"Prefer to manage your finances manually? monetr provides an easy-to-follow process for setting up a manual budget.To create a manual budget:\nSelect Manual and click Continue.\nFollow the steps below to configure your manual budget.","name-your-budget#Name Your Budget":"Give your manual budget a name. This could be the name of your bank or a custom label.","create-your-first-account#Create Your First Account":"Set up an account within your budget. This account should correspond directly to a real checking or savings account for\nclarity and simplicity.","set-a-starting-balance#Set a Starting Balance":"(Optional) Enter the current or starting balance for the account.\nIf you import data via file upload later, this balance will be overwritten.","create-an-initial-funding-schedule#Create an Initial Funding Schedule":"To maximize monetr’s functionality, set up a funding schedule for your manual budget. This determines how frequently\nfunds will be contributed to your budgets. You can modify or delete this later.","finishing-up#Finishing Up":"Click Finish to complete your setup. You’ll be redirected to your budget’s page, ready to start managing your\nfinances!"}},"/documentation/use/goal":{"title":"Goals","data":{"what-are-goals#What Are Goals?":"Goals in monetr are designed to help you save for one-off financial targets or manage payments toward larger\nobligations. Examples include:\nSaving for a down payment on a house.\nPaying off a loan or buy-now-pay-later balance.\nSetting aside money for a vacation or large purchase.\nUnlike recurring expenses, goals track both contributions and usage. This ensures you always know how much has been\nspent and how much remains allocated, while keeping your contribution schedule consistent.\nNeed to manage recurring payments?\nIf you're tracking regular expenses like rent, subscriptions, or utility bills, monetr's Expenses\nfeature is designed for that purpose. Expenses are ideal for consistent obligations that repeat on a predictable\nschedule.","example-how-goals-track-usage#Example: How Goals Track Usage":"Let’s say you create a goal to save $1,000 by the end of the year. You’ve contributed $100 so far, but you spend $50\nfrom the goal:\nmonetr knows $50 has been spent, leaving $50 still allocated.\nFuture contributions remain unchanged, as monetr tracks that $900 is still needed to meet the target.\nThis approach avoids over-funding and ensures contributions align with the goal’s timeline.","how-goals-differ-from-expenses#How Goals Differ from Expenses":"Although you can spend from both goals and expenses, their behavior differs significantly:\nGoals:\nTrack usage versus allocation.\nContributions remain consistent because monetr understands how much has already been used.\nIdeal for saving toward a specific target or managing payments over time.\nExpenses:\nDo not track usage.\nContributions dynamically adjust to cover what is assumed to be required (e.g., if funds are spent).\nBest for recurring obligations where usage tracking isn’t necessary.\nThis distinction makes goals better suited for long-term planning and flexible spending, while expenses excel at\nmanaging regular, predictable payments.","flexible-spending-with-goals#Flexible Spending with Goals":"A unique feature of goals is the ability to spend from them even before they are fully funded. For example:\nSuppose you set up a $1,000 goal to pay off a loan with monthly payments. You can mark each payment as Spent\nFrom the goal. monetr will keep track of these transactions and ensure the total contributions still\nmeet the $1,000 target by the due date.\nThis makes goals a versatile tool, whether you’re saving for the future or managing payments toward a larger financial\ntarget, while avoiding the risk of over-funding.","creating-a-goal#Creating a Goal":"To create a goal, navigate to the Goals section in the sidebar of your current account.Then, click New Goal in the top navigation to open the creation modal.","how-much-do-you-need#How Much Do You Need?":"Enter the total amount you need for the goal. monetr will allocate funds up to this amount by the due date.","how-soon-will-you-need-it#How Soon Will You Need It?":"Set a single due date for the goal. monetr uses this to calculate contributions, ensuring the goal is fully funded by\nthat date.","when-do-you-want-to-fund-the-goal#When Do You Want to Fund the Goal?":"Choose a Funding Schedule to determine how contributions will be made. If you don’t already have\none, you’ll be prompted to create a schedule during this step.","how-goals-help#How Goals Help":"Once your goal is created, monetr automatically calculates contributions based on your funding schedule. Goals provide:\nA way to save for the future with structured contributions.\nA method to track spending for specific purposes, such as loan payments or planned purchases.\nVisibility into progress, showing how much has been contributed and how much is left.\nIn the goals overview, you’ll see:\nThe goal’s due date.\nIts status: paused, active, or complete.\nThe amount to be contributed at the next funding event.\nThe current amount allocated, available for spending.\nThe goal’s total target amount, excluding what has already been spent.","goal-details#Goal Details":"Click on a goal to view detailed information.From the details page, you can:\nModify the goal if your plans change.\nTransfer funds to adjust the amount allocated.\nPause the goal to temporarily stop contributions.","pausing-and-resuming-goals#Pausing and Resuming Goals":"When a goal is paused:\nNo contributions are made toward it.\nThe timeline and calculations are frozen.\nWhen you resume the goal:\nmonetr recalculates the remaining contributions to ensure the target is met by the due date.\nIf you remove a goal, any funds allocated to it are returned to your Free-To-Use balance.","goal-timeline#Goal Timeline":"Every goal includes a timeline that visualizes contributions over time. This timeline:\nShows planned contributions up to the due date.\nDoes not predict spending since goals are designed to be flexible and less structured than expenses.\nIf a goal is paused, displays the current amount allocated and today’s date only."}},"/documentation/use/security/user_password":{"title":"User Password","data":{"":"monetr requires users authenticate using an email and a password. A password that is weak or easy to guess makes it\neasier for unauthorized people to sign in to your account.","change-your-password#Change your password":"You can change your password one of two ways. If you have access to your login you can click the Gear icon in the\nsidebar and then navigate to the Security tab within your settings. Or you can access the page here: Security\nSettings.There will be a few cards on this page, clicking Change Password button on the first card will open a dialog\nallowing you to update your password.Once you have updated your password monetr will send a confirmation email to your login's email address. You do not need\nto reply or do anything with this email, it is intended to notify users of unauthorized activity in the event that their\naccount may have been compromised.","forgot-password#Forgot password":"If you do not have access to your login, or have forgotten your password; you can still reset your password as long as\nyou have access to the email address that is associated with your login.Navigate to the Forgot Password page. Here you can provide the email address\nassociated with your login.Once you submit the form we will send you an email with a link that can be used to reset your password. Click the link\nin the email to proceed. If you do not receive the email make sure to check your spam or junk folder, otherwise please\nreach out to support for help.Once you open the link in the email, you will be prompted to provide a new password as well as to repeat it to help\nprevent any typos. Once submitted you will receive a confirmation email that your password was changed, and you should\nnow be able to login to your account with your new credentials.\nOn self-hosted instances of monetr, resetting your password via forgot password requires that the server has SMTP\nconfigured and forgot password enabled. There is an issue to track the feature of allowing passwords to be reset via\nthe monetr CLI for self hosted instances:"}},"/documentation/use/transactions":{"title":"Transactions","data":{}},"/documentation/use/transactions/uploads":{"title":"Transaction File Uploads","data":{}},"/":{"title":"monetr: Take Control of Your Finances","data":{}},"/policy/privacy":{"title":"Privacy Policy","data":{"":"Protecting your private information is our priority. This Statement of Privacy applies to monetr, and\nmonetr LLC and governs data collection and usage. For the purposes of this Privacy Policy, unless\notherwise noted, all references to monetr LLC include https://monetr.app and monetr. The monetr\napplication is a budgeting and expense planning application. By using the monetr application, you\nconsent to the data practices described in this statement.","collection-of-your-personal-information#Collection of your Personal Information":"In order to better provide you with products and services offered, monetr may collect personally\nidentifiable information, such as your:\nFirst and Last Name\nE-mail Address\nIf you purchase monetr's products and services, we collect billing and credit card information. This\ninformation is used to complete the purchase transaction.We do not collect any personal information about you unless you voluntarily provide it to us.\nHowever, you may be required to provide certain personal information to us when you elect to use\ncertain products or services. These may include: (a) registering for an account; (b) signing up for\nspecial offers from selected third parties; (c) sending us an email message; (d) submitting your\ncredit card or other payment information when ordering and purchasing products and services. To wit,\nwe will use your information for, but not limited to, communicating with you in relation to services\nand/or products you have requested from us. We also may gather additional personal or non-personal\ninformation in the future.","use-of-your-personal-information#Use of your Personal Information":"monetr collects and uses your personal information to operate and deliver the services you have\nrequested.monetr may also use your personally identifiable information to inform you of other products or\nservices available from monetr and its affiliates.","sharing-information-with-third-parties#Sharing Information with Third Parties":"monetr does not sell, rent or lease its customer lists to third parties.monetr may share data with trusted partners to help perform statistical analysis, send you email, or\nprovide customer support. All such third parties are prohibited from using your personal information\nexcept to provide these services to monetr, and they are required to maintain the confidentiality of\nyour information.monetr may disclose your personal information, without notice, if required to do so by law or in the\ngood faith belief that such action is necessary to: (a) conform to the edicts of the law or comply\nwith legal process served on monetr or the site; (b) protect and defend the rights or property of\nmonetr; and/or (c) act under exigent circumstances to protect the personal safety of users of\nmonetr, or the public.","right-to-deletion#Right to Deletion":"Subject to certain exceptions set out below, on receipt of a verifiable request from you, we will:\nDelete your personal information from our records; and\nDirect any service providers to delete your personal information from their records.\nPlease note that we may not be able to comply with requests to delete your personal information if\nit is necessary to:\nComplete the transaction for which the personal information was collected, fulfill the\nterms of a written warranty or product recall conducted in accordance with federal\nlaw, provide a good or service requested by you, or reasonably anticipated within the\ncontext of our ongoing business relationship with you, or otherwise perform a contract\nbetween you and us;\nDetect security incidents, protect against malicious, deceptive, fraudulent, or illegal\nactivity; or prosecute those responsible for that activity;\nDebug to identify and repair errors that impair existing intended functionality;\nExercise free speech, ensure the right of another consumer to exercise his or her right\nof free speech, or exercise another right provided for by law;\nComply with the California Electronic Communications Privacy Act;\nEngage in public or peer-reviewed scientific, historical, or statistical research in the\npublic interest that adheres to all other applicable ethics and privacy laws, when our\ndeletion of the information is likely to render impossible or seriously impair the\nachievement of such research, provided we have obtained your informed consent;\nEnable solely internal uses that are reasonably aligned with your expectations based on\nyour relationship with us;\nComply with an existing legal obligation; or\nOtherwise use your personal information, internally, in a lawful manner that is\ncompatible with the context in which you provided the information.","children-under-thirteen#Children Under Thirteen":"monetr does not knowingly collect personally identifiable information from children under the age\nof thirteen. If you are under the age of thirteen, you must ask your parent or guardian for\npermission to use this application.","disconnecting-your-monetr-account-from-third-party-websites#Disconnecting your monetr Account from Third Party Websites":"You will be able to connect your monetr account to third party accounts. BY CONNECTING\nYOUR MONETR ACCOUNT TO YOUR THIRD PARTY ACCOUNT, YOU\nACKNOWLEDGE AND AGREE THAT YOU ARE CONSENTING TO THE\nCONTINUOUS RELEASE OF INFORMATION ABOUT YOU TO OTHERS (IN\nACCORDANCE WITH YOUR PRIVACY SETTINGS ON THOSE THIRD PARTY SITES).IF YOU DO NOT WANT INFORMATION ABOUT YOU, INCLUDING PERSONALLY\nIDENTIFYING INFORMATION, TO BE SHARED IN THIS MANNER, DO NOT USETHIS FEATURE. You may disconnect your account from a third party account at any time.\nUser's connect monetr to their bank account's via a third party service called Plaid. You can\ndisconnect your bank account from monetr in the \"View Bank Accounts\" menu. Alternatively, you\ncan revoke monetr's access to your bank account information by going to https://my.plaid.com/","e-mail-communications#E-mail Communications":"From time to time, monetr may contact you via email for the purpose of providing announcements,\npromotional offers, alerts, confirmations, surveys, and/or other general communication.If you would like to stop receiving marketing or promotional communications via email from\nmonetr, you may opt out of such communications by clicking the \"unsubscribe\" button in the footer\nor body of the emails. Or by reaching out to support@monetr.app.","external-data-storage-sites#External Data Storage Sites":"We may store your data on servers provided by third party hosting vendors with whom we have\ncontracted.","changes-to-this-statement#Changes to this Statement":"monetr reserves the right to change this Privacy Policy from time to time. We will notify you about\nsignificant changes in the way we treat personal information by sending a notice to the primary\nemail address specified in your account, by placing a prominent notice on our application, and/or\nby updating any privacy information. Your continued use of the application and/or Services\navailable after such modifications will constitute your: (a) acknowledgment of the modified Privacy\nPolicy; and (b) agreement to abide and be bound by that Policy.","contact-information#Contact Information":"monetr welcomes your questions or comments regarding this Statement of Privacy. If you believe\nthat monetr has not adhered to this Statement, please contact monetr at:Email Address:\nsupport@monetr.appTelephone number:\n651 - 243 - 0035Effective as of September 12, 2022"}},"/pricing":{"title":"Pricing","data":{}},"/policy/terms":{"title":"Terms & Conditions","data":{"agreement-to-our-legal-terms#Agreement To Our Legal Terms":"We are monetr LLC, doing business as monetr (\"Company,\" \"we,\" \"us,\" \"our\"), a company registered in\nMinnesota, United States, located at PO Box 436, Lindstrom, MN 55045.We operate the https://monetr.app website (the \"Documentation and Landing Site\") and\nhttps://my.monetr.app (the \"Application Site\"), along with any related products and\nservices that reference or link to these legal terms (collectively, the \"Services\").These Terms and Conditions (\"Terms\") apply exclusively to your access and use of the hosted version of monetr,\navailable through the Documentation and Landing Site, the Application Site, and other hosted services we provide. Any\nuse, modification, or distribution of monetr outside of these Hosted Services is governed by the\nLICENSE under which monetr is distributed. Please refer to the\nmonetr license documentation for terms related to self-hosting or other non-commercial uses.You can contact us by phone at (651) 243-0035, via email at support@monetr.app, or by mail at PO Box 436, Lindstrom, MN\n55045, United States.These Legal Terms constitute a binding agreement between you (\"you\"), whether individually or on behalf of an\nentity, and monetr LLC, governing your access and use of the Services. By accessing the Services, you acknowledge that\nyou have read, understood, and agreed to be bound by these Legal Terms. IF YOU DO NOT AGREE TO ALL OF THESE LEGAL TERMS,\nYOU ARE PROHIBITED FROM USING THE SERVICES AND MUST DISCONTINUE USE IMMEDIATELY.We will provide you with prior notice of any scheduled changes to the Services you are using. The modified Legal Terms\nwill become effective upon posting or notifying you by support@monetr.app, as stated in the email message. By continuing\nto use the Services after the effective date of any changes, you agree to be bound by the modified terms.The Services are intended for users who are at least 13 years of age. All users who are minors in the jurisdiction in\nwhich they reside (generally under the age of 18) must have the permission of, and be directly supervised by, their\nparent or guardian to use the Services. If you are a minor, you must have your parent or guardian read and agree to\nthese Legal Terms prior to you using the Services.We recommend that you print a copy of these Legal Terms for your records.","table-of-contents#Table Of Contents":"1. Our Services\n2. Intellectual Property Rights\n3. User Representations\n4. User Registration\n5. Purchases And Payment\n6. Subscriptions\n7. Software\n8. Prohibited Activities\n9. User Content And Interactions\n10. User Content License\n11. Third-Party Websites And Content\n12. Services Management\n13. Privacy Policy\n14. Copyright Infringements\n15. Term And Termination\n16. Modifications And Interruptions\n17. Governing Law\n18. Dispute Resolution\n19. Corrections\n20. Disclaimer\n21. Limitations Of Liability\n22. Indemnification\n23. User Data\n24. Electronic Communications, Transactions, And Signatures\n25. California Users And Residents\n26. Miscellaneous\n27. Contact Us","1-our-services#1. Our Services":"The information provided when using the Services is not intended for distribution to or use by any person or entity in\nany jurisdiction or country where such distribution or use would be contrary to law or regulation or which would subject\nus to any registration requirement within such jurisdiction or country. Accordingly, those persons who choose to access\nthe Services from other locations do so on their own initiative and are solely responsible for compliance with local\nlaws, if and to the extent local laws are applicable.The Services are not tailored to comply with industry-specific regulations (Health Insurance Portability and\nAccountability Act (HIPAA), Federal Information Security Management Act (FISMA), etc.), so if your interactions would be\nsubjected to such laws, you may not use the Services. You may not use the Services in a way that would violate the\nGramm-Leach-Bliley Act (GLBA).","2-intellectual-property-rights#2. Intellectual Property Rights":"","our-intellectual-property#Our intellectual property":"We are the owner or licensee of all intellectual property rights in our Services, including proprietary elements such as\nsource code, databases, functionality, software, website designs, audio, video, text, photographs, and graphics in the\nServices (collectively, the \"Content\"). This includes original trademarks, service marks, and logos created and owned by\nmonetr (the \"Marks\").While our Content and monetr's Marks are protected by copyright, trademark laws, and various other intellectual property\nrights and unfair competition laws both in the United States and internationally, the Services may include logos, icons,\nand other brand elements that are used under applicable licenses, such as Creative Commons, or in a fair use capacity.The Content and monetr's Marks are provided in or through the Services \"AS IS\" for your personal, non-commercial use\nonly.","your-use-of-our-services#Your use of our Services":"Subject to your compliance with these Legal Terms, including the \"Prohibited Activities\"\nsection below, we grant you a non-exclusive, non-transferable, revocable license to:\naccess the Services; and\ndownload or print a copy of any portion of the Content to which you have properly gained access.\nsolely for your personal, non-commercial use.Except as set out in this section or elsewhere in our Legal Terms, no part of the Services and no Content or Marks may\nbe copied, reproduced, aggregated, republished, uploaded, posted, publicly displayed, encoded, translated, transmitted,\ndistributed, sold, licensed, or otherwise exploited for any commercial purpose whatsoever, without our express prior\nwritten permission.You are welcome to discuss, share, or publicly display parts of the Services or Content, provided that the content you\nshare is your own or reflects your personal use of the Services. If you wish to use the Services, Content, or Marks for\npurposes beyond personal sharing (such as commercial use, extensive reproduction, or public display beyond fair use),\nplease submit a request to support@monetr.app. If we grant permission for such use, you must identify us as the owners\nor licensors of the Services, Content, or Marks and ensure that any applicable copyright or proprietary notice is\nvisible when posting, reproducing, or displaying our Content.We reserve all rights not expressly granted to you in and to the Services, Content, and Marks.Any breach of these Intellectual Property Rights will constitute a material breach of our Legal Terms and your right to\nuse our Services will terminate immediately.","your-submissions-and-uploads#Your Submissions and Uploads":"Please review this section and the \"Prohibited Activities\" section carefully prior to using\nour Services to understand the (a) rights you grant us and (b) obligations you have when you upload any content through\nthe Services.User Uploads: By uploading files such as financial data, receipts, images, or other materials (\"Uploads\") through\nthe Services, you retain ownership of any intellectual property rights in those Uploads. We do not claim ownership of\nyour Uploads, and they remain private, used solely to enrich your experience with the Services. However, by uploading\nsuch content, you grant us a limited, non-exclusive license to use, store, and process these Uploads as necessary to\nprovide the Services.Prohibited Content: You agree that you will not upload any content that is illegal, harassing, hateful, defamatory,\nobscene, harmful, abusive, discriminatory, threatening, sexually explicit, or otherwise in violation of any law. Any\ncontent uploaded that breaches these terms may lead to the removal of such content, suspension or termination of your\naccount, and reporting to authorities if applicable.Warranties and Representations: By uploading content through the Services, you:\nConfirm that you have read and agree with our \"Prohibited Activities\";\nWarrant that you have the necessary rights and licenses to upload such content and that the content does not infringe\non any third party’s intellectual property rights;\nRepresent that your Uploads do not contain any confidential information owned by a third party without authorization.\nYour Responsibility: You are solely responsible for the content you upload. You agree to indemnify us for any losses\nthat we may suffer due to your breach of (a) this section, (b) any third party’s intellectual property rights, or (c)\napplicable law.Removal of Content: Although we do not monitor user-uploaded content proactively, we reserve the right to remove or\nedit any content that we reasonably consider to be in breach of these Legal Terms or harmful. We may suspend or disable\nyour account if such action is necessary.Copyright InfringementWe respect the intellectual property rights of others. If you believe that any material available on or through the\nServices infringes upon any copyright you own or control, please refer to the \"Copyright\nInfringement\" section below.","3-user-representations#3. User Representations":"By using the Services, you represent and warrant that: (1) all registration information you submit will be true,\naccurate, current, and complete; (2) you will maintain the accuracy of such information and promptly update such\nregistration information as necessary; (3) you have the legal capacity and you agree to comply with these Legal Terms;\n(4) you are not under the age of 13; (5) you are not a minor in the jurisdiction in which you reside, or if a minor, you\nhave received parental permission to use the Services; (6) you will not use the Services for any illegal or unauthorized\npurpose; and (7) your use of the Services will not violate any applicable law or regulation.If you provide any information that is untrue, inaccurate, not current, or incomplete, we have the right to suspend or\nterminate your account and refuse any and all current or future use of the Services (or any portion thereof).","4-user-registration#4. User Registration":"You may be required to register to use the Services. You agree to keep your password confidential and are responsible\nfor all use of your account and password. Your email address will serve as your username for accessing the Services.\nWhile we reserve the right to review account information and contact users regarding any inappropriate, obscene, or\nobjectionable content associated with their accounts, we will not change your registered email address without your\nconsent, as doing so could prevent you from accessing the Services.","5-purchases-and-payment#5. Purchases and Payment":"Payments for Services are processed through Stripe, which may support various forms of payment,\nincluding but not limited to:\nVisa\nMastercard\nAmerican Express\nDiscover\nPlease note that the accepted forms of payment are subject to change at any time based on the policies and offerings of\nStripe, our payment processor.You agree to provide current, complete, and accurate purchase and account information for all purchases made via the\nServices. You further agree to promptly update account and payment information, including email address, payment method,\nand payment card expiration date, so that we can complete your transactions and contact you as needed. Sales tax will be\nincluded in the purchase price and automatically calculated by Stripe, our payment processor, as required. All payments\nshall be in US dollars.You agree to pay all charges at the prices then in effect for your purchases, and you authorize us to charge your chosen\npayment provider for any such amounts upon placing your order. We reserve the right to correct any errors or mistakes in\npricing, even if we have already requested or received payment. If an error results in you being undercharged, you will\nnot be charged the difference for that specific transaction; monetr will cover the cost of the mistake. However,\nsubsequent subscription renewals will be charged at the correct price. If you are charged more than the correct price\ndue to an error, we will issue a refund for the difference as soon as we become aware of the error.We reserve the right to refuse any subscription or transaction placed through the Services. We may, in our sole\ndiscretion, limit or cancel the number of subscriptions or service plans associated with a single person, household, or\naccount. These restrictions may include subscriptions associated with the same customer account, payment method, and/or\nbilling address. We reserve the right to limit or prohibit subscriptions that, in our sole judgment, appear to be placed\nby dealers, resellers, or entities seeking to redistribute or misuse the Services.","6-subscriptions#6. Subscriptions":"Billing and RenewalYour subscription will continue and automatically renew unless canceled. You consent to our charging your payment method\non a recurring basis without requiring your prior approval for each recurring charge, until such time as you cancel the\napplicable order. The length of your billing cycle is monthly.Free TrialWe offer a 30-day free trial to new users who register with the Services. The account will not be charged and the\nsubscription will be suspended until upgraded to a paid version at the end of the free trial.CancellationAll purchases are non-refundable. You can cancel your subscription at any time by logging into your account. Your\ncancellation will take effect at the end of the current paid term. If you have any questions or are unsatisfied with our\nServices, please email us at support@monetr.app.Fee ChangesWe may, from time to time, make changes to the subscription fee and will communicate any price changes to you in\naccordance with applicable law.","7-software#7. Software":"We may include software for use in connection with our Services. If such software is accompanied by an end user license\nagreement (\"EULA\"), the terms of the EULA will govern your use of the software. If such software is not accompanied by a\nEULA, then we grant to you a non-exclusive, revocable, personal, and non-transferable license to use such software\nsolely in connection with our services and in accordance with these Legal Terms. Any software and any related\ndocumentation is provided \"AS IS\" without warranty of any kind, either express or implied, including, without\nlimitation, the implied warranties of merchantability, fitness for a particular purpose, or non-infringement. You accept\nany and all risk arising out of use or performance of any software. You may not reproduce or redistribute any software\nexcept in accordance with the EULA or these Legal Terms.","8-prohibited-activities#8. Prohibited Activities":"You may not access or use the Services for any purpose other than that for which we make the Services available. The\nServices may not be used in connection with any commercial endeavors except those that are specifically endorsed or\napproved by us.As a user of the Services, you agree not to:\nTrick, defraud, or mislead us and other users, especially in any attempt to learn sensitive account information such\nas user passwords.\nCircumvent, disable, or otherwise interfere with security-related features of the Services, including features that\nprevent or restrict the use or copying of any Content or enforce limitations on the use of the Services and/or the\nContent contained therein.\nUse any information obtained from the Services in order to harass, abuse, or harm another person.\nMake improper use of our support services or submit false reports of abuse or misconduct.\nUse the Services in a manner inconsistent with any applicable laws or regulations.\nEngage in unauthorized framing of or linking to the Services.\nUpload or transmit (or attempt to upload or transmit) viruses, Trojan horses, or other malicious material that\ninterferes with any party’s uninterrupted use and enjoyment of the Services or modifies, impairs, disrupts, alters, or\ninterferes with the use, features, functions, operation, or maintenance of the Services.\nEngage in any automated use of the system that degrades, disrupts, or negatively impacts the performance,\nfunctionality, or stability of the Services.\nDelete the copyright or other proprietary rights notice from any Content.\nAttempt to impersonate another user or person or use the username of another user.\nUpload or transmit (or attempt to upload or to transmit) any material that acts as a passive or active information\ncollection or transmission mechanism, including without limitation, clear graphics interchange formats (\"gifs\"), 1×1\npixels, web bugs, cookies, or other similar devices (sometimes referred to as \"spyware\" or \"passive collection\nmechanisms\" or \"pcms\").\nInterfere with, disrupt, or create an undue burden on the Services or the networks or services connected to the\nServices.\nHarass, annoy, intimidate, or threaten any of our employees or agents engaged in providing any portion of the\nServices to you.\nAttempt to bypass any measures of the Services designed to prevent or restrict access to the Services, or any\nportion of the Services.\nMake any unauthorized use of the Services, including collecting usernames and/or email addresses of users by\nelectronic or other means for the purpose of sending unsolicited email, or creating user accounts by automated means\nor under false pretenses.\nUse the Services as part of any effort to compete with us or otherwise use the Services and/or the Content for any\nrevenue-generating endeavor or commercial enterprise.\nUse the Services to advertise or offer to sell goods and services.\nSell or otherwise transfer your profile.\nInterfere with the service's operation, circumvent its access restrictions or conduct any security or vulnerability\ntest of the service.\nTransmit any viruses or harmful materials to the Service.","9-user-content-and-interactions#9. User Content and Interactions":"While monetr does not include public forums, message boards, or social interaction features within the Services, users\nmay interact with us and other community members through platforms such as GitHub for issues, pull requests, and\ndiscussions. These interactions are subject to the terms and conditions of the respective platform (e.g., GitHub) and\nnot directly covered by these Terms of Use.For any content or material you upload or submit through the Services (e.g., financial documents, images, or data):\nYou represent and warrant that you have the necessary rights, licenses, and permissions to upload or submit such\ncontent and that it does not violate any laws or third-party rights.\nYour uploaded content must not contain harmful, illegal, or objectionable material as outlined in the \"Prohibited\nActivities\" section.\nAny use of the Services in violation of these standards may result in the suspension or termination of your rights to\nuse the Services.","10-user-content-license#10. User Content License":"By uploading or submitting any content (e.g., financial data, documents, images) through the Services, you grant us a\nnon-exclusive, worldwide, royalty-free license to use, host, store, and process your content solely for the purpose of\noperating, improving, and providing the Services. This license enables us to facilitate features such as data analysis,\nstorage, and support, while respecting your ownership rights.You retain full ownership of all content you submit or upload and any associated intellectual property rights. We do not\nclaim ownership over your content and will not use it for commercial purposes outside the scope of providing the\nServices.You are solely responsible for the content you upload and represent that you have the necessary rights and permissions\nto submit such content. We are not liable for any statements or representations made by you in any content you provide.We reserve the right, at our discretion, to remove or modify any content that we determine violates these Legal Terms or\nis otherwise objectionable, without prior notice. However, we have no obligation to pre-screen or monitor user content.","11-third-party-websites-and-content#11. Third-Party Websites And Content":"The Services may contain (or you may be sent via the Site) links to other websites (\"Third-Party Websites\") as well as\narticles, photographs, text, graphics, pictures, designs, music, sound, video, information, applications, software, and\nother content or items belonging to or originating from third parties (\"Third-Party Content\"). Such Third-Party Websites\nand Third-Party Content are not investigated, monitored, or checked for accuracy, appropriateness, or completeness by\nus, and we are not responsible for any Third-Party Websites accessed through the Services or any Third-Party Content\nposted on, available through, or installed from the Services, including the content, accuracy, offensiveness, opinions,\nreliability, privacy practices, or other policies of or contained in the Third-Party Websites or the Third-Party\nContent. Inclusion of, linking to, or permitting the use or installation of any Third-Party Websites or any\nThird-Party Content does not imply approval or endorsement thereof by us. If you decide to leave the Services and access\nthe Third-Party Websites or to use or install any Third-Party Content, you do so at your own risk, and you should be\naware these Legal Terms no longer govern. You should review the applicable terms and policies, including privacy and\ndata gathering practices, of any website to which you navigate from the Services or relating to any applications you use\nor install from the Services. Any purchases you make through Third-Party Websites will be through other websites and\nfrom other companies, and we take no responsibility whatsoever in relation to such purchases which are exclusively\nbetween you and the applicable third party. You agree and acknowledge that we do not endorse the products or services\noffered on Third-Party Websites and you shall hold us blameless from any harm caused by your purchase of such products\nor services. Additionally, you shall hold us blameless from any losses sustained by you or harm caused to you relating\nto or resulting in any way from any Third-Party Content or any contact with Third-Party Websites.","12-services-management#12. Services Management":"We reserve the right, but not the obligation, to: (1) monitor the Services for violations of these Legal Terms; (2) take\nappropriate legal action against anyone who, in our sole discretion, violates the law or these Legal Terms, including\nwithout limitation, reporting such user to law enforcement authorities; (3) in our sole discretion and without\nlimitation, refuse, restrict access to, limit the availability of, or disable (to the extent technologically feasible)\nany of your Contributions or any portion thereof; (4) in our sole discretion and without limitation, notice, or\nliability, to remove from the Services or otherwise disable all files and content that are excessive in size or are in\nany way burdensome to our systems; and (5) otherwise manage the Services in a manner designed to protect our rights and\nproperty and to facilitate the proper functioning of the Services.","13-privacy-policy#13. Privacy Policy":"We care about data privacy and security. Please review our Privacy\nPolicy: https://monetr.app/policy/privacy. By using the Services, you agree to\nbe bound by our Privacy Policy, which is incorporated into these Legal Terms. Please be advised the Services are hosted\nin the United States. If you access the Services from any other region of the world with laws or other requirements\ngoverning personal data collection, use, or disclosure that differ from applicable laws in the United States, then\nthrough your continued use of the Services, you are transferring your data to the United States, and you expressly\nconsent to have your data transferred to and processed in the United States. Further, we do not knowingly accept,\nrequest, or solicit information from children or knowingly market to children. Therefore, in accordance with the U.S.\nChildren’s Online Privacy Protection Act, if we receive actual knowledge that anyone under the age of 13 has provided\npersonal information to us without the requisite and verifiable parental consent, we will delete that information from\nthe Services as quickly as is reasonably practical.","14-copyright-infringements#14. Copyright Infringements":"We respect the intellectual property rights of others. If you believe that any material available on or through the\nServices infringes upon any copyright you own or control, please immediately notify us using the contact information\nprovided below (a \"Notification\"). A copy of your Notification will be sent to the person who posted or stored the\nmaterial addressed in the Notification. Please be advised that pursuant to applicable law you may be held liable for\ndamages if you make material misrepresentations in a Notification. Thus, if you are not sure that material located on or\nlinked to by the Services infringes your copyright, you should consider first contacting an attorney.","15-term-and-termination#15. Term And Termination":"These Legal Terms shall remain in full force and effect while you use the Services. WITHOUT LIMITING ANY OTHER PROVISION\nOF THESE LEGAL TERMS, WE RESERVE THE RIGHT TO, IN OUR SOLE DISCRETION AND WITHOUT NOTICE OR LIABILITY, DENY ACCESS TO\nAND USE OF THE SERVICES (INCLUDING BLOCKING CERTAIN IP ADDRESSES), TO ANY PERSON FOR ANY REASON OR FOR NO REASON,\nINCLUDING WITHOUT LIMITATION FOR BREACH OF ANY REPRESENTATION, WARRANTY, OR COVENANT CONTAINED IN THESE LEGAL TERMS OR\nOF ANY APPLICABLE LAW OR REGULATION. WE MAY TERMINATE YOUR USE OR PARTICIPATION IN THE SERVICES OR DELETE YOUR ACCOUNT\nAND ANY CONTENT OR INFORMATION THAT YOU POSTED AT ANY TIME, WITHOUT WARNING, IN OUR SOLE DISCRETION.If we terminate or suspend your account for any reason, you are prohibited from registering and creating a new account\nunder your name, a fake or borrowed name, or the name of any third party, even if you may be acting on behalf of the\nthird party. In addition to terminating or suspending your account, we reserve the right to take appropriate legal\naction, including without limitation pursuing civil, criminal, and injunctive redress.","16-modifications-and-interruptions#16. Modifications And Interruptions":"We reserve the right to change, modify, or remove the contents of the Services at any time or for any reason at our sole\ndiscretion without notice. However, we have no obligation to update any information on our Services. We will not be\nliable to you or any third party for any modification, price change, suspension, or discontinuance of the Services.We cannot guarantee the Services will be available at all times. We may experience hardware, software, or other problems\nor need to perform maintenance related to the Services, resulting in interruptions, delays, or errors. We reserve the\nright to change, revise, update, suspend, discontinue, or otherwise modify the Services at any time or for any reason\nwithout notice to you. You agree that we have no liability whatsoever for any loss, damage, or inconvenience caused by\nyour inability to access or use the Services during any downtime or discontinuance of the Services. Nothing in these\nLegal Terms will be construed to obligate us to maintain and support the Services or to supply any corrections, updates,\nor releases in connection therewith.","17-governing-law#17. Governing Law":"These Legal Terms and your use of the Services are governed by and construed in accordance with the laws of the State of\nMinnesota applicable to agreements made and to be entirely performed within the State of Minnesota, without regard to\nits conflict of law principles.","18-dispute-resolution#18. Dispute Resolution":"Informal NegotiationsTo expedite resolution and control the cost of any dispute, controversy, or claim related to these Legal Terms (each a\n\"Dispute\" and collectively, the \"Disputes\") brought by either you or us (individually, a \"Party\" and collectively, the\n\"Parties\"), the Parties agree to first attempt to negotiate any Dispute (except those Disputes expressly provided below)\ninformally for at least thirty (30) days before initiating arbitration. Such informal negotiations commence upon written\nnotice from one Party to the other Party.Binding ArbitrationIf the Parties are unable to resolve a Dispute through informal negotiations, the Dispute (except those Disputes\nexpressly excluded below) will be finally and exclusively resolved by binding arbitration. YOU UNDERSTAND THAT WITHOUT\nTHIS PROVISION, YOU WOULD HAVE THE RIGHT TO SUE IN COURT AND HAVE A JURY TRIAL. The arbitration shall be commenced and\nconducted under the Commercial Arbitration Rules of the American Arbitration Association (\"AAA\") and, where appropriate,\nthe AAA’s Supplementary Procedures for Consumer Related Disputes (\"AAA Consumer Rules\"), both of which are available at\nthe American Arbitration Association (AAA) website. Your arbitration fees and your share of\narbitrator compensation shall be governed by the AAA Consumer Rules and, where appropriate, limited by the AAA Consumer\nRules. If such costs are determined by the arbitrator to be excessive, we will pay all arbitration fees and expenses.\nThe arbitration may be conducted in person, through the submission of documents, by phone, or online. The arbitrator\nwill make a decision in writing, but need not provide a statement of reasons unless requested by either Party. The\narbitrator must follow applicable law, and any award may be challenged if the arbitrator fails to do so. Except where\notherwise required by the applicable AAA rules or applicable law, the arbitration will take place in Chisago County,\nMinnesota. Except as otherwise provided herein, the Parties may litigate in court to compel arbitration, stay\nproceedings pending arbitration, or to confirm, modify, vacate, or enter judgment on the award entered by the\narbitrator.If for any reason, a Dispute proceeds in court rather than arbitration, the Dispute shall be commenced or prosecuted in\nthe  state and federal courts located in Chisago County, Minnesota, and the Parties hereby consent to, and waive all\ndefenses of lack of personal jurisdiction, and forum non conveniens with respect to venue and jurisdiction in such state\nand federal courts. Application of the United Nations Convention on Contracts for the International Sale of Goods and\nthe Uniform Computer Information Transaction Act (UCITA) are excluded from these Legal Terms.In no event shall any Dispute brought by either Party related in any way to the Services be commenced more than one (1)\nyears after the cause of action arose. If this provision is found to be illegal or unenforceable, then neither Party\nwill elect to arbitrate any Dispute falling within that portion of this provision found to be illegal or unenforceable\nand such Dispute shall be decided by a court of competent jurisdiction within the courts listed for jurisdiction above,\nand the Parties agree to submit to the personal jurisdiction of that court.RestrictionsThe Parties agree that any arbitration shall be limited to the Dispute between the Parties individually. To the full\nextent permitted by law, (a) no arbitration shall be joined with any other proceeding; (b) there is no right or\nauthority for any Dispute to be arbitrated on a class-action basis or to utilize class action procedures; and (c) there\nis no right or authority for any Dispute to be brought in a purported representative capacity on behalf of the general\npublic or any other persons.Exceptions to Informal Negotiations and ArbitrationThe Parties agree that the following Disputes are not subject to the above provisions concerning informal negotiations\nbinding arbitration: (a) any Disputes seeking to enforce or protect, or concerning the validity of, any of the\nintellectual property rights of a Party; (b) any Dispute related to, or arising from, allegations of theft, piracy,\ninvasion of privacy, or unauthorized use; and (c) any claim for injunctive relief. If this provision is found to be\nillegal or unenforceable, then neither Party will elect to arbitrate any Dispute falling within that portion of this\nprovision found to be illegal or unenforceable and such Dispute shall be decided by a court of competent jurisdiction\nwithin the courts listed for jurisdiction above, and the Parties agree to submit to the personal jurisdiction of that\ncourt.","19-corrections#19. Corrections":"There may be information on the Services that contains typographical errors, inaccuracies, or omissions, including\ndescriptions, pricing, availability, and various other information. We reserve the right to correct any errors,\ninaccuracies, or omissions and to change or update the information on the Services at any time, without prior notice.","20-disclaimer#20. Disclaimer":"THE SERVICES ARE PROVIDED ON AN AS-IS AND AS-AVAILABLE BASIS. YOU AGREE THAT YOUR USE OF THE SERVICES WILL BE AT YOUR\nSOLE RISK. TO THE FULLEST EXTENT PERMITTED BY LAW, WE DISCLAIM ALL WARRANTIES, EXPRESS OR IMPLIED, IN CONNECTION WITH\nTHE SERVICES AND YOUR USE THEREOF, INCLUDING, WITHOUT LIMITATION, THE IMPLIED WARRANTIES OF MERCHANTABILITY, FITNESS FOR\nA PARTICULAR PURPOSE, AND NON-INFRINGEMENT. WE MAKE NO WARRANTIES OR REPRESENTATIONS ABOUT THE ACCURACY OR COMPLETENESS\nOF THE SERVICES' CONTENT OR THE CONTENT OF ANY WEBSITES OR MOBILE APPLICATIONS LINKED TO THE SERVICES AND WE WILL ASSUME\nNO LIABILITY OR RESPONSIBILITY FOR ANY (1) ERRORS, MISTAKES, OR INACCURACIES OF CONTENT AND MATERIALS, (2) PERSONAL\nINJURY OR PROPERTY DAMAGE, OF ANY NATURE WHATSOEVER, RESULTING FROM YOUR ACCESS TO AND USE OF THE SERVICES, (3) ANY\nUNAUTHORIZED ACCESS TO OR USE OF OUR SECURE SERVERS AND/OR ANY AND ALL PERSONAL INFORMATION AND/OR FINANCIAL INFORMATION\nSTORED THEREIN, (4) ANY INTERRUPTION OR CESSATION OF TRANSMISSION TO OR FROM THE SERVICES, (5) ANY BUGS, VIRUSES, TROJAN\nHORSES, OR THE LIKE WHICH MAY BE TRANSMITTED TO OR THROUGH THE SERVICES BY ANY THIRD PARTY, AND/OR (6) ANY ERRORS OR\nOMISSIONS IN ANY CONTENT AND MATERIALS OR FOR ANY LOSS OR DAMAGE OF ANY KIND INCURRED AS A RESULT OF THE USE OF ANY\nCONTENT POSTED, TRANSMITTED, OR OTHERWISE MADE AVAILABLE VIA THE SERVICES. WE DO NOT WARRANT, ENDORSE, GUARANTEE, OR\nASSUME RESPONSIBILITY FOR ANY PRODUCT OR SERVICE ADVERTISED OR OFFERED BY A THIRD PARTY THROUGH THE SERVICES, ANY\nHYPERLINKED WEBSITE, OR ANY WEBSITE OR MOBILE APPLICATION FEATURED IN ANY BANNER OR OTHER ADVERTISING, AND WE WILL NOT\nBE A PARTY TO OR IN ANY WAY BE RESPONSIBLE FOR MONITORING ANY TRANSACTION BETWEEN YOU AND ANY THIRD-PARTY PROVIDERS OF\nPRODUCTS OR SERVICES. AS WITH THE PURCHASE OF A PRODUCT OR SERVICE THROUGH ANY MEDIUM OR IN ANY ENVIRONMENT, YOU SHOULD\nUSE YOUR BEST JUDGMENT AND EXERCISE CAUTION WHERE APPROPRIATE.","21-limitations-of-liability#21. Limitations Of Liability":"IN NO EVENT WILL WE OR OUR DIRECTORS, EMPLOYEES, OR AGENTS BE LIABLE TO YOU OR ANY THIRD PARTY FOR ANY DIRECT, INDIRECT,\nCONSEQUENTIAL, EXEMPLARY, INCIDENTAL, SPECIAL, OR PUNITIVE DAMAGES, INCLUDING LOST PROFIT, LOST REVENUE, LOSS OF DATA,\nOR OTHER DAMAGES ARISING FROM YOUR USE OF THE SERVICES, EVEN IF WE HAVE BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.\nNOTWITHSTANDING ANYTHING TO THE CONTRARY CONTAINED HEREIN, OUR LIABILITY TO YOU FOR ANY CAUSE WHATSOEVER AND REGARDLESS\nOF THE FORM OF THE ACTION, WILL AT ALL TIMES BE LIMITED TO THE AMOUNT PAID, IF ANY, BY YOU TO US DURING THE forty eight\n(48) mONTH PERIOD PRIOR TO ANY CAUSE OF ACTION ARISING. CERTAIN US STATE LAWS AND INTERNATIONAL LAWS DO NOT ALLOW\nLIMITATIONS ON IMPLIED WARRANTIES OR THE EXCLUSION OR LIMITATION OF CERTAIN DAMAGES. IF THESE LAWS APPLY TO YOU, SOME OR\nALL OF THE ABOVE DISCLAIMERS OR LIMITATIONS MAY NOT APPLY TO YOU, AND YOU MAY HAVE ADDITIONAL RIGHTS.","22-indemnification#22. Indemnification":"You agree to defend, indemnify, and hold us harmless, including our subsidiaries, affiliates, and all of our respective\nofficers, agents, partners, and employees, from and against any loss, damage, liability, claim, or demand, including\nreasonable attorneys’ fees and expenses, made by any third party due to or arising out of: (1) your Contributions; (2)\nuse of the Services; (3) breach of these Legal Terms; (4) any breach of your representations and warranties set forth in\nthese Legal Terms; (5) your violation of the rights of a third party, including but not limited to intellectual property\nrights; or (6) any overt harmful act toward any other user of the Services with whom you connected via the Services.\nNotwithstanding the foregoing, we reserve the right, at your expense, to assume the exclusive defense and control of any\nmatter for which you are required to indemnify us, and you agree to cooperate, at your expense, with our defense of such\nclaims. We will use reasonable efforts to notify you of any such claim, action, or proceeding which is subject to this\nindemnification upon becoming aware of it.","23-user-data#23. User Data":"We will maintain certain data that you transmit to the Services for the purpose of managing the performance of the\nServices, as well as data relating to your use of the Services. Although we perform regular routine backups of data, you\nare solely responsible for all data that you transmit or that relates to any activity you have undertaken using the\nServices. You agree that we shall have no liability to you for any loss or corruption of any such data, and you hereby\nwaive any right of action against us arising from any such loss or corruption of such data.","24-electronic-communications-transactions-and-signatures#24. Electronic Communications, Transactions, And Signatures":"Visiting the Services, sending us emails, and completing online forms constitute electronic communications. You consent\nto receive electronic communications, and you agree that all agreements, notices, disclosures, and other communications\nwe provide to you electronically, via email and on the Services, satisfy any legal requirement that such communication\nbe in writing. YOU HEREBY AGREE TO THE USE OF ELECTRONIC SIGNATURES, CONTRACTS, ORDERS, AND OTHER RECORDS, AND TO\nELECTRONIC DELIVERY OF NOTICES, POLICIES, AND RECORDS OF TRANSACTIONS INITIATED OR COMPLETED BY US OR VIA THE SERVICES.\nYou hereby waive any rights or requirements under any statutes, regulations, rules, ordinances, or other laws in any\njurisdiction which require an original signature or delivery or retention of non-electronic records, or to payments or\nthe granting of credits by any means other than electronic means.","25-california-users-and-residents#25. California Users And Residents":"If any complaint with us is not satisfactorily resolved, you can contact the Complaint Assistance Unit of the Division\nof Consumer Services of the California Department of Consumer Affairs in writing at 1625 North Market Blvd., Suite N\n112, Sacramento, California 95834 or by telephone at (800) 952-5210 or (916) 445-1254.","26-miscellaneous#26. Miscellaneous":"These Legal Terms and any policies or operating rules posted by us on the Services or in respect to the Services\nconstitute the entire agreement and understanding between you and us. Our failure to exercise or enforce any right or\nprovision of these Legal Terms shall not operate as a waiver of such right or provision. These Legal Terms operate to\nthe fullest extent permissible by law. We may assign any or all of our rights and obligations to others at any time. We\nshall not be responsible or liable for any loss, damage, delay, or failure to act caused by any cause beyond our\nreasonable control. If any provision or part of a provision of these Legal Terms is determined to be unlawful, void, or\nunenforceable, that provision or part of the provision is deemed severable from these Legal Terms and does not affect\nthe validity and enforceability of any remaining provisions. There is no joint venture, partnership, employment or\nagency relationship created between you and us as a result of these Legal Terms or use of the Services. You agree that\nthese Legal Terms will not be construed against us by virtue of having drafted them. You hereby waive any and all\ndefenses you may have based on the electronic form of these Legal Terms and the lack of signing by the parties hereto to\nexecute these Legal Terms.","27-contact-us#27. Contact Us":"In order to resolve a complaint regarding the Services or to receive further information regarding use of the Services,\nplease contact us at:\nmonetr LLC\nPO Box 436\nLindstrom, MN 55045\nUnited States\nPhone: (651) 243-0035Email: support@monetr.app"}}}